{
    "thread": {
        "uuid": "84d77b0666db56901aec0a91901c14c71f73a809",
        "url": "https://www.alternet.org/how-one-of-the-nations-largest-opioid-makers-escaped-a-7-billion-federal-penalty",
        "site_full": "www.alternet.org",
        "site": "alternet.org",
        "site_section": "https://www.alternet.org/feed",
        "site_categories": [
            "media"
        ],
        "section_title": "Alternet.org",
        "title": "How one of the nation’s largest opioid makers escaped a $7 billion federal penalty",
        "title_full": "How one of the nation’s largest opioid makers escaped a $7 billion federal penalty",
        "published": "2024-12-17T14:47:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "main_image": "https://www.alternet.org/media-library/image.jpg?id=33677525&width=1200&height=600&coordinates=0%2C712%2C0%2C713",
        "performance_score": 0,
        "domain_rank": 2698,
        "domain_rank_updated": "2024-12-16T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "84d77b0666db56901aec0a91901c14c71f73a809",
    "url": "https://www.alternet.org/how-one-of-the-nations-largest-opioid-makers-escaped-a-7-billion-federal-penalty",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "ProPublica",
    "published": "2024-12-17T14:47:00.000+02:00",
    "title": "How one of the nation’s largest opioid makers escaped a $7 billion federal penalty",
    "text": "How one of the nation’s largest opioid makers escaped a $7 billion federal penalty\nReporting Highlights\n- Delayed Justice: After a whistleblower exposed the criminal behavior of Endo, a drug manufacturer, the Justice Department waited more than a decade to bring charges against the company.\n- A Steep Discount: Federal agencies said Endo owed up to $7 billion in criminal fines, back taxes and other charges. The government settled this year for just $200 million.\n- Winners and Losers: Endo is still selling narcotics. Lawyers made $350 million. A few executives shared $95 million in bonuses. Thousands of opioid victims are to share $40 million.\nThese highlights were written by the reporters and editors who worked on this story.\nThis spring, the Justice Department announced a major victory against a drug firm that manufactured billions of opioid painkillers. Endo Health Solutions, the agency said, would face $1.5 billion in fines and forfeitures and plead guilty to a corporate criminal charge.\nProsecutors said the massive fine would hold accountable a suburban Philadelphia company that profited by “misrepresenting the safety of their opioid products and using reckless marketing tactics to increase sales.”\nBut in the end, federal prosecutors offered far friendlier terms than those trumpeted by the agency.\nEndo would not have to pay the $1.5 billion in criminal penalties, which was already a deep discount from the billions federal officials said Endo owed for dodging taxes and driving up Medicare costs.\nIn what amounted to a liability fire sale by the Justice Department, the company’s woes with the federal government would all be resolved by a $200 million payment.\nIn sentencing Endo in federal court in May, Judge Linda Parker wondered how the amount paid to the U.S. could be so low.\n“I don’t understand. I really don’t understand,” Parker said. “I just don’t understand how it went from $1 billion to $200 million.”\nFederal prosecutor Benjamin Cornfeld explained: Endo was broke.\n“The reality is that there are limited funds available because the debtors were in bankruptcy,” Cornfeld said.\nBut a fuller explanation, drawn from corporate filings, interviews, and criminal court and bankruptcy records, shows how the DOJ, after years of aggressively prosecuting opioid companies, delayed for a decade a winning criminal case against Endo. In the intervening years, Endo vastly expanded its narcotic-pill empire before executing a corporate escape plan.\nCodenamed Project Zed, the plan allowed Endo to restructure its debt to retain control of the company and hand out $95 million in executive bonuses before seeking protection in bankruptcy. The result for U.S. taxpayers: Endo paid a tiny fraction — three pennies on the dollar — of the $7 billion that officials said it owed the U.S. government, including $4 billion in taxes.\nEndo is not a household name. But by 2018, a year when 15,000 Americans overdosed and died on prescription painkillers, Endo and the firms it purchased had sold 33 billion opioid pills over two decades, almost three times the number sold by Purdue Pharma, the Sackler family’s OxyContin powerhouse.\nThough federal prosecutors first learned about Endo’s criminal behavior in a 2013 whistleblower suit, they dropped their investigation, even as they doggedly pursued Purdue. By the time DOJ prosecutors revived the allegations against Endo early this year, the company was bankrupt.\nHundreds of lawyers, paralegals and financial advisers litigated Endo’s bankruptcy, billing more than $350 million. Some lawyers charged more than $2,000 an hour. Paul Leake, Endo’s lead attorney, said in a court filing that the bankruptcy plan “extinguished” Endo’s liabilities for “a fraction of the debtors’ total criminal and civil exposure.”\nIndividual opioid victims didn’t fare as well. They got just $40 million from Endo — a sum that works out to about $1,000 per victim. In comparison, people hurt by bankrupt Purdue, the poster firm for the U.S. painkiller trauma, were to share up to $750 million. Purdue victims are to receive sums ranging from $3,500 to $48,000.\nMargo Siminovitch, an attorney representing opioid victims, was the fiercest critic of the plan. At the bankruptcy’s last major hearing, she told the judge that lawyers in the case earned hourly rates that “exceed what an opioid victim who’s had their life devastated is going to get.”\nEndo “came with a strategy purposely intended to reduce payments to opioid victims,” Siminovitch said in an interview. “All of the [Endo] opioid victims were burned by this process, in that they were going to get virtually nothing.”\nProfiting From Pain Management\nSpun out of DuPont Merck in 1997, Endo — the name is Greek for “inside” — set out to make money “in the changing landscape of pain management,” and for 20 years it did just that.\nThe company started with Percocet: It upped the per-pill opioid dosage and whipped up sales through promotions and a contest among salespeople where BMW corporate cars were the prize. Revenue soared.\nEndo’s next big bet was Opana ER, an extended-release painkiller that won the Food and Drug Administration’s approval in 2006. Opana ER became its flagship opioid, Endo’s answer to Purdue’s OxyContin. Endo launched the brand with a $48 million marketing campaign and began, in a phrase Endo used internally, “hyper-targeting” heavy opioid prescribers.\nTo ease deep-seated concerns over opioid addiction, Endo also linked up with other pharma companies to try to reshape the public image of prescription narcotics. The firm poured millions into advocacy front groups, notably the American Pain Foundation, which contended doctors feared opioids “because they mistakenly think their patients will become addicted.” The foundation shut down the day a Senate committee announced it was probing the industry groups.\nLarry Romaine, Endo’s senior vice president for sales, told subordinates in a 2012 voicemail that salespeople had to be “laser focused” on selling Opana ER. “If we have reps out there, I don’t care who they are, that can’t sell Opana ER clinically, they can’t be with Endo. OK?” he said.\nHis voicemail and other material from inside Endo, including emails, became public court records in lawsuits filed against the company.\nEndo declined to comment for this story and would not respond to detailed questions sent to the firm. Former Endo employees, including those whose communications were entered into court records and are cited in this story, did not return emails and phone calls seeking comment.\nIn an email sent in 2009, Endo sales manager Bret Anderson wrote to his team, referencing requirements to identify and cut off doctors who prescribed suspiciously high volumes of opioid drugs, with a warning that if too many doctors were flagged it could hurt business. “I also consider the rule: ‘if you are not aware of any major issues, it is probably not a problem.’”\nAt Endo’s headquarters, Linda Kitlinski oversaw Endo’s education programs for doctors for 16 years. In 2009 she sent an email to her husband documenting her concerns that “Endo’s senior leadership” was pressuring her to improperly use her program as a sales tool. Soon after she raised these issues internally, her boss called her into his office and warned her that she had nearly been fired because she was “an impediment to the business.” She needed to stop “playing policeman.”\nWhen Endo salespeople alerted bosses to dangerous doctors, lawsuit testimony revealed that the company, unlike other manufacturers, never reported those suspicions to the Drug Enforcement Administration. Those reports were required by law.\nIn Alabama, Endo sales reps made 1,200 visits to a Mobile clinic where two doctors wrote “thousands of Opana ER prescriptions after Endo knew the clinic to be engaged in abuse,” the government said this year in its criminal case against Endo. Prosecutors said the clinic had a crowded waiting room with intoxicated customers, armed guards and medical staff “abusing controlled substances on-site.”\nIn Knoxville, Tennessee, where Endo sold more Opana ER pills than in New York City, Los Angeles and Chicago combined, a sales rep reported to supervisors that one doctor had “patients waiting in the parking lot in lounge chairs,” and “it is just a matter of time before the DEA closes him down.”\nIn Pittsburgh, more than 100 pharmacies refused to fill prescriptions for a reckless doctor, yet Endo continued to supply him. He was the nation’s largest Opana ER prescriber, according to an Endo email.\nDoctors in those clinics were eventually sentenced to prison.\nSeparately, records show that of Endo’s 20 biggest Opana ER prescribers in the Medicare program in 2016, four clinic operators would later be convicted of running multimillion-dollar pill mills. A fifth would lose her medical license for dangerous prescribing.\nAs it became clear that opioids were causing a health crisis, Endo came up with a response. It engineered a new, purportedly safer pill with a hard outer shell to make it more difficult to extract the active opioid, branding it as Opana ER “with Intac Technology.”\nBut there was a big problem: The FDA found the retooled drug to be no safer than the old version. For three years, the agency warned Endo that the pill could be “readily prepared for injection” — an even riskier high than snorting because of the danger of sharing needles.\nWithin Endo, Bob Barto, the vice president for regulatory affairs, warned in a 2010 email against using the Intac slogan “because we don’t have any data to demonstrate that the technology conveys any benefit to the patient.”\nEndo leaders didn’t drop the marketing approach. In the new drug’s slogan, the company said the pills were “designed to be crush resistant,” stopping short of saying they actually were crush resistant.\nIn early 2012, William Best, an Endo executive who dealt with regulators, emailed internally to say he was comfortable with promoting Opana as designed to be safe. While acknowledging that the language might provoke FDA disapproval, Best wrote, “it is likely to be a warning letter.”\nAs the company began selling its new formulation, the firm declared in marketing material: “At Endo, we are doing our part to limit abuse.”\nWarning Signs for Endo\nIn 2013, a whistleblower emerged from the Endo salesforce. Her name was Loretta Reed.\nA veteran in the pharma industry, Reed had worked for Endo for seven years when she filed a lawsuit in Philadelphia federal court alleging that top executives were intent on selling the updated version of Opana ER as safer, despite the FDA’s rejection of that claim. The 50-year-old’s job was to market Endo’s pain drugs to doctors in the Atlantic City, New Jersey, area.\nEndo leaders distributed marketing gimmicks, notably kits with samples of Opana ER’s new hard covering, Reed disclosed. Salespeople deployed the kits, she said in the suit, to demonstrate the toughness of the pills, pounding samples with hammers and microwaving them — the kinds of misleading tactics cited later as part of Endo’s guilty plea.\nBut while hammering and microwaving demonstrated the new pill’s exterior strength, it left doctors uninformed about the other ways the narcotic active ingredient, oxymorphone, could be extracted by abusers, including by cutting, chewing, grinding and heating the pills for injection.\nEndo’s marketing was “purposely designed to fraudulently manipulate prescribing physicians,” Reed’s suit charged. She said the company’s management misled the sales force about the FDA’s concerns.\nIndeed, Endo’s own research, provided to the FDA in 2016, showed that many users switched to shooting up when abusing the product.\nIn 2017, a senior medical adviser with the Centers for Disease Control and Prevention investigated the role Opana ER had played in an HIV outbreak in Indiana after doctors diagnosed 135 people with the disease, all of them tightly concentrated in a rural county. Narcotics users had extracted the oxymorphone from Opana ER and shot it up, with many sharing needles.\nIn his report, the CDC investigator quoted a drug user as saying that once Opana ER added its hard cover, “You had to cook them. … It pretty much forced me to have to inject really.”\nSaid another: “I couldn’t find any [original] Opanas or other pain medicine to snort. It became almost non-existent. So I was turned on to shooting up. So that’s pretty much how that went down.”\nReed’s allegations of mislabeling were strikingly similar to those made by an Endo salesperson eight years earlier. In a 2005 federal lawsuit, sales rep Peggy Ryan had reported that top executives had relentlessly pushed the sales force to sell the nonopioid shingles drug Lidoderm off-label for everything from sore backs to carpal tunnel. Ryan declined to comment for this story.\nFederal prosecutors had embraced Ryan’s suit, using her to gather evidence. Ryan wore a wire for the FBI for two years. The criminal investigation advanced slowly, but in early 2014, Endo admitted it had illegally misbranded Lidoderm. It paid a $192 million fine and signed a “corporate integrity agreement” promising to improve its ethics. The deal permitted it to keep doing business with Medicare, despite a law mandating that criminal pharma firms be cut off.\nAs for new whistleblower Reed’s allegations involving Endo’s leading narcotic painkiller — a far more dangerous drug than Lidoderm — the Justice Department took them seriously at first. Federal officials put together a task force of prosecutors and FDA investigators.\nBy the fall of 2014, eight months after charging Endo over Lidoderm, prosecutors had decided to end their probe regarding Opana ER, Philadelphia court documents show. That led Reed to withdraw the case in 2015. Prosecutors would not discuss their reasons for dropping the Opana ER investigation.\nThe Justice Department did not answer questions in detail for this article, but in a statement it praised the deal it finally reached with Endo this year that “secured a victory for American taxpayers and other stakeholders.”\nReed’s lawsuit aside, Endo still saw promise in opioids. New chief executive Rajiv De Silva, who took charge in 2013, executed an ambitious acquisition strategy, taking on debt to buy Par Pharmaceuticals, a maker of generic opioids that was churning out billions of pills a year, for $8 billion.\nThe timing was terrible. After Endo’s expensive wager on Par, the national conversation over opioids darkened. Tens of thousands had overdosed and social costs exploded. Cities and counties across the nation, linking up with aggressive personal-injury law firms, sued opioid players at every rung of the business, from pillmakers to distributors to pharmacies to doctors. More than 40 state attorneys general joined together to demand compensation from opioid firms.\nIn 2017, the FDA held two days of emotional public hearings on Opana ER that laid bare its dangers.\nNot long after, the agency asked Endo to take Opana ER with Intac Technology off the market, a first in modern times for an approved opioid. If Endo didn’t remove the drug, the FDA said it would. Endo complied. By then, Endo had made $543 million in profits over six years selling the painkiller.\nIn 2018, federal prosecutors subpoenaed opioid-related records from Endo. After the FBI contacted Reed, now living in Florida, about the allegations made in her withdrawn Philadelphia case, her lawyer, Eric Young, refiled the whistleblower suit in Florida. But it would be another five years before federal prosecutors would bring criminal charges against Endo.\nLaunching Project Zed\nAs the feds delayed, Endo acted.\nFacing a growing wave of lawsuits, Endo spent heavily on legal fees — ultimately paying $345 million. Its fierce legal strategy generated its own controversy as Endo’s leading defense firm, Arnold & Porter, faced repeated allegations that it wasn’t fighting fair.\nOne New York state prosecutor in a civil trial accused the law firm of “concealing vast troves of smoking-gun evidence proving Endo’s grave misconduct.”\nIn California, a judge barred testimony from former Endo senior director Kitlinski after Arnold & Porter and other defense law firms did not turn over her 2009 memo.\nIn Tennessee, the legal hardball became a debacle for both Endo and Arnold & Porter. A judge there held them in contempt and found that they had engaged in “a coordinated strategy” to deprive opponents of information. The judge demanded that Arnold & Porter apologize to the court and that its attorneys take an ethics refresher class.\nArnold & Porter declined to comment, but referred reporters to previous statements. The firm said at the time it had acted in good faith and regretted that any document had been produced late. It said its lawyers had worked hard to locate and turn over all relevant documents and had even offered to pay for additional depositions to go over issues raised in any belatedly revealed material.\nEndo turned to another big law firm, Skadden Arps in New York, to deal with a declining business and potential bankruptcy. From Endo’s perspective, the lawyering here proved more successful. Skadden Arps helped develop a plan that Endo confidentially codenamed Project Zed.\nWhen companies declare bankruptcy, all the businesses and people who are owed money file proofs of claims to be paid. These creditors are divided into groups, and those with the strongest legal claims are placed in higher tiers for payment — and thus are more likely to recover funds.\nDistressed companies have gotten aggressive with rearranging debt so that some creditors may leapfrog others through a process called “uptiering.”\nEndo completed sweeping uptiering transactions in 2019 and 2020, putting liens on assets and replacing unsecured debt with secured debt. Endo said its uptiering under Project Zed gave the firm time to seek settlements for opioid lawsuits by extending debt deadlines.\nBut the uptiering also shrank the funds available to deal with Endo’s opioid liability. State attorneys general initially sought $3.3 billion from Endo for its role in the epidemic, according to bankruptcy court records. They lost bargaining power, though, as the business declined and Endo uptiered debt. Before Endo filed for bankruptcy, the state prosecutors settled for $274 million.\nIn total — including pre-bankruptcy lawsuit settlements with a few individual states and payments to private organizations and victims — Endo paid about $635 million for the ravages of the opioid crisis.\nIn their deal, the Sacklers and Purdue agreed to pay $6 billion in compensation, with most of the money going to state and local governments. Teva and Allergan, pharmaceutical companies that merged their generic opioid businesses, are to pay $6.5 billion.\nMallinckrodt, the nation’s biggest opioid pill maker, agreed to pay $1.7 billion in opioids damages in 2022 in its first bankruptcy. It filed a second bankruptcy last year and cut its payment to $700 million.\nIn the Endo bankruptcy, lawyers for opioid victims and other unsecured creditors labeled Project Zed a scheme to wall off assets, alleging it amounted to fraud. Endo denied the fraud allegations.\n“It’s all the more unfortunate,” attorneys for opioid victims and unsecured creditors said in court filings, “that the victims of Endo’s conduct in this should also be the victims of the opioid crisis from which Endo profited handsomely.”\nIn interviews, legal experts called uptiering a dangerous trend. Opioid victims are “kind of like sitting ducks,” Berkeley Law professor Kenneth Ayotte said. Opioid victims, he said, “don’t have contracts to protect themselves against these transactions.”\nAs it failed to pull out of a financial tailspin, Endo accelerated bonuses to about two dozen executives. Records show a total of $95 million was paid in less than a year.\nFour days after the last bonus round of $22 million was paid to chief executive Blaise Coleman and his three top lieutenants, Endo filed its bankruptcy petition in federal court in New York. The total Endo paid its top bosses dwarfed the controversial $7 million in pre-bankruptcy bonuses granted to a handful of Purdue executives.\nThe bonuses immediately came under fire from a federal bankruptcy watchdog, opioid victims and many creditors. The critics told U.S. Bankruptcy Court Judge James Garrity Jr. that the payouts violated a law, championed by then-Sen. Ted Kennedy, D.-Mass., nearly 20 years ago after scandals involving windfalls paid to executives of bankrupt firms, most notably Enron.\nIn interviews, professors who specialize in bankruptcy said that the bonuses appeared to be an end run around Kennedy’s reforms. “It looks like pre-petition theft,” said Gregory Germain, a widely published bankruptcy expert at the University of Syracuse.\nSkadden lawyer Lisa Laukitis defended the bonuses in a bankruptcy hearing. “These are not windfall payments that were made to line the pockets of executives on the eve of the filing,” she said.\nThe bankruptcy went on for months. Hedge funds and other investors — led by GoldenTree Asset Management, a New York firm that specializes in buying distressed debt — agreed to use their secured debt to buy Endo out of bankruptcy. In negotiations to take ownership, the group sweetened the deal by increasing the payments going to individual opioid victims and other unsecured creditors. As part of the deal, the critics dropped their complaints about Project Zed and the bonuses.\nGarrity, the judge in New York, confirmed Endo’s bankruptcy plan in March. Federal prosecutors, engaged in a parallel criminal investigation of Endo, had reached their own deal. All that remained was for Parker, the judge in the criminal court in Michigan, to approve the intertwined deals.\nWinners and Losers\nOn the afternoon of May 2 in Detroit, federal prosecutors and Endo’s defense lawyer explained to Parker how the financial penalty facing Endo had dwindled to $200 million.\nAlong with the criminal fine, a final “global resolution” signed by U.S. officials and Endo wiped out virtually all of the potential $4 billion IRS bill. The agreement also mostly erased claims of another $1.5 billion for false health care billing and Medicare costs generated by the opioid crisis.\nEndo’s attorney, Carole Rendon, a former U.S. attorney from Cleveland, blamed the misconduct at the firm on a “very small number” of rogue salespeople.\nShe told the judge the company had cleaned up its act, including firing its 375-member opioid sales staff back in 2016. The firm at one point had called them “pain solution brand ambassadors.”\nA near-defunct Endo subsidiary pleaded guilty to a misdemeanor, allowing the parent company to again sidestep a law barring convicted firms from doing business with federal health care programs. No Endo executives or employees were criminally charged in the case. Endo is still selling Percocet and other opioids that bring in 7% of its revenue.\nWith the bankruptcy case closed, law firms and financial advisers won big. Skadden Arps billed for the labor of nearly 350 lawyers and paralegals. Its total fees: $114 million.\nTwo law firms, Akin Gump and Cooley LLP, represented painkiller victims. In total, the lawyers and other advisers for victims are set to receive $48 million — more than the $40 million Endo’s individual opioid victims are to share in a court-approved trust.\nReed, the Endo opioids whistleblower, received a reward of about $1.9 million.\nStockholders got wiped out. More than 3,000 victims’ lawsuits were ended.\nAnd Endo continues to reward its veteran and new top executives, setting aside more than $80 million in a stock pool for them, board members and other “key employees.” It gave former CEO Coleman a $6.1 million parachute when he resigned in August.\nIndividual victims still need to be compensated. If the number of individual victims holds steady, arithmetic shows they might each receive about $1,000 after administrative costs from the court-approved trust. Under the $750 million Purdue plan, the largest checks, for $48,000, were to go to family members who lost someone to a fatal overdose.\nThe Rappold family has filed for compensation. They lost Nicholas Rappold, 21, a kosher deli waiter and community college student. He was found slumped in his car in 2010, dead from an overdose. Rappold received various prescriptions, including for Percocet, from Dr. Stan Li in the weeks leading up to his death, according to court records from Li’s criminal trial. Li banked thousands in cash from selling painkillers at his New York City clinic to customers who lined up around the block.\nNicholas’ mother, Margaret, faulted the way Endo and other firms marketed to Li. The doctor died in prison while serving a 10-year sentence for manslaughter in the fatal overdoses of her son and a 37-year-old former stockbroker.\n“Just to get sales, they don’t care what they sell,” said Margaret Rappold, 75, who works at a school cafeteria. “Whether it’s good for you or not good for you.”\nWhile she says money would never make up for the loss of her boy, it could defray her expenses, including her son’s $14,000 funeral.\nSo far, the Rappolds and other families have found collecting difficult. They have had to deal with paperwork filled with legalese and footnotes, a short deadline for seeking money, an application website that didn’t work — and, most significantly, rules that barred thousands of victims from getting help.\nEmily Walden, a Kentucky woman whose son, T.J. Walden, died at age 21 on a camping trip after taking Opana given him by a friend, followed the Endo saga closely until she realized that the trust will only help if victims had a doctor’s prescription for an Endo narcotic.\n“These prescriptions were not falling off trucks,” Walden said. “They marketed these drugs inappropriately and wrongly and flooded the streets. They did nothing about it because money was number one.”\nSome 90,000 individual victims initially filed opioid claims against Endo. Already, two-thirds of them have dropped out.",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "negative",
    "categories": [
        "Crime, Law and Justice",
        "Economy, Business and Finance",
        "Social Issue"
    ],
    "ai_allow": true,
    "canonical": false,
    "webz_reporter": false,
    "external_links": [],
    "external_images": [],
    "entities": {
        "persons": [],
        "organizations": [],
        "locations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": "84d77b0666db56901aec0a91901c14c71f73a809",
        "first_syndicated": true
    },
    "rating": null,
    "crawled": "2024-12-17T16:21:41.480+02:00",
    "updated": "2024-12-17T16:21:41.480+02:00"
}