{
    "thread": {
        "uuid": "5be9502278115ee27a9d14dbd20265893fc95331",
        "url": "https://logistics.maritimeprofessional.com/north-america/2024/12/17/eu-opens-examination-into-tiktok-over-election-interference",
        "site_full": "logistics.maritimeprofessional.com",
        "site": "maritimeprofessional.com",
        "site_section": "https://logistics.maritimeprofessional.com/europe",
        "site_categories": [],
        "section_title": "Europe - Logistics News",
        "title": "EU opens examination into TikTok over election interference",
        "title_full": "EU opens examination into TikTok over election interference",
        "published": "2024-12-17T15:02:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "main_image": "",
        "performance_score": 0,
        "domain_rank": 183436,
        "domain_rank_updated": "2024-12-16T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "5be9502278115ee27a9d14dbd20265893fc95331",
    "url": "https://logistics.maritimeprofessional.com/north-america/2024/12/17/eu-opens-examination-into-tiktok-over-election-interference",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "Logistics News",
    "published": "2024-12-17T15:02:00.000+02:00",
    "title": "EU opens examination into TikTok over election interference",
    "text": "Latest News\n-\nRussian Urals oil above $60 rate cap on firmer differentials, softer freight rates, sources say\nRates for flagship Russian Urals oil cargoes loading in January and early February for shipment to India held a little above the $60 per barrel Western cost cap, traders said and Reuters estimations showed. Softer shipping expenses on the primary export routes to Asia and steady rates in Indian ports offered assistance to Urals free-on-board (FOB) estimates, according to market sources. Under the cost cap, providers of Russian oil are just able to use Western services such as shipping and insurance if Russian crude trades listed below $60 per barrel. Urals oil freights filling at Primorsk on the Baltic Sea were seen at $60.3 per barrel since Tuesday, and at $60.1 per barrel from Novorossiisk on the Black Sea, according to Reuters computations. Company Brent crude prices, at $73.18 a barrel at 1313 GMT, likewise assisted keep Urals above $60 per barrel, traders stated. Discounts in Indian ports, the main location for seaborne Urals, narrowed to $3.50 per barrel and listed below on a provided at port (DAP) basis, from a $3.60-3.80 range to outdated Brent for December-loading cargoes, traders stated. Rates have firmed due to lower expected supply from Russia in January and February amid elevated domestic refinery throughput and as OPEC+ requirements restrict output, the traders stated. Urals costs have been steady to firmer in India in current months in spite of a considerable decrease in the official selling costs of big oil suppliers such as Saudi Arabia and the United Arab Emirates (UAE). The Russian grade stays attractive to Indian refiners as it still trades at a substantial discount rate to all alternatives. Freight costs were stable to lower, at around $5 million for a one-way trip from Russia's Baltic ports to India. Sanctions versus Russia's 'shadow fleet', used for transferring the lion's share of the country's oil, have up until now had just a restricted result on freight costs, the traders said, although they included that a 15th plan of EU sanctions that includes 52 vessels may alter the photo. India did not sign up with Western sanctions against Russia, however follows policies consisting of the rate cap. The price for each Urals freight is agreed between a seller and a purchaser and various cost formulas may be used. Reuters estimates of FOB Urals crude rates are based upon the discount rates to Brent at Indian ports on a delivered-ex-ship basis, transportation, other associated costs and the Brent standard.\n-\nAir Canada eyes strong revenue development by 2028, banks on robust leisure travel demand\nAir Canada said on Tuesday it was targeting a 36% dive in its 2028 operating profits from the present year, riding a wave of strong demand for leisure travel throughout domestic and worldwide paths. Airlines worldwide are optimistic about the future of air travel, driven by a post-pandemic surge as tourists shift their top priorities from goods to experiences. Air Canada likewise anticipated its 2025 adjusted revenues before interest, taxes, devaluation, and amortization (EBITDA) in the range of C$ 3.4 billion ($ 2.38 billion) to C$ 3.8 billion, compared with experts' price quotes of C$ 3.63 billion according to data compiled by LSEG. Our method, which develops on and leverages the unique strengths established over the last years, is to increase even higher with consistent margin growth and structural cash generation while maintaining a strong balance sheet and a responsible danger profile, CEO Michael Rousseau stated. It also plans to broaden its network. Earlier this year, the Montreal-based provider revealed plans to increase flights to China and to add capability to other Asia-Pacific paths. The Canadian flag provider is targeting an operating revenue of about C$ 30 billion in 2028, with an adjusted core earnings margin of 17% or greater. It expects to report an operating profits of roughly C$ 22 billion this year with a core revenue margin of about 16%. We believe we are very well positioned to execute our long-term plans, Rousseau included. The airline is anticipated to provide more details into its future strategies at its investor day arranged for Tuesday.\n-\nUkraine's Zelenskiy tells allies Russia's shadow fleet should be stopped\nUkrainian President Volodymyr Zelenskiy appealed to allies on Tuesday to ensure the socalled shadow fleet of vessels used by Russia to circumvent sanctions no longer operated in the European waters. Zelenskiy published on X that the fleet should be restricted not. simply with sanctions, but in other methods too. This fleet is among the greatest risks. Putin uses these. tankers to fund his war, and the majority of these vessels are old,. improperly maintained, and run without any oversight, the. Ukrainian leader stated. On Monday, the European Union embraced sanctions targeting 52. more vessels from Moscow's shadow fleet that try to prevent. Western limitations to move oil, arms and grains. It brings the. total noted to 79. Britain on Tuesday also approved 20 ships that it said. were utilizing illegal practices to prevent sanctions on Russian oil. Zelenskiy called Sunday's oil spillage triggered by a sinking. Russian tanker in the Kerch Straight near the Crimean Peninsula,. an ecological catastrophe. One tanker split apart throughout a storm, while another ended. up in distress. Together they had 9,200 metric lots of oil. items aboard, Russian state news company TASS stated. Ukraine's navy representative said Russia violated navigation. safety by utilizing old tankers and keeping 2 vessels at sea. throughout a heavy storm. There are much bigger and more dangerous Russian tankers. operating in your seas. This fleet needs to be stopped. Doing so. will not only cut off Russia's war financing but will likewise secure. nature, Zelenskiy added.\n-\nHow Germany's parties say they will restore its anaemic economy\nGerman political celebrations presented their election programmes on Tuesday, a day after parliament backed a noconfidence movement in Chancellor Olaf Scholz's federal government, leading the way for a snap election on Feb. 23. Arguments over how to conserve Europe's largest economy had been the primary aspect behind the collapse of Scholz's fractious three-party union last month, and the economy is the top issue of German citizens. Germany has actually gone from being Europe's economic powerhouse to underperforming its significant euro zone peers. The economy is anticipated to agreement in 2024 for the 2nd successive year. Here is what is understood so far about the celebrations' essential financial proposals and their position on a possible reform of the constitutionally enshrined debt brake: SPD Scholz's centre-left Social Democrats (SPD) propose incentivising personal financial investment and modernising infrastructure with an off-budget 100 billion euro ($ 104.90 billion) fund. The celebration also prepares to present a Made in Germany premium to boost investment. The strategy consists of a direct tax refund of 10% on equipment financial investments by companies. To incentivise purchases of German-made electrical automobiles, the SPD proposes to use buyers a short-lived tax deduction. Scholz calls for a moderate reform of the debt brake - which limits federal government borrowing to 0.35% of gross domestic product - in order to increase financial investments in defence, however he has not showed how he would do that. CDU/CSU The opposition conservatives, an alliance of the Christian Democrats (CDU) and their Bavarian sister celebration the Christian Social Union (CSU), propose extensive financial relief for business and residents. They wish to cut the corporate tax and propose a uniform rate of 25%. The sales tax for catering need to be reduced to 7%. from 19%. They also want to abolish the national supply chain. law, and promise lower electrical energy charges. They have not said. how they plan to finance the projects, a point criticised by. other parties. Conservative leader Friedrich Merz, who according to viewpoint. surveys is set to end up being Germany's next chancellor, has actually signified. some openness to a moderate reform of the financial obligation brake however his. celebration's manifesto has actually promised to keep it. GREENS Economy Minister Robert Habeck, the Greens' candidate for. chancellor, has actually required reform of the financial obligation brake to permit. greater public costs. The Greens wish to purchase capital markets to create. more funds for the statutory pension scheme, producing what they. call a people' fund with loans and government resources. The. fund should take sustainability requirements into account and be. lined up with the 1.5 degree Celsius target of the Paris Climate. Arrangement. Every investment in Germany ought to be subsidised by the. state with a premium of 10%, limited to 5 years and not. including financial investment in buildings, they say. The election program likewise includes a tax incentive for. small and medium earnings for the purchase of electric vehicles, an. example of their concentrate on targeting subsidy programmes towards. lower earners. The program also consists of raising the base pay to 15. euros per hour in 2025. It is presently 12.41 euros. FDP The neoliberal Free Democrats provide themselves as the. most significant protector of the financial obligation brake. It was the rejection of former. Financing Minister Christian Lindner, the FDP leader, to suspend. the cap on loaning that triggered the collapse of Scholz's. coalition. In its draft election programme, the party proposes a. decrease of the business tax to below 25% and of the sales tax. for dealing with 7%. It likewise proposes an immediate end to the. so-called solidarity additional charge, which is paid on top of earnings. tax and was presented following German reunification to help. the poorer eastern states. The FDP is positioning itself versus the federal government's. existing objective of making Germany climate-neutral by 2045, saying. instead that the EU target of 2050 must be utilized as a guide. The ban on combustion engines for new vehicles signed up. from 2035 onwards must be lifted, and the air traffic tax. eliminated. The draft program also turns down a wealth tax and any. debt proficiency for the European Union. AfD The far-right Option for Germany (AfD), presently in. second place after the conservatives according to viewpoint polls,. looks for Germany's departure from the EU - or Dexit - following a. referendum like the one that occurred in the U.K. in 2016. The. celebration wants the country to ditch the euro and reintroduce the. Deutsche Mark. AfD is committed to the financial obligation brake and proposes. cutting spending on climate defense and contributions to. worldwide institutions. The other celebrations have actually declined to include the. anti-immigration AfD in any future union federal government talks. The AfD has currently provided a draft of its own election. programme.\n-\nEU Parliament offers final approval to deforestation law\nThe European Parliament gave its last approval on Tuesday to a oneyear hold-up of Europe's landmark logging law, which from Dec. 2025 will prohibit the import of beef, soy and other items connected to the destruction of forests. The lawmakers' approval paves the way for European Union countries to also approve the hold-up, which they are anticipated to do this week - as a rule, with no modifications. After that, the postponement will pass into law. WHY IT is necessary The delay to the world-first policy to resolve logging is a blow to the EU's green agenda, which is facing pushback amongst markets from car manufacturers, to airline companies, who say EU measures to eliminate climate modification are too burdensome. However the hold-up provides relief to the companies and countries that had opposed the policy. Brazil and Indonesia had actually branded the law protectionist and said it could omit countless bad, small farmers from the EU market. The EU law, which was initially due to work from Dec. 30, 2024, will need companies and traders putting soy, beef, coffee, palm oil and other items onto the EU market to offer proof their supply chain does not contribute to deforestation. EU farmers would also be prohibited from exporting items cultivated on deforested or broken down woodlands. CONTEXT EU legislators had tried to likewise damage parts of the policy, however those propositions were shelved in negotiations with EU nations. The 2 sides struck a deal previously this month to merely postpone the law by 12 months. BY THE NUMBERS At least 120 million metric tons of CO2 emissions were triggered by deforestation connected with EU commodity imports in 2021-2022, according to campaign group International Witness.\n-\nUK sanctions 20 'shadow fleet' ships bring Russian oil\nBritain on Tuesday sanctioned 20 ships that it said were using illicit practices to prevent sanctions on Russian oil, its most current measures targeting Russia's. socalled shadow fleet of vessels. As (Russian President Vladimir) Putin's oil profits. continue to fuel the fires of his illegal war, Ukrainian. families are enduring cold, dark nights, often without heating,. light or electrical energy, targeted by Russia's unrelenting rocket. attacks, British Prime Minister Keir Starmer stated. These sanctions will include further pressure to Putin's. stalling war economy. The ships approved include Ocean Faye, Andaman Skies and. Mianzimu, which have each carried more than 4 million barrels of. Russian oil this year, Britain's federal government stated. The procedures restrict or forbid their motion and. access to some British ports. On Monday Britain and 11 other Western nations agreed procedures to interrupt and prevent Russia's shadow fleet. Starmer likewise revealed 35 million pounds ($ 44 million). of emergency situation assistance to help Ukraine repair its energy grid.\n-\nBy the end of December, ships trapped in Germany's Mosel River were freed.\nNavigation authorities announced on Tuesday that the inland waterways freight vessels stuck on the Mosel could be able to leave by the end December, as the temporary lock was working faster than expected. Last week, the river, which is an important route for transit between Germany and France was closed to inland shipping. 74 river freighters, mostly with cargos such as grains and rapeseed, were trapped after an accident damaged a Mueden lock south of Koblenz. A WSA spokesperson stated that lock repairs will likely last until spring 2025, but a temporary locking system allowed seven vessels trapped in the Mosel to leave within the first 24 hour after the work began on Monday. Seven to eight boats a day are expected to be able leave. At first, it was thought that the emergency lock could only be used by four to six vessels per day. The spokesperson stated that \"the temporary lock works better than we expected, and we hope to free all trapped vessels by the end December.\" The river is a vital link for shipments of grain and rapeseed to and from Germany, France and Belgium. The price of European rapeseed contracts rose last week, after Euronext announced that it would suspend physical deliveries to river ports in east France for the contract for February due to the Mosel blockage. (Reporting and editing by Angus MacSwan, Angus MacSwan).\n-\nSlovakia's SPP, partners sign declaration calling for continued Ukraine gas transit\nSlovakia's main gas purchaser SPP stated on Tuesday it and other groups from Hungary, Austria and Italy had signed a statement in support of ongoing natural gas transit through Ukraine. The declaration that we have actually prepared in SPP is meant to support the continuation of gas transit through the territory of Ukraine and the conservation of its gas infrastructure, since it is the most useful service not only for gas consumers in Europe, however likewise for Ukraine itself, SPP president Vojtech Ferencz stated in a declaration. Slovakia and other nations getting gas from Russia by means of pipelines in Ukraine are in speak to attempt to prevent those circulations stopping when an existing transit agreement between Kyiv and Moscow ends at the end of the year. Ukrainian Prime Minister Denys Shmyhal said on Monday that Ukraine wanted to come up with an offer enabling gas to transit through its area, but he ruled out any extension of an existing deal with Russia. Slovak Economy Minister Denisa Sakova has said European countries and business have a combined need of around 15 billion cubic metres of Russian gas next year by means of Ukraine. SPP said its statement was signed by Slovak pipeline operator Eustream, Hungarian groups MVM and MOL, along with industry associations from Italy, Austria and Hungary. SPP's Ferenc stated the groups would provide their statement to European Commission President Ursula von der Leyen. In SPP's case, Ferenc said the loss of supplies from the east would cost it an additional 150 million euros ($ 157.28. million) due to greater transit charges. The cost for the whole. Slovak market would reach 220 million euros.\nEU opens examination into TikTok over election interference\nThe European Commission opened official procedures on Tuesday against social media firm TikTok over its suspected failure to limit election disturbance, significantly in the Romanian presidential vote last month.\nThe Commission said it will request information and appearance into TikTok's policy on political ads and paid-for political material as well as TikTok's systems to generate recommendations and the risks of them being manipulated.\nThe opening of official procedures empowers the Commission to take more enforcement actions and to accept commitments made by TikTok. There is no specific due date to complete proceedings.\nChina's Bytedance-owned TikTok stated it had secured the stability of its platform through more than 150 elections worldwide and had actually supplied the European Commission with comprehensive info on its efforts.\nIt added it did decline paid political advertisements and proactively removed content breaking its policies on false information and hate speech.\nThe Commission bought TikTok on Dec. 5 to freeze data connected to the Romanian elections under the bloc's sweeping Digital Provider Act (DSA), which regulates how the world's. greatest social media business operate in Europe.\nRomania's leading court subsquently annulled the governmental. election after accusations of Russian meddling and the victory. of pro-Russia ultranationalist Calin Georgescu in the first. round.\nThe Commission is conscious of the threat of disturbance. in the German parliamentary election in February and the. presidential election in Croatia beginning on Dec. 29.\nCommission President Ursula von der Leyen stated the brand-new. examination followed major indications that foreign stars. interfered in the Romanian presidential election.\nWe should safeguard our democracies from any kind of. foreign interference. Whenever we believe such disturbance,. specifically throughout elections, we have to act quickly and securely,. she said in a statement.\nThis is the 3rd examination the Commission has actually introduced. against TikTok under the DSA, both related to dangers for minors. One has actually been closed after TikTok devoted to eliminate TikTok Lite. Rewards from the EU.\n(source: Reuters)",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "negative",
    "categories": [
        "Politics",
        "Economy, Business and Finance"
    ],
    "ai_allow": true,
    "canonical": false,
    "webz_reporter": false,
    "external_links": [],
    "external_images": [],
    "entities": {
        "persons": [],
        "organizations": [
            {
                "name": "Reuters",
                "sentiment": "none"
            }
        ],
        "locations": [
            {
                "name": "Novorossiisk",
                "sentiment": "none"
            },
            {
                "name": "Baltic Sea",
                "sentiment": "none"
            },
            {
                "name": "Black Sea",
                "sentiment": "none"
            }
        ]
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": null,
        "first_syndicated": false
    },
    "rating": null,
    "crawled": "2024-12-17T16:22:11.103+02:00",
    "updated": "2024-12-17T16:22:11.103+02:00"
}