{
    "thread": {
        "uuid": "f31741068cdbbea4a64033348df26173f15551cb",
        "url": "https://taxguru.in/income-tax/loss-fixed-deposit-investments-capital-loss-telangana-hc.html",
        "site_full": "taxguru.in",
        "site": "taxguru.in",
        "site_section": "http://kanoisandeep.blogspot.com/feeds/posts/default",
        "site_categories": [
            "tax_planning",
            "finance"
        ],
        "section_title": "TaxGuru.in - Daily Newsletter",
        "title": "Loss on fixed deposit investments is capital loss: Telangana HC",
        "title_full": "Loss on fixed deposit investments is capital loss: Telangana HC",
        "published": "2024-12-17T08:10:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "IN",
        "main_image": "https://taxguru.in/wp-content/uploads/2021/09/Telangana-high-court-view-depiction-of-pollution-which-shows-how-bad-the-visibility-is-to-far-objects.jpg",
        "performance_score": 0,
        "domain_rank": 33839,
        "domain_rank_updated": "2024-12-16T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "f31741068cdbbea4a64033348df26173f15551cb",
    "url": "https://taxguru.in/income-tax/loss-fixed-deposit-investments-capital-loss-telangana-hc.html",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "CAPOONAM",
    "published": "2024-12-17T08:10:00.000+02:00",
    "title": "Loss on fixed deposit investments is capital loss: Telangana HC",
    "text": "Loss on fixed deposit investments is capital loss: Telangana HC\nCase Law Details\nAll High Courts\nTelangana High Court\nBecome a Premium member to Download.If you are already a Premium member,\nLoginhere to access.\nM.Vinayak Vs DCIT (Telangana High Court)\nTelangana High Court held that loss suffered on deposits in nature of fixed deposit investments is capital loss. The same cannot be treated as bad debt or trading loss. Accordingly, appeal dismissed.\nFacts- The present appeal has been preferred by the assessee. The substantial question of law involved therein is whether the loss of Rs.26,15,569/-sustained by the appellant on account of moneys deposited in Krishi Bank being lost due to liquidation of the Bank is allowable as a deduction as the same is a trading loss or business loss under Section 28 of the Income Tax Act, 1961 or in the alternative bad debt under Section 36(i)(vii) of the Income Tax Act, 1961.\nConclusion- Held that the deposits made by the assessee were in the nature of fixed deposit investments. Therefore, the loss suffered by the assessee when the bank went to liquidation is only a capital loss. Hence, the claim of the assessee cannot be treated as bad debt or trading loss. Thus, the substantial question of law is answered against the assessee in favour of revenue.\nFULL TEXT OF THE JUDGMENT/ORDER OF TELANGANA HIGH COURT\nMr. Duvva Pavan Kumar, learned counsel represents Mr. Y. Ratnakar, learned counsel for the appellant.\nMr. J.V. Prasad, learned Senior Standing Counsel for Income Tax Department for the respondent.\n2. This appeal under Section 260A of the Income Tax Act, 1961 (hereinafter referred to as “the Act”) has been filed by the assessee. The subject matter of the appeal pertains to assessment year 2002-2003. The appeal was admitted on the following substantial question of law:\n“Whether the loss of Rs.26,15,569/-sustained by the appellant on account of moneys deposited in Krishi Bank being lost due to liquidation of the Bank is allowable as a deduction as the same is a trading loss or business loss under Section 28 of the Income Tax Act, 1961 or in the alternative bad debt under Section 36(i)(vii) of the Income Tax Act, 1961?”\n3. The factual background in which the aforesaid substantial question of law arises for our consideration need mention.\n4. The assessee is engaged in the business of sale of electrical goods, money lending and dealing in shares and mutual funds. The assessee has filed his returns of income on 08.10.2002 for the assessment year 2002-2003 declaring loss of Rs.24,74,584/- on account of the fact that fixed deposits with Krishi Bank having been lost on account of liquidation of the said Bank. The assessee claimed the aforesaid amount of Rs.24,74,584/- as deduction on the ground that the same is a trading loss or bad debt under Sections 27 and 28 of the Act.\n5. The assessment under Section 143(3) of the Act was completed by the Assessing Officer on 31.12.2004 and aforesaid loss was disallowed on the ground that the said amount constitutes a capital loss. Being aggrieved, the assessee filed an appeal before the Commissioner of Income Tax (Appeals). The appeal was dismissed by an order dated 30.09.2005. Thereupon, the assessee filed an appeal before the Income Tax Appellate Tribunal (hereinafter referred to as “the Tribunal”).\n6. The Tribunal by an order dated 21.09.2006 inter alia held that the amount of Rs.24,74,584/- cannot be claimed as bad debt or trading loss and upheld the order of the Commissioner of Income Tax (Appeals) and dismissed the appeal. In the aforesaid factual background, the assessee has approached this Court by filing this appeal.\n7. Learned counsel for the assessee submitted that the assessee is engaged in the business of dealing in shares as well as mutual funds and money lending. Therefore, the loss, which was sustained by the assessee, is incidental to carrying on his business and should be deducted in computing the profits. Reliance has been placed in cases where the amount was lost in the course of business on account of misappropriation and it has been contended that in similar analogy the loss sustained by the assessee deserves to be treated as trading loss.\n8. In support of the aforesaid submissions, reliance has been placed on the decisions of the Supreme Court in Badridas Daga vs. Commissioner of Income Tax1, Commissioner of Income-Tax, U.P. vs. Nainital Bank Ltd.2, Ramchandar Shivnarayan vs. Commissioner of Income-Tax, A.P.3, Chhotulal Ajitsingh vs. Commissioner of Income-Tax, Rajasthan4 and Commissioner of Income-Tax, Poona vs. P.V. Gore & Co.5.\n9. Learned counsel for the Revenue submitted that the loss of the assessee cannot be termed as the loss in the course of the business. It is further submitted that the deposits made by the assessee were in the nature of fixed deposit investments, the assessing officer has rightly treated the same as capital loss and added back the same to total income. It is also argued that the findings of fact recorded by the Assessing Officer, Commissioner of Income Tax (Appeals) as well as the Tribunal do not suffer from any infirmity warranting interference of this Court in this appeal under Section 260A of the Act.\n10. We have considered the submissions made on both sides and have perused the record. Before proceeding further it is apposite to take note of the relevant statutory provisions which are reproduced below for the facility of reference:\n“Section 36(1)(vii): Subject to the provisions of sub-section (2), the amount of [any bad debt or part thereof which is written off as irrecoverable in the accounts of the assessee for the previous year] :\n[Provided that in the case of] [an assessee] [to which clause (viia) applies, the amount of the deduction relating to any such debt or part thereof shall be limited to the amount by which such debt or part thereof exceeds the credit balance in the provision for bad and doubtful debts account made under that clause.]\n[Provided further that where the amount of such debt or part thereof has been taken into account in computing the income of the assessee of the previous year in which the amount of such debt or part thereof becomes irrecoverable or of an earlier previous year on the basis of income computation and disclosure standards notified under subsection (2) of section 145 without recording the same in the accounts, then, such debt or part thereof shall be allowed in the previous year in which such debt or part thereof becomes irrecoverable and it shall be deemed that such debt or part thereof has been written off as irrecoverable in the accounts for the purposes of this clause.]\n[Explanation 1.]— For the purposes of this clause, any bad debt or part thereof written off as irrecoverable in the accounts of the assessee shall not include any provision for bad and doubtful debts made in the accounts of the assessee.]\n[Explanation 2.— For the removal of doubts, it is hereby clarified that for the purposes of the proviso to clause (vii) of this sub-section and clause (v) of sub-section (2), the account referred to therein shall be only one account in respect of provision for bad and doubtful debts under clause (viia) and such account shall relate to all types of advances, including advances made by rural branches];\nSection 28 : Profits and gains of business or profession:\n– The following income shall be chargeable to income-tax under the head “Profits and gains of business of profession”,\n-(i)the profits and gains of any business or profession which was carried on by the assessee at any time during the previous year;\n(ii)any compensation or other payment due to or received by,-(a) any person, by whatever name called, managing the whole or substantially the whole of the affairs of an Indian company, at or in connection with the termination of his management or the modification of the terms and conditions relating thereto;\n(b)any person by whatever name called, managing the whole or substantially the whole of the affairs in India of any other company, at or in connection with the termination of his office or the modification of the terms and conditions relating thereto;\n(c)any person, by whatever name called, holding an agency in India for any part of the activities relating to the business of any other person, at or in connection with the termination of the agency or the modification of the terms and conditions relating thereto;\n(d) any person, for or in connection with the vesting in the Government, or in any corporation owned or controlled by the Government, under any law for the time being in force, of the management of any property or business;]\n(e) any person, by whatever name called, at or in connection with the termination or the modification of the terms and conditions, of any contract relating to his business;]\n(iii) income derived by a trade, professional or similar association from specific services performed for its members;\n(iiia) [profits on sale of a licence granted under the Imports (Control) Order, 1955, made under the Imports and Exports (Control) Act, 1947 (18 of 1947);]\n(iiib) [cash assistance (by whatever name called) received or receivable by any person against exports under any scheme of the Government of India;]\n(iiic) [any duty of customs or excise re-paid or re-payable as drawback to any person against exports under the Customs and Central Excise Duties Drawback Rules, 1971;]\n(iiid) [any profit on the transfer of the Duty Entitlement Pass Book Scheme, being the Duty Remission Scheme under the export and import policy formulated and announced under section 5 of the Foreign Trade (Development and Regulation) Act, 1992 (22 of 1992);]\n(iiie) [any profit on the transfer of the Duty Free Replenishment Certificate, being the Duty Remission Scheme under the export and import policy formulated and announced under section 5 of the Foreign Trade (Development and Regulation) Act, 1992 (22 of 1992);]\n(iv) the value of any benefit or perquisite, whether convertible into money or not, arising from business or the exercise of a profession;]\n(v)any interest, salary, bonus, commission or remuneration, by whatever name called, due to, or received by, a partner of a firm from such firm: Section 11 (w.e.f. 1.4.1993).]Provided that where any interest, salary, bonus, commission or remuneration, by whatever name called, or any part thereof has not been allowed to be deducted under clause (b) of section 40, the income under this clause shall be adjusted to the extent of the amount not so allowed to be deducted;]\n(va) [any sum, whether received or receivable, in cash or kind, under an agreement for- (a)not carrying out any activity in relation to any business; or(b)not sharing any know-how, patent, copyright, trade-mark, licence, franchise or any other business or commercial right of similar nature or information or technique likely to assist in the manufacture or processing of goods or provision for services:\nProvided that sub-clause (a) shall not apply to-\n(i) any sum, whether received or receivable, in cash or kind, on account of transfer of the right to manufacture, produce or process any article or thing or right to carry on any business, which is chargeable under the head “Capital gains”;\n(ii) any sum received as compensation, from the multilateral fund of the Montreal Protocol on Substances that Delete the Ozone Layer under the United Nations Environment Programme, in accordance with the terms of agreement entered into with the Government of India.\nExplanation. – For the purposes of this clause,-(i)”agreement” includes any arrangement or understanding or action in concert,-\n(A) whether or not such arrangement, understanding or action is formal or in writing; or\n(B) whether or not such arrangement, understanding or action is intended to be enforceable by legal proceedings; (ii) “service” means service of any description which is made available to potential users and includes the provision of services in connection with business of any industrial or commercial nature such as accounting, banking, communication, conveying of news or information, advertising, entertainment, amusement, education, financing, insurance, chit funds, real estate, construction, transport, storage, processing, supply of electrical or other energy, boarding and lodging;]\n(ii) any sum received under a Keyman insurance policy including the sum allocated by way of bonus on such policy.\n]Explanation. – For the purposes of this clause, the expression “Keyman insurance policy” shall have the meaning assigned to it in clause (10-D) of section 10;]\n[(vi-a) the fair market value of inventory as on the date on which it is converted into, or treated as, a capital asset determined in the prescribed manner;]\n(vi) any sum, whether received or receivable, in cash or kind, on account of any capital asset (other than land or goodwill or financial instrument) being demolished, destroyed, discarded or transferred, if the whole of the expenditure on such capital asset has been allowed as a deduction under section 35-AD;]\n[Explanation 1 omitted by Act 4 of 1987, Section 28 (w.e.f. 1.4.1989).]\nExplanation 2. – Where speculative transactions carried on by an assessee are of such a nature as to constitute a business, the business (hereinafter referred to as “speculation business”) shall be deemed to be distinct and separate from any other business.\nFollowing Explanation 3 shall be inserted after Explanation 2 to Section 28 by the Finance (No.2) Act, 2024, w.e.f. 1-42025:\nExplanation 3.- It is hereby clarified that any income from letting out of a residential house or a part of the house by the owner shall not be chargeable under the head “Profits ad gains of business and profession” and shall be chargeable under the head “Income from house property”.\n11. After having noticed the relevant statutory provisions, we may advert to the facts of the case in hand. The assessee has engaged in the business of sale of electrical goods, money lending, dealing in shares and mutual funds and he deposited an amount of Rs.24,74,580/- with Krishi Co-operative Bank and the said bank went into liquidation. The assessee claimed the above said amount as deduction on the ground that the same is trading loss or bad debt. The assessing officer after going through the statements and records passed order on 31.12.2004, holding that the deposits made by the assessee were in the nature of fixed deposit investments out of available profits/capital of the assessee and the same was treated as capital loss and denied the claim of the assessee as a trading loss. The above said order was confirmed by the Commissioner of Income Tax (Appeals) by its order dated 30.09.2005 and the said order was further confirmed by the Income Tax Appellate Tribunal (Hyderabad) by its order dated 21.09.2006.\n12. In Badridas Daga’s case (supra) the Hon’ble Apex Court held that the main principle in this case revolves around whether an embezzlement loss caused by an employee’s misconduct is deductible as a business expense under Section 10 of the Income Tax Act. Specifically, it questions whether such a loss, incidental to the conduct of the business, can be considered a “trading loss” and thus deductible, as it arose from the risks inherent in business operations. The primary issue is whether the loss resulting from the employee Chandratan’s misappropriation of Rs.2,02,442 could be claimed as a deductible business expense by the appellant, considering the loss stemmed from the employee’s unauthorized withdrawal of business funds. The case hinges on determining if such a loss is incidental to and inseparable from business operations, thereby qualifying as a trading loss deductible under Section 10(1) of the Income Tax Act.\n13. In Commissioner of Income-Tax, U.P.’s case (supra), the Hon’ble Apex Court held that under Section 10(1) of the Income Tax Act, a trading loss is deductible if it is incidental to the business operations. The loss must be closely connected to the nature of the business and the risks inherent in carrying it out. In the case of a bank, the retention of money on its premises inherently carries risks such as theft, embezzlement, or dacoity, which are considered part of the normal business operations. The Court emphasized that the frequency or degree of the risk is less important than its direct relationship to the business, and the loss due to dacoity in this case was deemed a deductible trading loss as it was incidental to banking operations.\n14. In Ramchandar Shivnarayan’s case (supra), the Hon’ble Apex Court held that a loss arising from theft can be considered a trading loss and deductible when it is directly connected to an incidental to the business operations of the assessee. In this case, the loss of Rs. 30,000 was a result of money brought for the purpose of purchasing Government securities, which is an integral part of the assessee’s business activities. The court emphasized that the loss, although not explicitly covered in the tax laws, was part of the ordinary course of business and, therefore, should be treated as a trading loss. This principle was reinforced by previous rulings such as Badridas Daga (supra) and Nainital Bank Ltd. (supra), where it was established that any loss that is inherently linked to the business operations and is necessary for conducting those operations is deductible, even if it is caused by unforeseen events like theft. The judgment rejected narrow interpretations that failed to recognize the loss as incidental to business operations, affirming that such losses should be accounted for in calculating the true taxable profits.\n15. In Chhotulal Ajitsingh’s case (supra), the Rajasthan High Court held that loss due to theft is deductible under Section 10(1) of the Income Tax Act if it arises directly from the business and is incidental to the business operations. The timing of the theft, such as whether it occurs during business hours or after, is not crucial that matters pertains in connection between the loss and the business activity and the main principle is whether the loss caused by theft of cash from the business premises, after the business had closed for the day, could be considered a deductible business expense. The Income Tax authorities initially denied the deduction, arguing that the theft occurred outside of business hours, but the case ultimately turned on whether the loss was incidental to the business operations.\n16. In Commissioner of Income-Tax, Poona’s case (supra), the Bombay High Court held that a loss incurred by a business due to an incident, such as the theft of cash, is deductible if there is a direct and proximate connection between the loss and the business operations. The court followed the principle in Ramchandar Shivnarayan (supra), emphasizing that when a loss is incidental to the business and arises from acts necessary for carrying on the business, it is considered a trading loss and should be allowed as a deduction in computing the business profits. In this case, the loss of cash, which was being carried for safe custody after business hours, was deemed to be incidental to the firm’s business.\n17. The principles laid down in the above said judgments are not applicable to the present facts and circumstances of the case on the ground that the deposits made by the assessee were in the nature of fixed deposit investments. Therefore, the loss suffered by the assessee when the bank went to liquidation is only a capital loss. Hence, the claim of the assessee cannot be treated as bad debt or trading loss.\n18. It is pertinent to mention that the Assessing Officer after going through the evidence has specifically gave a finding that the loss suffered by the assessee is only capital loss and the same was confirmed by the appellate authority as well as tribunal. The said finding of the fact cannot be adjudicated in the appeal, while exercising the powers conferred under Section 260A of the Act, as the scope of the appeal is very limited.\n19. In view of the preceding analysis, the substantial question of law is answered against the assessee in favour of revenue.\n20. In the result, we do not find any merit in this appeal. Accordingly, the same fails and is hereby dismissed.\nMiscellaneous applications, if any pending, shall stand closed. There shall be no order as to costs.\nNotes:\n1 (1958) 34 ITR 10 (SC)\n2 (1965) 55 ITR 707 (SC)\n3 (1978) 111 ITR 263 (SC)\n4 (1973) 89 ITR 178 (Raj)\n5 (1983) 143 ITR 922 (Bom)\nPrivacy Policy&\nComplete Terms of Use and Disclaimer.\nJoin Taxguru’s Network for Latest updates on Income Tax, GST, Company Law, Corporate Laws and other related subjects.\n[Cancel reply](/income-tax/loss-fixed-deposit-investments-capital-loss-telangana-hc.html#respond)",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "negative",
    "categories": [
        "Economy, Business and Finance",
        "Social Issue",
        "Politics"
    ],
    "ai_allow": true,
    "canonical": false,
    "webz_reporter": false,
    "external_links": [],
    "external_images": [],
    "entities": {
        "persons": [],
        "organizations": [
            {
                "name": "Telangana High Court",
                "sentiment": "none"
            },
            {
                "name": "Bank",
                "sentiment": "none"
            }
        ],
        "locations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": null,
        "first_syndicated": false
    },
    "rating": null,
    "crawled": "2024-12-17T15:14:38.158+02:00",
    "updated": "2024-12-17T15:14:38.158+02:00"
}