{
    "thread": {
        "uuid": "d74998c85116662c4a7b08efc79701c57d3f1ed1",
        "url": "https://hsph.harvard.edu/news/private-equitys-appetite-for-hospitals-may-put-patients-at-risk",
        "site_full": "hsph.harvard.edu",
        "site": "harvard.edu",
        "site_section": "https://hsph.harvard.edu/feed",
        "site_categories": [],
        "section_title": "Harvard T.H. Chan School of Public Health",
        "title": "Private equity’s appetite for hospitals may put patients at risk",
        "title_full": "Private equity’s appetite for hospitals may put patients at risk",
        "published": "2024-12-17T02:25:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "main_image": "https://hsph.harvard.edu/wp-content/uploads/2024/12/HSPH_HCM_For-Profit_Hospitals_f.jpg",
        "performance_score": 0,
        "domain_rank": 101,
        "domain_rank_updated": "2024-12-16T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "d74998c85116662c4a7b08efc79701c57d3f1ed1",
    "url": "https://hsph.harvard.edu/news/private-equitys-appetite-for-hospitals-may-put-patients-at-risk",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "Maya Brownstein",
    "published": "2024-12-17T02:25:00.000+02:00",
    "title": "Private equity’s appetite for hospitals may put patients at risk",
    "text": "Private equity’s appetite for hospitals may put patients at risk\nIn the wake of the Steward Health Care crisis, corporate and private equity ownership of health care has come under new scrutiny. Here, Harvard health policy experts weigh in on the growing corporatization of the U.S. health care system and what it means for patients, practitioners, and public health.\nThroughout 2024, eye-opening news headlines from around the country trained a spotlight on the collapse of Steward Health Care:\nAs Steward hospitals teeter, CEO’s $40 million yacht is docked in the Galapagos Islands\nSick patients collapsed waiting for care in overwhelmed Steward hospital’s emergency department\nSteward Health Care files for Chapter 11 bankruptcy\nSteward owned more than 30 hospitals across Arizona, Arkansas, Florida, Louisiana, Massachusetts, Ohio, Pennsylvania, and Texas. Its volatility and eventual crash jeopardized access to health care for millions of patients.\nHow did Steward, at one point the largest private for-profit health system in the U.S., go belly up?\nThe long and short: In 2010, private equity firm Cerberus Capital Management purchased Caritas Christi Health Care, a struggling eastern Massachusetts hospital system, from the Archdiocese of Boston, converting it from non-profit to for-profit and rebranding it as Steward Health Care. In 2016, after years of continued financial instability, Steward signed a sale-leaseback agreement with Medical Properties Trust (MPT), selling the land and buildings occupied by its hospitals to the real estate investment trust then leasing them back. Steward made $1.25 billion from the agreement—enough to steady its financial footing, pay off Cerberus, and fund a growth spree. The next year, the company purchased 26 more hospitals across the country. But with the agreement came what many viewed as inflated rents.\nBy 2020, Cerberus, having made $800 million in profit on its initial investment, decided to sell Steward hospitals to a group of its physicians, essentially transferring ownership back to Steward’s management team, led by CEO Ralph de la Torre. Over the next several years, concerns about patient care and safety at Steward hospitals mounted as the company opted to cut costs and neglect bills in order to keep up with its rent payments to MPT. In January 2024, MPT announced that Steward was $50 million behind on those payments. By May, the company filed for bankruptcy. Financial documents made clear that the company had paid hundreds of millions to investors and leadership, including de la Torre, who enjoyed a lavish lifestyle while patients at Steward hospitals faced increasingly unsafe conditions. De la Torre was subpoenaed by Congress in July; he failed to appear.\nAfter months of tense negotiations between state governments, Steward, MPT, and potential buyers, by November, most Steward hospitals had found new owners, a mix of non- and for-profit hospital systems and private equity firms. But two hospitals didn’t survive: Carney Hospital, which served Boston’s low-income, majority Black and Hispanic southern neighborhoods, and Nashoba Valley Medical Center, which served 17 suburban and rural communities across central Massachusetts. Thousands of patients and hundreds of staff have been left to find health care and jobs with new providers farther away.\nThe Steward meltdown has captured the attention of the public and policymakers not as an outlier, but as an object lesson. Its story shines a light on the growing role of private equity in the U.S. health system, helps explain rising discontent among patients and clinicians, and lays bare the dangers of prioritizing profits over people in health care.\nA ‘core contradiction’\nJohn McDonough, professor of the practice of public health at Harvard Chan School, calls private equity “the sharp end of capitalism.”\n“It’s otherwise often described as ‘capitalism on steroids,’” McDonough said. “It’s for-profit business in its most aggressive form. [Private equity firms] seek returns on their investment as high as possible as quickly as possible, then rush to sell off that investment and go on to their next conquest.”\nAfter decades establishing a presence everywhere from manufacturing, to telecommunications, to grocery stores, in the mid 2000s private equity firms began targeting health care. It was a natural next step: The industry is worth nearly $5 trillion in the U.S., offering significant, dependable cash flow. Firms saw the potential for profits and began buying up physician practices and health facilities, from hospitals to nursing homes to fertility clinics, looking to at least double their initial investment and then sell within a short time, often three to seven years.\nPrivate equity’s foothold in health care has continued to grow. In 2021, according to researchers at UC Berkeley, 5,779 physician practices, specializing in everything from primary care to oncology, were owned by private equity firms—up from 816 in 2012. Nonprofit watchdog the Private Equity Stakeholder Project (PESP) reported that, as of February 2024, nearly 460 U.S. hospitals were owned by private equity firms. These hospitals—which include non-specialty acute care hospitals, rehabilitation hospitals, psychiatric facilities, and long-term acute care facilities—represent 8% of all private (not owned by the government) hospitals and 22% of for-profit hospitals.\n5,779\nphysician practices were owned by private equity in 2021—up from 816 in 2012\n22%\nof for-profit hospitals—460 in total—are currently owned by private equity\n80%\nof physicians are employed by a hospital system or corporation—up from 60% in 2019\nBut ownership by private equity is just the latest version of capitalism’s creep into health care. Its way was paved by corporations entering the industry in the 1980s as an era of free market fundamentalism emerged and the “maximizing shareholder value” movement began to boom. Publicly traded companies began buying up hospitals and health facilities, as well as physicians and physician practices, to establish their own health systems. Today, nearly a quarter of U.S. hospitals are run by for-profit entities that promise to bring business smarts and a flow of capital to health care delivery.\n“The pitch is that corporations can raise capital and invest in improving the business—quality of care, operations, professional management—in a way non-profits can’t,” said Meredith Rosenthal, C. Boyden Gray Professor of Health Economics and Policy. “But the challenge is that because health care is so important, the public expects these corporations to prioritize public interest over profits. And that’s not what they’re built to do.”\nBecause health care is so important, the public expects corporations to prioritize public interest over profits. And that’s not what they’re built to do.\nMeredith Rosenthal, C. Boyden Gray Professor of Health Economics and Policy\n“Medical care has always had a for-profit element. Physicians were mostly small businesspeople,” McDonough said. “But there’s a difference between a sole proprietor or small business and a mega-corporation that believes its only purpose in the world is return on equity to shareholders. Hold that belief up against a medical provider’s belief that patients come first, and right away there’s conflict. It’s this core contradiction that I think American society has never sufficiently grappled with.”\nNon-profits like profits, too\nIt’s not just corporate health care providers producing this dilemma. Non-profits, which remain the majority of U.S. hospitals and health care facilities, sometimes prioritize profits over their social missions—and community benefit requirement cementing their tax-exempt status—in order to grow, and even just survive, in a tight economy and increasingly competitive health care market.\n“Economists have studied whether non-profits behave differently than for-profits. Do they provide more charity care [free or discounted medical services for poor patients]? Do they invest more in community well-being? The answer generally has been no,” Rosenthal said.\nOne study, conducted in 2020 by Joseph Bruch, PhD ‘21 and David Bellamy, PhD ’23, indeed found no significant difference between what non-profit and for-profit hospitals spend on charity care as a percent of their total expenses.\n“It’s getting harder and harder to tell the difference between a non-profit and for-profit board of directors,” McDonough said. “It’s this for-profit ethos that has swarmed and swamped the U.S. medical space. Many people think the system can prioritize patients and profits at the same time and that it will be okay. But then we look at calamities like Steward, and we think to ourselves, maybe it can’t. And maybe it won’t be okay.”\nConsequences of cost-cutting\nFor Steward patients, it wasn’t okay. Reports of poor-quality care and compromised patient safety ran the gamut: from understaffed emergency rooms and ill-equipped maternity wards, to stairwells infested with bats, to cancelled surgeries and suspended trash service due to unpaid invoices. These extreme examples represent what a growing body of research suggests: Health care quality declines when private equity and its extreme for-profit approach take over.\nA 2023 https://jamanetwork.com/journals/jama/fullarticle/2813379#google_vignette found that Medicare patients at private equity-owned hospitals suffered a 25% increase in hospital-acquired complications compared to Medicare patients at hospitals not owned by private equity. These complications included a 38% increase in bloodstream infections from central lines—longer-term, surgically inserted ports through which patients can intravenously receive fluids, medications, and blood—despite 16% fewer central lines placed. Similarly, the rate of surgical site infections doubled at private equity-owned hospitals while those at the control hospitals decreased. And while falls at hospitals not owned by private equity have been trending downward—a product of a nationwide, decades-long hospital safety movement—falls at private equity-owned hospitals have remained steady, amounting to a 27% relative increase.\n“We believe [these findings are] largely explained by staffing cuts,” said the study’s senior author Zirui Song, PhD ’12, associate professor at Harvard Medical School and Massachusetts General Hospital. “The unique financial pressures private equity-owned hospitals face, such as new debt placed on them from the acquisition and expectations of profitability in the short run, may lead to cutting the costs of delivering care—such as through reducing staffing. But while you may be able to substitute people with machines in other industries, health care remains human-labor intensive, especially inpatient care. Cutting staff can have salient consequences for quality of care and patient outcomes.”\nAnother https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/2769549 by Song and colleagues found that private equity-owned hospitals earned 27% more income after acquisition than hospitals not owned by private equity. That financial gain was fueled by increasing charges—the asking prices for hospital services—by between 7% and 16%, depending on the department, as well as by issuing more charges per day and seeing fewer patients enrolled in Medicare, which provides lower reimbursements than commercial insurers.\nExacerbating disparities\nWhat type of hospitals does private equity tend to target?\nNew evidence from Song and colleagues suggests that firms typically set their sights on financially healthier—rather than struggling—hospitals, compared to similar peer hospitals that were not acquired. That’s because private equity firms tend to place new debt onto acquired hospitals, and those on stronger financial footing are better able to take on that debt.\nThere are examples, however, of hospitals serving mostly uninsured or publicly insured patients being taken over by private equity firms. These takeovers may exacerbate health disparities, as many of these disadvantaged patients belong to racial or ethnic minorities and already suffer worse health outcomes, said Song. When discontinuation of hospital services—or total closure—occurs, it has an outsize impact in communities where access to health care is already limited. Carney Hospital is one such example; in an op-ed, Harvard Chan School’s Alecia McGregor, assistant professor of health policy and politics, called its closure “a matter of life and death” that threatens to deepen Boston’s already extreme racial disparities in health.\n“I don’t think there is enough evidence to definitively say that private equity targets hospitals that mostly serve people of color. But in some cases, these financially vulnerable facilities may fit their business model,” McGregor said. “And when private equity backed acquisitions lead to closures, this is when marginalized communities often hurt the most. Take Hahnemann University Hospital, for instance—a historic facility serving mostly low-income Black and Hispanic Philadelphians that was closed by its private equity owner after less than two years. Many viewed the closure as a maneuver for the hospital’s prime city real estate.”\nPESP also reports that a quarter of private equity-owned hospitals serve rural populations, whose health care alternatives are sparse if they’re unsatisfied with quality or costs and whose outcomes are jeopardized if the only hospital in town closes. Since Nashoba Valley Medical Center was closed, first responders travel around 15 miles to transport patients to emergency care, according to a local fire chief. They used to travel three.\nPolicy potential\n“Theoretically, there could be benefits to private equity investments in health care. They could provide facilities and clinicians with an infusion of capital, but also with managerial know-how and business acumen that might improve health care, such as through making care more ‘efficient,’” Song said. “Unfortunately, however, the current evidence base does not support that. Rather, evidence seems to suggest that by cutting the human labor and other inputs that make care delivery possible—also seen in private equity acquisitions of physician practices and nursing homes—the care might just become less safe.”\nSong published a series of policy recommendations for officials looking to reduce corporate influence, specifically that of private equity, over health care delivery and outcomes. His recommendations for state policy included reviving or enforcing corporate practice of medicine laws, which, in their aim to protect physicians as independent practitioners, can go as far as prohibiting corporations from hiring physicians or influencing medical decisions. His recommendations for federal policy included:\n- Strengthening fraud and abuse protections\n- Improving Federal Trade Commission staffing and bandwidth, in order to improve oversight over health care acquisitions and mergers\n- Discouraging risk-taking behavior by corporate owners (sometimes referred to as moral hazard), through measures like legally affiliating private equity firms with their rolled-up set of acquired entities, limiting the percent debt a firm can use to make an acquisition, and reforming the tax benefit that allows private equity proceeds to be taxed at 20% (rather than the regular corporate business rate, which is higher)\n- Regulating health care prices and prohibiting surprise billing\n- Increasing public transparency into private equity acquisitions\nSome policymakers have already begun efforts to enact these recommendations. In June, Massachusetts senators Elizabeth Warren and Edward Markey introduced the Corporate Crimes Against Health Care Act, which would penalize private equity firms if a health facility they own closes or has poor finances resulting in injury or death to a patient. A month later, Markey proposed another bill, the Health Over Wealth Act, which would require greater transparency for private equity firms and for-profit companies that own health care entities.\nMeanwhile, in the last year, several congressional committees—including the Senate Budget Committee, the Senate Committee on Homeland Security and Governmental Affairs, and the House Committee on Ways & Means—have launched investigations into and held hearings on the role of private equity in health care. On a state level, legislation to regulate private equity in health care is pending in Massachusetts, New Jersey, New York, and Pennsylvania. California, Indiana, Minnesota, New Mexico, and Oregon already have programs that do so. (In September, California Governor Gavin Newsom vetoed a bill that would further intensify regulations.)\nDeeper changes\nThese regulations—if passed—could help protect physicians as well as patients. One of the significant changes from the corporatization of health care is that, increasingly, physicians are no longer working for themselves. In the 1980s, most doctors owned their own small clinics. Today, nearly 80% are employed by a hospital system or corporation—up from just over 60% in 2019, according to Avalere Health.\n“If you’re a physician working in a hospital, chances are you don’t work for the hospital. You work for a corporation,” McDonough said. “And when you sign on with the corporation, you sign a non-compete clause. You can’t criticize anybody or raise your voice even as your workload keeps growing, even when you’re the only physician in the emergency department with multiple traumas, even when you’re seeing patients being put at risk and your colleagues being exploited.”\nAs this hypothetical proves reality for more and more physicians, many are banding together to advocate for some of the policies Song recommends. A physician advocacy group called Take Medicine Back, for instance, is working to garner support for corporate practice of medicine laws.\nBurnt out, frustrated—and organizing\nIn November, primary care physicians employed by Massachusetts’ largest health system, non-profit Mass General Brigham, cited the “corporatization of medicine” among their reasons for pushing to unionize. Across the country, a small number of doctors—around 70,000, representing 8% of the profession—already belong to a union. But that number has been growing steadily, and will likely continue to do so with the arrival of a new generation of physicians. Currently, 20% of medical residents—more than 32,000—belong to a union, a number that has doubled since 2019.\nBut tighter regulations on private equity and corporations in health care can only achieve so much. Many experts believe deeper changes to health policy and investments in public health are equally needed. Examples include:\n- Higher reimbursements for public insurance, so that, in McGregor’s words, “small community hospitals that serve populations largely on Medicare or Medicaid can better meet their costs and remain in business without the private sector filling in”\n- Simplified health insurance systems, like those in the Netherlands and Switzerland, that use private insurance plans that are streamlined, with fewer choices, making them more transparent and easier to understand and regulate\n- Funding for non-medical social care, such as housing and food—in Rosenthal’s words, “social supports that make a big difference in people’s lives and that, when underinvested in, drive up our health care costs”\n‘One of the biggest lies we’ve ever been told’\nThese additional policy levers could help diminish for-profit health care’s influence, but by how much is a matter for debate.\n“At the end of the day, I think we’re always going to have this kind of mixed public and private system,” Rosenthal said. “Politically, it would be very challenging for us to go in a more government-focused direction. There’s just a lot of distrust. And the one big thing that’s quite different about our country is that we don’t consider health a right. It’s not in our constitution like it is for many of our peers.”\nBut significant change may be on the horizon, driven by public discontent around health care and growing visibility, brought by cases like Steward, into the consequences of a system where profits can come at the expense of patient care.\nWhen health care follows the money, we get sicker and sicker.\nAlecia McGregor, assistant professor of health policy and politics\n“As a country, we’ve become desensitized to this notion that health care is the same as any ordinary commodity, and that the provision of health care can be run like any other business,” McGregor said. “I think this is one of the biggest lies we’ve ever been told, because we’ve seen health care costs skyrocket in a way that’s different from any of our wealthy country counterparts, yet our outcomes—life expectancy, maternal health, infant mortality—are abysmal. When health care follows the money, we get sicker and sicker.”\n“Surrendering our health care system to the for-profit marketplace was a fundamental error that we’re paying the debts of right now,” McDonough added. “But I see people working on it, reassessing the role and value of for-profits and asking what a post-neoliberal health care system might look like.”\nIn the meantime, the story of Steward, now under new ownership and a new name, continues to unfold. Its physician network, made up of 5,000 doctors, was recently purchased by Rural Healthcare Group and rebranded as Revere Medical. Rural Healthcare Group is owned Kinderhook Industries, a private equity firm.\nFor concerned patients, Rosenthal offered some concrete advice. “Find a provider you trust and be skeptical. Always ask about the benefits of an intervention. Because more services, more tests, more treatments are not always beneficial—but they’re always profitable.”",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "negative",
    "categories": [
        "Health",
        "Economy, Business and Finance"
    ],
    "ai_allow": true,
    "canonical": false,
    "webz_reporter": false,
    "external_links": [],
    "external_images": [],
    "entities": {
        "persons": [],
        "organizations": [
            {
                "name": "Steward Health Care",
                "sentiment": "none"
            },
            {
                "name": "Harvard",
                "sentiment": "none"
            }
        ],
        "locations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": "d74998c85116662c4a7b08efc79701c57d3f1ed1",
        "first_syndicated": true
    },
    "rating": null,
    "crawled": "2024-12-17T16:22:32.170+02:00",
    "updated": "2024-12-17T16:22:32.170+02:00"
}