{
    "thread": {
        "uuid": "9e0e5470258879e2b6c10732f2f1cfb9bbdb4b93",
        "url": "https://kz.kursiv.media/en/2024-12-17/engk-yeri-tightening-belts-november-sees-decline-in-consumer-confidence-in-kazakhstan",
        "site_full": "kz.kursiv.media",
        "site": "kursiv.media",
        "site_section": "https://kz.kursiv.media/en",
        "site_categories": [],
        "section_title": "Kursiv Media Kazakhstan — the latest news on economy and politics, businesses and finances in Kazakhstan - kz.kursiv.media",
        "title": "Tightening belts: November sees decline in consumer confidence in Kazakhstan",
        "title_full": "Tightening belts: November sees decline in consumer confidence in Kazakhstan",
        "published": "2024-12-17T12:55:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "KZ",
        "main_image": "https://cdn-kz.kursiv.media/wp-content/uploads/2024/12/1e9242e117dfab623091.jpg",
        "performance_score": 0,
        "domain_rank": 30163,
        "domain_rank_updated": "2024-12-09T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "9e0e5470258879e2b6c10732f2f1cfb9bbdb4b93",
    "url": "https://kz.kursiv.media/en/2024-12-17/engk-yeri-tightening-belts-november-sees-decline-in-consumer-confidence-in-kazakhstan",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "Anastasiya Sablina",
    "published": "2024-12-17T12:55:00.000+02:00",
    "title": "Tightening belts: November sees decline in consumer confidence in Kazakhstan",
    "text": "Tightening belts: November sees decline in consumer confidence in Kazakhstan\nThe consumer confidence index (CCI) in Kazakhstan is declining but remains in the optimistic zone. Residents perceive expected inflation to be higher than actual inflation. Many Kazakhstanis frequently report notable price hikes and anticipate significant price growth over the next month and the coming year. Although anxiety levels, including concerns about the labor market, continue to decline, other economic indicators are showing signs of weakness. The credit and deposit confidence indexes have decreased, along with the percentage of people planning major purchases, especially those requiring credit.\nThis report highlights the findings from the 24th wave of Freedom Finance Global PLC’s Consumer Confidence Survey, conducted monthly since November 2022 using United Research Technologies Group’s methodology.\nPhoto by Ilya Kim\nReversing the upward trend\nThe stronger consumer optimism observed in September and October 2024 led to a decline in November, mirroring the trend seen in August after growth in June and July. In November, the CCI dropped by 3.2 points to 101.3. Correspondingly, the related indexes also declined — most notably, the current state index, which fell by 3.8 points to 83, and to a lesser extent, the consumer expectations index, which dipped by 1 point to 129.9, maintaining relative stability.\nAlmost all sub-indexes decreased, with two exceptions: the index of short-term expectations for the country’s economy (+0.1 points to 129.9) and the index of long-term expectations (+1.5 points to 131.9). These gains suggest a relatively optimistic outlook, despite the lower assessments of the current economic situation. The most significant declines were seen in the index of changes in the economic situation in Kazakhstan (-5.8 points to 76.8) and the index of expected changes in personal financial situation (-4.6 points to 127.9).\nUnlike in 2023, when November marked the peak value for the year at 108.2 points, followed by a drop in December to 104.7 points, 2024 saw consumer confidence stall as early as November. Will consumer confidence continue to decline and slip into the pessimistic zone? In the absence of major economic shocks, this seems unlikely, given the optimistic outlook for the country’s economy.\nMen and young consumers see confidence decline\nThe unusual gender gap observed in October, when men expressed more optimistic views (+5.8 points to 106.5) compared to women (-1.6 points to 102.8), shifted in November. Men’s optimism declined sharply (-6.5 points to 100), edging close to the pessimistic zone. Women, on the other hand, saw only a slight dip in confidence (-0.2 points to 102.6), keeping them firmly in the optimistic range.\nMost age groups experienced a decline in consumer confidence, continuing the typical trend: older Kazakhstanis remain in the consumer pessimism zone, while younger consumers maintain optimism despite the downturn. Among those aged 45 to 59, the confidence index fell 3.7 points to 95.9 and for those over 60, it stands at 93.4 points. Young consumers, however, remain more optimistic, though their confidence has slipped. The index for 18-to-29-year-olds dropped by 5 points to 113.4, while 30-to-44-year-olds saw a decline of 3.7 points to 101.6. The only age group to show growth in November was the oldest Kazakhstanis, whose confidence rose slightly by 0.7 points.\nConsumer pessimism hits western regions and major cities\nThe number of regions in the consumer optimism zone has decreased. In October, 14 regions were in the optimistic zone, but by November, that number had dropped to 12. Regions joining the consumer pessimism zone include the Akmola (-12.6 points to 97.8), West Kazakhstan (-18.6 points to 92) and Karaganda regions (-5.7 points to 94.9), along with Almaty city (-2.2 points to 99.8). On the other hand, the North Kazakhstan (+5.9 points to 102.6) and Ulytau regions (+6.5 points to 102) returned to the optimistic zone.\nAdditionally, several regions showed a sharp decline in consumer confidence while remaining in the optimistic zone. Notable decreases were seen in the Atyrau (-14.3 points to 102.5), Zhambyl (-8.3 points to 102.4), Mangystau regions (-5.8 points to 103.8) and Astana (-5.4 points to 100). Meanwhile, the Kyzylorda region (+4.4 points to 112.5), along with the North Kazakhstan and Ulytau regions, posted the most significant increase in consumer confidence.\nThe downward trend in anxiety\nDespite the noticeable drop in consumer confidence, levels of anxiety among Kazakhstanis have not increased. On the contrary, as in previous months, more respondents (37.2%, up by 0.9 percentage points, p.p.) reported that nothing bothered or worried them in November.\nCommon concerns such as financial hardships (-1.8 p.p. to 26.6%), health issues (-1.7 p.p. to 9.4%), family and household problems (-1.5 p.p. to 6.2%) and work-related issues (-1.4 p.p. to 4%) were mentioned less frequently. The only factor that caused a slight uptick in anxious sentiment was inflation and rising costs (+0.5 p.p. to 8.6%).\nInflation slowdown\nAccording to the Bureau of National Statistics (BNS), annual inflation has been slowing and reached 8.4% in November, a 0.1% drop year-on-year (YoY). However, unlike in October, when consumers tended to moderate their inflation estimates despite rising inflation, in November, more Kazakhstanis reported that prices were growing faster than before (+2.4 p.p. to 49.9%). Nearly half of respondents believe this year’s price hikes have been particularly significant.\nA similar trend was seen in individual assessments of the inflation rate over the past month. More consumers noted sharp spikes in prices in November (+3.3 p.p. to 40.9%), despite monthly inflation holding steady at 0.9%, the same as in October.\nInflation expectations exceed actual inflation\nThis survey employs probabilistic quantification based on Burke’s methodology to calculate inflation expectations, which are inherently inertial.\nIn November 2024, expected annual inflation rose to 8.9% month-on-month (MoM), compared to the actual annual inflation of 8.4% YoY. This created a sharp increase in the ratio of expected inflation to perceived inflation, reaching 1.051, indicating a worsening of inflation expectations among the population. This was primarily driven by an unusual increase in uncertainty.\nIn Astana and Almaty, inflation sentiment worsened further. The ratio of expected annual inflation to actual inflation reached 1.08 in Astana and 1.18 in Almaty, exceeding the national average of 1.05. While pessimistic inflation expectations in Astana have persisted for four consecutive months, Almaty saw a sharp increase in this metric in November. Uncertainty levels rose by approximately 2 p.p. in both cities, although they remained below the national average of 16.9%. However, the share of pessimists, after removing uncertain responses, remains higher in Astana (76.5%) and Almaty (80.3%, up 7.4 p.p.) compared to the national average of 72.6%.\nGrowth in pessimistic inflation estimates is driven by women and older consumers\nWomen, who are typically more concerned about price spikes, accounted for the largest increase in pessimistic inflation estimates in November. Among women, pessimism rose sharply for monthly (+6.5 p.p. to 45.9%) and annual inflation (+3.2 p.p. to 55.3%). Men showed more moderate changes, with a slight decrease in pessimism about monthly inflation (-0.2 p.p. to 35.2%) and a smaller increase in pessimism about annual inflation (+1.7 p.p. to 43.9%).\nMiddle-aged consumers (aged 30 to 44 and 45 to 59) remain the most pessimistic about annual inflation, with 52.4% and 50%, respectively, believing prices rose faster than usual in November. However, the largest increase in pessimistic assessments came from the oldest age group (+4.5 p.p. to 47.3%). Retirees were also the most sensitive to strong monthly price hikes, showing the sharpest rise in pessimistic expectations and becoming the most pessimistic group regarding monthly inflation (+6.8 p.p. to 44.1%).\nRegionally, the Mangystau (53.3%) and Pavlodar regions (50.8%) reported the highest share of residents noticing monthly price hikes. Over the year, pessimistic assessments were most prevalent in the Pavlodar region (57.3%) and the North Kazakhstan region (57.1%), despite an increase in consumer confidence in the latter.\nCheaper goods and services amid growing concerns about prices\nAn interesting pattern emerges when examining the goods and services that consumers perceive as experiencing price hikes. Despite reporting a sharper increase in prices overall in November, many key food items, as well as housing and utilities, experienced price declines.\nFood items such as flour (-7.7 p.p. to 12.8%), salt and sugar (-7.2 p.p. to 11.5%), bread and baked goods (-5.7 p.p. to 21.1%) and cereals and pasta (-5.1 p.p. to 18.7%) saw notable price drops. Other staples, including eggs (-4.8 p.p. to 12.3%), vegetable oil (-5.9 p.p. to 12.7%), cheese and sausages (-5.1 p.p. to 8.2%), as well as confections (down 6.3%) and coffee and tea (down 4.2%), also became significantly less expensive in November. Other goods and services also showed price decreases, though these changes were less significant.\nNot-so-moderate expectations of price growth\nUnlike moderate estimates of recent price growth, forecast expectations have shifted more sharply. Even in the short term, there has been a notable increase in pessimistic price growth projections (+8.7 p.p., with 30.6% expecting strong price hikes in the next month), reinforcing the trend of rising price expectations.\nThe annual outlook, which had been more moderate in previous months, also saw an increase in pessimistic assessments (+2.1 p.p. to 27.5%) and a rise in the proportion of those uncertain about price trends (+2.6 p.p. to 16.9%). However, these shifts were less significant compared to the more dramatic changes in short-term price growth projections.\nVarying sensitivity in forecast estimates\nAn interesting trend emerges when examining gender differences in price growth forecasts. Women tend to be more concerned about future price increases, with pessimistic estimates accounting for 34.2% in monthly forecasts and 27.7% in annual forecasts. This disparity is particularly evident in the short term, where the increase is +10.7 p.p. compared to men at +6.5 p.p., reaching 26.7%. However, in long-term forecasts, the difference narrows significantly to +1.4 p.p. for women and +2.6 p.p. for men, reaching 27.2%. Thus, while the gender gap in annual price growth forecasts is almost negligible, it remains notable in short-term assessments.\nIn November, young adults aged 30 to 44 stood out as the most pessimistic group regarding price growth forecasts. They were the most «sensitive» age group in terms of expectations for price hikes over the next month, with a significant increase of +12.1 p.p. to 34.7%. They also ranked among the most pessimistic groups regarding price growth over the next year, rising by +2.6 p.p. to 28.5%. For comparison, the share among younger adults aged 18 to 29 was slightly higher at 28.6%.\nRegionally, residents of the Ulytau region consistently have the strongest expectations for price growth. In the short-term forecast (next month), pessimistic estimates surged to 43.2% (+14.8 p.p.), while in the long-term outlook (next year), they climbed even further to 45.9% (+19 p.p.). This places residents of the Ulytau region well ahead of other regions in terms of pessimistic forecasts.\nThe slowdown in annual growth expectations\nIn November, upward sentiment regarding the dollar-to-tenge exchange rate continued to grow. However, expectations for growth in the annual outlook have slightly slowed (+1.3 p.p. to 60.7%), while monthly expectations remained significantly higher (+4.3 p.p. to 44.9%). Thus, nearly two-thirds of Kazakhstanis anticipate the dollar will strengthen against the tenge over the next year, and almost half expect it to strengthen in the coming month.\nMen are more likely to believe the dollar will strengthen against the tenge. This is true both in terms of total forecast shares for the year and month (63.8% and 47%, respectively, compared to 57.8% and 42.9% for women) and in the growth trends (+3.3 p.p. and +6.4 p.p., respectively, while for women the changes are -0.5 p.p. and +2.5 p.p.). Among age groups, Kazakhstanis aged 30 to 44 are the most optimistic about the dollar’s rise, with 66.8% expecting growth over the year and 49.3% expecting growth over the month. This group is now more optimistic than younger adults, who have become more cautious about annual forecasts. Residents of Almaty are most optimistic about the dollar’s rise, with 73.3% expecting growth over the year and 58.6% expecting growth over the month. In the short term, upward sentiment is also prominent in the Mangystau region (56.8%), while in the long-term outlook, residents of the Ulytau region are the most confident, with 77.1% expecting the dollar to strengthen against the tenge.\nStability in the labor market\nThe decline in anxiety surrounding Kazakhstan’s labor market continued into November, as the unemployment expectations index rose slightly by 0.7 points to 72.9. This shift reflects a redistribution of responses toward greater uncertainty, driven primarily by a reduction in pessimistic views about rising unemployment over the next year (-1.2 points to 40.6%).\nIn November, men remained more concerned about the labor market, with 41.2% expressing anxiety (down 0.3 p.p.). Women, on the other hand, were more likely to be less concerned. Notably, an unusual pattern emerged across age groups: older adults, who traditionally express the greatest concern about unemployment, showed a decrease in pessimism (-2.1 p.p. among those aged 45 to 59 and -2.9 p.p. among those 60 and older). This shift left adults aged 30 to 44 as the most concerned group regarding the labor market in November, with 42.2% expressing worry (+0.2 p.p.). Regionally, residents of the Zhambyl region were most concerned about job reductions, with 49.7% expressing pessimism. In contrast, residents of the Kostanay region were least concerned, with only 30.7% reporting anxiety about unemployment.\nDeclining confidence in loans and lower spending\nThe increase in the share of people planning to take out loans over the next 12 months, observed in October, reversed in November. The share dropped from 21.1% to 17.3%, down 3.9 p.p., as more individuals chose to postpone or avoid borrowing for the time being. This decline was relatively even across genders, with men dropping by 3.2 p.p. to 17.6% and women by 4.5 p.p. to 17%. Among age groups, middle-aged Kazakhstanis (45 to 59 years old) showed the most significant decrease, down 4.8 p.p. to 16.3%. Regionally, residents of the Kyzylorda (-5.5 p.p. to 24.5%), Turkestan (23%) and Ulytau (24.2%) regions remain the most likely to resort to loans. In contrast, residents of the North Kazakhstan (-1.9 p.p. to 7.5%,) and Abay (9%) regions are the least likely to borrow.\nUnlike previous months, when the credit and deposit confidence indexes remained relatively stable, both experienced declines in November. The credit confidence index dropped by 1.1 points to 37.5, driven by a 1.4-point increase in the share of respondents (47.6%) who believe now is an unfavorable time to take out loans. This decrease was most pronounced among men (-2 points to 35.2, compared to a smaller drop for women at -0.3 points to 39.6), younger people (-2.6 points to 38.8) and retirees (-2.1 points to 34.8). Regionally, higher credit confidence is observed in the Kyzylorda (41.4 points), Mangystau (41.9 points) and Ulytau (41.7 points) regions. The lowest credit confidence is recorded in the Abay (31.3 points) and Pavlodar (30 points) regions.\nThe deposit confidence index experienced a sharper decline, falling by 2 points to 53.1. This decline is due to a decrease in the share of respondents who believe now is a favorable time for using deposit facilities (-4.4 points to 33.1%). Men experienced the largest decline in deposit confidence (-3.4 points to 50.7), compared to a smaller decrease of -0.7 points to 55.2 for women. Middle-aged Kazakhstanis were also notably less confident (-2.6 points to 53.1 among those aged 30 to 44 and -2.5 points to 50.8 among those aged 45 to 59). The Abay region stands out for having the highest deposit confidence (58 points), despite ranking lowest for credit confidence. In contrast, the Atyrau region, which previously led in deposit confidence, now reports the lowest level (47.7 points).\nEmotional climate remains stable\nAlthough fewer Kazakhstanis reported feeling worried or disturbed in November, this did not significantly impact overall sentiment. Both optimistic (-0.5 p.p.) and pessimistic (-0.4 p.p.) assessments saw slight declines, with half of respondents continuing to describe the overall mood as calm (56.2%).\nGenerally, women are more likely to notice anxious sentiments around them (39.1% compared to 33.7% for men). However, in November, men expressed more pessimism (+0.7 p.p.), while women became less pessimistic (-1.3 p.p.). A familiar trend persists: anxiety levels tend to increase with age. In November, Kazakhstanis aged 45 to 59 showed the greatest rise in pessimism (+2.3 p.p. to 40%). Regionally, the lowest anxiety levels were reported in the western regions: Aktobe (24.1%), Mangystau (25.6%) and Ulytau (25.7%). In contrast, the highest levels of anxiety were observed in the East Kazakhstan region (53%).\nThe level of stress experienced by Kazakhstanis remained largely unchanged in November. Nearly every second respondent (49.2%) reported experiencing stress, with one in five (20.9%) experiencing it at least several times a week. Men are less likely to report stress: 52.1% of men said they did not experience stress, compared to just 42.3% of women. Adults also reported lower stress levels: 47.1% of those aged 45 to 59 and 56% of those over 60 said they had not experienced stress. The Pavlodar region leads in reported stress levels, with 57.2% encountering stressful situations frequently, while residents of the Aktobe region reported the lowest stress levels (36.6%).\nDeclining optimism and confidence in November\nNovember 2024 saw a decline in consumer confidence, continuing the wave-like pattern observed in the second half of the year. This trend featured three consecutive months of rising consumer confidence, followed by a decline, and then a return to growth. Nearly all sub-indexes also showed a decline, except for those assessing the future state of the national economy. The drop in consumer confidence was primarily driven by men and younger consumers, with an increasing number of regions entering the consumer pessimism zone. The expected inflation rate, as estimated by Kazakhstanis, remains higher than the perceived inflation rate. When reflecting on past price trends, respondents were slightly more likely to report significant price hikes over both short and long-term periods. However, in November, fewer respondents reported noticeable price spikes for specific goods and services compared to the previous month. Looking ahead, Kazakhstanis are abandoning moderate inflation forecasts, instead anticipating sharp price growth in both the short term (next month) and long term (next year).\nDespite a decline in consumer anxiety and concerns about job security, confidence in credit and deposit instruments has weakened. This has led consumers to postpone or forgo major purchases, especially those reliant on borrowed funds.",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "negative",
    "categories": [
        "Economy, Business and Finance",
        "Social Issue",
        "Politics"
    ],
    "ai_allow": true,
    "canonical": false,
    "webz_reporter": false,
    "external_links": [],
    "external_images": [],
    "entities": {
        "persons": [],
        "organizations": [],
        "locations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": null,
        "first_syndicated": false
    },
    "rating": null,
    "crawled": "2024-12-17T14:08:11.307+02:00",
    "updated": "2024-12-17T14:08:11.307+02:00"
}