{
    "thread": {
        "uuid": "5fe9bcf48f4d56ffdeef57329bd0f744099e9170",
        "url": "https://www.twz.com/news-features/biden-puts-forward-final-ukraine-military-aid-package-of-his-administration",
        "site_full": "www.twz.com",
        "site": "twz.com",
        "site_section": "https://www.golf.einnews.com/live_feed",
        "site_categories": [],
        "section_title": "Live Feed Wire - Golf News Today - EIN Presswire",
        "title": "Biden Puts Forward Final Ukraine Military Aid Package Of His Administration",
        "title_full": "Biden Puts Forward Final Ukraine Military Aid Package Of His Administration",
        "published": "2025-01-10T02:28:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "main_image": "https://www.twz.com/wp-content/uploads/2024/01/17/Sea-Sparrow.jpg",
        "performance_score": 0,
        "domain_rank": 6345,
        "domain_rank_updated": "2025-01-06T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 1,
                "comments": 1,
                "shares": 1
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "5fe9bcf48f4d56ffdeef57329bd0f744099e9170",
    "url": "https://www.twz.com/news-features/biden-puts-forward-final-ukraine-military-aid-package-of-his-administration",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "Howard Altman",
    "published": "2025-01-10T02:28:00.000+02:00",
    "title": "Biden Puts Forward Final Ukraine Military Aid Package Of His Administration",
    "text": "The Biden administration today announced [its last Presidential Drawdown Authority aid](https://www.defense.gov/News/Releases/Release/Article/4025039/biden-administration-announces-additional-security-assistance-for-ukraine/) to Ukraine before Donald Trump becomes president. It is a $500 million package that includes [AIM-7 Sparrow](https://www.twz.com/sea-sparrow-rim-7-surface-to-air-missiles-are-headed-to-ukraine)s and [RIM-7 Sea Sparrow](https://www.twz.com/sea-sparrow-rim-7-surface-to-air-missiles-are-headed-to-ukraine)s, missiles for so-called [FrankenSam air defense systems,](https://www.twz.com/sea/ukraines-frankensam-that-used-rim-7-sea-sparrow-missiles-breaks-cover) and [AIM-9M Sidewinder](https://www.twz.com/ukraines-aim-9m-sidewinders-can-be-used-in-multiple-ways)s, as well as air-to-ground munitions, support equipment for the [dozens of donated F-16s](https://www.twz.com/air/f-16-officially-in-ukrainian-service-self-protection-pods-included), the vast majority of which have still not arrived, and armored bridging systems among other items.\nThe Pentagon declined to provide us with details about what variant of air-to-ground munitions or what kind of support equipment for F-16s, which the U.S. has not supplied but allowed several nations to [provide their own Vipers to Ukraine](https://www.twz.com/news-features/transfer-of-f-16s-to-ukraine-is-now-underway).\nThis PDA, which provides Ukraine with equipment from U.S. stocks, also included armored bridging systems, secure communications equipment, small arms and ammunition, spare parts, ancillary equipment, services, training, and transportation. It leaves a little more than $4 billion in PDA authorizations for the incoming Trump administration to decide what to do with, Pentagon Deputy Press Secretary Sabrina Singh [told reporters](https://www.defense.gov/News/Transcripts/Transcript/Article/4024947/deputy-pentagon-press-secretary-sabrina-singh-holds-press-briefing/), including from The War Zone, on Wednesday. She blamed the [2023 budget impasse](https://www.twz.com/ukraine-situation-report-u-s-aid-funds-have-run-out) for the Biden administration’s inability to provide the full mandate of PDA donations to Ukraine.\nAsked about whether the Pentagon is concerned that funding for Ukraine could dry up under the Trump administration, Singh noted “bipartisan” Congressional support for Kyiv.\nSince taking office, the Biden administration has committed more than $66.5 billion in security assistance to Ukraine, [according to the latest Pentagon statistics](https://media.defense.gov/2025/Jan/09/2003626080/-1/-1/1/UKRAINE-FACT-SHEET-JAN-9-2025.PDF). In addition to the aforementioned air defense capabilities, that funding has provided Ukraine with a wide array of arms including shoulder-launched [Javelin anti-tank weapons](https://www.twz.com/45132/as-ukraine-pummels-russians-with-javelin-missiles-can-production-keep-pace-with-demand), [Abrams](https://www.twz.com/this-is-what-m1-abrams-tanks-will-bring-to-the-fight-in-ukraine) tanks, drones like the [Phoenix Ghost family of ](https://www.twz.com/air/secretive-phoenix-ghost-kamikaze-drones-rushed-to-ukraine-finally-come-out-of-the-shadows)loitering munitions and [Army Tactical Missile System (ATACMS](https://www.twz.com/atacms-appears-to-have-hit-battlefield-ukraine-in-spectacular-fashion)) now being used [against targets in Russia](https://www.twz.com/land/u-s-supplied-atacms-missile-strike-inside-russia-have-begun).\nThere were other donations announced today.\n[The U.K. Defense Ministry (MoD) announced](https://www.gov.uk/government/news/30000-new-drones-for-ukraine-in-boost-to-european-security) Ukraine will receive 30,000 drones worth $55 million as part of the drone capability coalition.\n“The Drone Capability Coalition supports Ukraine with uncrewed surveillance and attack capabilities,” the MoD announced. “Funding for the new 30,000 drones comes from the U.K., Denmark, Netherlands, Latvia and Sweden.”\nMeanwhile, Canada announced $305 million (440 million Canadian) in military assistance to Ukraine, according to the Ukrainian MoD.\n“The announcement includes the contribution of $200 million to the Czech ammunition initiative and a $100 million donation to the Danish Model to support the production of military drones by Ukraine’s defense industry,” the MoD explained.\nAs Ukraine [continues to lose territory, troops, and equipment](https://www.twz.com/news-features/ukraine-launches-new-offensive-in-russias-kursk-region), the future of its international military support was laid out Thursday during the 25th meeting of the Ukraine Defense Contact Group (USCG). It was held in Ramstein, Germany, against the backdrop of a looming change in the White House, something top of mind among many of the roughly 50 UDCG member nations. While it is the last one for the Biden administration, Zelensky suggested a new meeting could take place in February.\nIn a joint statement issued earlier this morning, the U.S. and 14 other nations pledged to continue seeking ways to provide Ukraine with air force, armor, artillery, de-mining, drone, integrated air and missile defense, information technology, and maritime security capabilities for at least two more years. Over the course of its existence, the UDGC organized separate teams to support each of those functions. All told the U.S. and its allies have [provided more than $126 billion in security assistance](https://www.defense.gov/News/Transcripts/Transcript/Article/4024947/deputy-pentagon-press-secretary-sabrina-singh-holds-press-briefing/) to Kyiv since Russia’s all-out invasion.\n“These documents, jointly developed and agreed upon by Ukraine and its partners, will serve as a foundation for sustaining support and allocating aid in these areas,” Ukrainian Defense Minister Rostem Umerov [stated on Facebook](https://www.facebook.com/rustemumerov.ua/posts/pfbid02ywZtNoy8uXj48CuufmRB6qmFw7VbvKetY1hiWjJz6Y9zv72E9kc5oaCVbLu5GXiql) Thursday.\nShortly after Russia launched its February 2022 invasion, U.S. Defense Secretary Lloyd Austin created the UDCG. Today, during a press briefing, he noted that Russia has seen a tremendous number of its troops killed and wounded fighting Ukraine in no small measure due to allied support.\n“Russia has suffered more than 700,000 casualties in Ukraine. Now that’s more than Moscow has endured in all of its conflicts since World War Two,” he said.\nIn what is likely one of his last press conferences, Austin also called for continuing support for Ukraine with a veiled nod to Trump.\nRussian President Vladimir “Putin wants a world where empire tramples sovereignty, a world where conquest trumps human rights, a world where tyranny bulldozes democracy,” he told reporters. “Every autocrat on Earth is watching to see whether Putin gets away with it, and so this coalition must continue to stand four-square with Ukraine and to strengthen Ukraine’s hand for the negotiations that will someday bring Putin’s monstrous war to a close. Now that road is challenging, but all the alternatives are far worse. No responsible leader would let Putin have his way.”\nEven before taking office, Trump has cast his shadow over future U.S. relations with Ukraine. While it is still unknown [what his approach will be](https://www.twz.com/news-features/what-trumps-election-could-mean-for-the-war-in-ukraine), his choice as peace envoy to Kyiv offered yet another hint about what that could look like.\nTrump wants to broker a peace deal within 100 days of being inaugurated, retired Army Lt. Gen. Keith Kellogg [told Fox News on Wednesday](https://www.foxnews.com/video/6366827160112).\n“People need to understand, he’s not trying to give something to Putin or to the Russians,” Kellogg posited. “He’s actually trying to save Ukraine and save their sovereignty.”\nUntil a peace deal is brokered however, Ukraine will have to fight on with or without U.S. aid.\nThe Latest\nBefore the UDGC meeting, Ukrainian President Volodymyr Zelensky told reporters he is working to end the war on acceptable terms, but did not say what those were. He has [previously floated a 10-point plan](https://www.twz.com/news-features/ukraine-situation-report-dueling-peace-plans-that-are-worlds-apart) that includes, among other things, the withdrawal of all Russian troops from Ukrainian territory and cessation of hostilities, restoration of Ukraine’s territorial integrity, punishing Russia for war crimes, and release of all prisoners and deportees.\n“I do everything I can to end this war with dignity for Ukraine and all of Europe this year, and I know I can count on your support,” he said. Putin, on the other hand, does not want peace, Zelensky argued, pointing to the [introduction of some 12,000 North Korean troops ](https://www.twz.com/news-features/pentagons-assessment-of-north-koreans-fighting-in-kursk-rate-at-which-ukraine-is-losing-ground)to the battlefield as a prime example.\n“Putin is not just holding on to his investments in aggression. He is doubling down. He’s even started basically hiring soldiers from North Korea to keep this war going,” Zelensky argued. “North Korea studies modern warfare. They do not value their people, and we know it. They lose them – 4,000 as [of] today, but Pyongyang gets experience, cheap, to re-export the war, maybe there in the Pacific. At the same time, this collusion with North Korea shows Putin’s weakness, because no ruler in Moscow would ever allow themselves to beg in Pyongyang unless facing critical problems.”\nDefeating Putin is not just in the interest of Ukraine, Zelensky avowed, hinting without proof that [last fall’s drone incursions](https://www.twz.com/air/multiple-drone-incident-just-occurred-over-usaf-fighter-base-in-england) over U.S. bases in Europe might have a Russian connection.\n“Now we see all the reports with [[suspected Russian severing of](https://www.twz.com/news-features/nato-boosting-naval-presence-and-ai-monitoring-in-baltics-after-undersea-cables-cut)] underwater cables in the Baltic Sea, and we all see drone incidents in some countries that are[ raising serious concerns](https://www.twz.com/air/british-troops-reinforce-usaf-airbases-amid-mysterious-drone-incursions). We see debilitation in Africa, which threatens Europe with new migration waves, and we are also learning more about how [Russian intelligence paid militants in Afghanistan](https://theins.ru/en/politics/277723) to target coalition soldiers…Moscow cashed in to kill your soldiers, American soldiers, NATO country soldiers. How can this be forgiven or forgotten? Russia’s hybrid aggression and sabotage in the entire Western world is ongoing, and only by keeping and strengthening our cooperation, by boosting our agreements and coalitions, can truly protect the normal lives of people in all our countries.”\nEarlier on Thursday, the American Enterprise Institute (AEI)[ issued a report](https://www.aei.org/wp-content/uploads/2025/01/Dollars-and-Sense.pdf?x85095) suggesting that failure to support Ukraine in the future would cost the U.S. nearly a trillion dollars over the next five years.\n“We conclude that maintaining security in a strategic environment in which Russia is victorious over Ukraine could cost the United States an additional $808 billion in defense spending over five years,” AEI suggested. “These resources would be required on top of the currently planned defense budget over that same period and would be used to build the defense capacity, capability, and posture to provide for American security and meet current commitments to NATO in the new, more dangerous strategic environment.”\nThe assessment, however, is based on the assumption that the U.S. ends support for Ukraine and NATO allies fail to close the gap. It is questionable at this point whether either of those developments come to pass, especially given the joint statement of support issued today.\nZelensky also justified his [August invasion of Russia’s Kursk region](https://www.twz.com/land/ukraine-situation-report-cross-border-raid-shakes-russias-kursk-region).\n“It’s one of our wins, I think, one of the biggest wins, not just last year, but throughout the war,” he told reporters ahead of Thursday’s UDCG meeting. “Russia had to pull almost 60,000 troops of the Ukrainian Front to deal with it. And as of this Monday, it’s been five months since our troops have maintained a buffer zone on Russian territory.”\n[A recently launched new Ukrainian offensive](https://www.twz.com/news-features/ukraine-launches-new-offensive-in-russias-kursk-region) there has so far achieved little.\n“Russian forces recently advanced in the Ukrainian salient in Kursk Oblast amid continued offensive operations in the area on January 8,” the Institute for the Study of War (ISW) [wrote in its latest assessment](https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-january-8-2025). “Geolocated footage published on January 8 indicates that Russian forces advanced into western Nikolaevka (northwest of Sudzha) and marginally advanced in Makhnovka (southeast of Sudzha). Ukraine’s Special Operations Forces (SSO) reported on January 8 that Ukrainian forces repelled a Russian roughly reinforced platoon-sized mechanized assault in an unspecified area in Kursk Oblast.”\nThe fighting there is fierce, as you can see in the following videos.\nNorth Korea [reportedly lost about 400 troops](https://www.forbes.com/sites/davidaxe/2025/01/08/russia-may-have-lost-400-troops-in-one-battle/) in one assault there.\nThe reported recovery of a Russian Azart radio, a drone detector, and a smartphone from a North Korean soldier killed in Kursk by Ukraine’s 8th SSO Regiment suggests they were more prepared than initially thought.\n“The Azart radio is interesting given that many Russian soldiers still don’t even have these, relying instead on commercially available radios,” noted John Hardie, deputy director of the Russia program at the Foundation for Defense of Democracies ([@FDD](https://x.com/FDD)). “Whereas Ukrainian troops and video footage initially suggested the DPRK troops were unprepared for the drone threat, the drone detector suggests sensitivity to that threat.”\nEven a major chicken processing plant in Kursk wasn’t spared.\n“The Ukrainian Armed Forces attacked the Cherkizovo Chicken Kingdom production facility with drones, and one person was injured,” the independent [Russian Astra news outlet reported on Telegram](https://t.me/astrapress/72026). “The air defense shot down all targets, but the drones’ debris fell on the territory, causing a fire.”\nElsewhere on the battlefield, Russia made some small advances in the Donetsk region, but the frontlines remained largely stagnant in most other places. Here are some key takeaways from [the latest ISW assessment](https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-january-8-2025):\n- Kharkiv: Russian forces continued limited ground attacks northeast of Kharkiv City near Vovchansk and Tykhe on January 7 and 8 but did not make any confirmed advances.\n- Luhansk: Russian forces continued offensive operations in the Kupyansk, Borova and Lyman directions on January 8 but did not make any confirmed advances.\n- Donetsk: Russian forces recently marginally advanced in northern and northwestern Toretsk, toward Kurakhove and Pokrovsk, but did not make any confirmed advances toward Bilohorivka (northeast of Siversk) or Chasiv Yar.\n- Zaporizhzhia: Russian forces continued offensive operations in western Zaporizhia Oblast on January 8 but did not make any confirmed advances.\n- Kherson: Russian forces continued assaults in the Dnipro River direction, including near Kozatskyi Island (northeast of Kherson City near Nova Kakhovka) and Velykyi Potomkin Island (south of Kherson City) on January 7 and 8 but did not make any confirmed advances in the area.\nOn a positive note for Ukraine, despite the continuing Russian assaults, the loss of territory slowed down in December.\n“As of the end of December 2024, Russia occupied 18.14% (+0.07%) of Ukraine, including Crimea and the areas of Donetsk and Luhansk occupied before 2022,” the @War_Mapper open source intelligence group claimed on Twitter. “This represents a net gain by Russia of approximately 408 square kilometers (nearly 253 square miles) over the month.”\n[A Russian attack](https://www.twz.com/the-truth-about-russias-mysterious-winged-glide-bombs) on the southern Ukrainian city of Zaporizhzhia using two [FAB-500 glide bombs](https://www.twz.com/the-truth-about-russias-mysterious-winged-glide-bombs) equipped with [unified gliding and correction modules ](https://www.twz.com/the-truth-about-russias-mysterious-winged-glide-bombs)killed at least 13 and wounded at least 120, [according to Ukrainian officials](https://t.me/ivan_fedorov_zp/15037).\n“There is nothing more cruel than launching aerial bombs on a city, knowing that ordinary civilians will suffer,” Zelensky said on Twitter. “Russia must be put under pressure for its terror. The protection of lives in Ukraine must be supported.”\nA fuel depot supporting Engels Air Base in Russia continues to burn more than a day [after it was struck by Ukrainian drones](https://www.twz.com/news-features/ukraine-targets-strategic-bomber-fuel-supplies-in-long-range-strike-on-russia).\n“Rospotrebnadzor did not find air pollution in Engels during a fire at an oil depot after a drone attack,” [the Russian 7×7 Telegram channel reported](https://t.me/horizontal_russia/43097). “Residents complain of smog. The oil depot itself has not been extinguished for more than a day.”\nWhile Ukraine took credit for the attack [with domestically produced drones](https://www.twz.com/news-features/ukraine-targets-strategic-bomber-fuel-supplies-in-long-range-strike-on-russia), it didn’t say what kind. On Thursday, [the Russian SHOT media outlet claimed](https://t.me/shot_shot/76065) they were [Beaver drones](https://focus.ua/voennye-novosti/565871-poyavilis-pervye-snimki-ukrainskogo-drona-kamikadze-bober-foto), or Bober as they are called in Ukrainian. The fuel depot supports [Engels Air Base](https://www.twz.com/ukraine-situation-report-no-damage-seen-at-russian-bomber-base-after-drone-attacks), located about 300 miles east of the border. It’s home of the 22nd Heavy Bomber Aviation Division and its [Tu-22M3 Backfire-C](https://www.twz.com/we-may-have-our-first-sight-of-a-russian-bomber-launching-missiles-at-ukraine), [Tu-95MS Bear-H](https://www.twz.com/39104/listen-to-the-terrifying-mechanical-growl-of-a-tu-95-bear-passing-overhead), and [Tu-160M Blackjack](https://www.twz.com/43852/russias-first-new-production-tu-160-blackjack-in-decades-makes-its-maiden-flight) bombers that are among those [launching frequent attack](https://www.twz.com/russias-secretive-long-range-bomber-operations-against-ukraine)s on Ukraine.\nShowing another example of drone-on-drone warfare, a Ukrainian drone was seen on video destroying Russian SuperCam and Zala drones.\nWith both sides possessing robust air defenses, pilots of all types of airframes resort to flying low to avoid being picked up on enemy radar. Such is the case of these Mi-24 Hind gunships. The nose camera of one of those Hinds captured the two-flight zipping just above a highway toward the frontlines, which you can see in the following intense video clip.\nAnd finally, the Russian Defense Ministry (MoD) offered a rare glimpse into how it fashions homemade armored vehicles for its troops fighting toward Pokrovsk in the Donetsk region. The troops in the following video are seen welding additional armor to trucks and buggies in another Mad Maxian battlefield adaptation.\nThat’s it for now.\nContact the author: howard@thewarzone.com",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "positive",
    "categories": [
        "Politics",
        "Economy, Business and Finance",
        "Social Issue"
    ],
    "topics": [
        "Politics->defence",
        "Politics->international relations",
        "Politics->government",
        "Economy, Business and Finance->foreign exchange market",
        "Economy, Business and Finance->financial and economic news",
        "Social Issue->social condition",
        "Social Issue->social services",
        "Social Issue->communities"
    ],
    "ai_allow": true,
    "has_canonical": false,
    "breaking": null,
    "webz_reporter": false,
    "external_links": [
        "https://www.defense.gov/News/Transcripts/Transcript/Article/4024947/deputy-pentagon-press-secretary-sabrina-singh-holds-press-briefing/",
        "https://www.aei.org/wp-content/uploads/2025/01/Dollars-and-Sense.pdf?x85095",
        "https://theins.ru/en/politics/277723",
        "https://www.defense.gov/News/Releases/Release/Article/4025039/biden-administration-announces-additional-security-assistance-for-ukraine/",
        "https://t.me/ivan_fedorov_zp/15037",
        "https://www.gov.uk/government/news/30000-new-drones-for-ukraine-in-boost-to-european-security",
        "https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-january-8-2025",
        "https://focus.ua/voennye-novosti/565871-poyavilis-pervye-snimki-ukrainskogo-drona-kamikadze-bober-foto",
        "https://www.facebook.com/rustemumerov.ua/posts/pfbid02ywZtNoy8uXj48CuufmRB6qmFw7VbvKetY1hiWjJz6Y9zv72E9kc5oaCVbLu5GXiql",
        "https://www.foxnews.com/video/6366827160112",
        "https://www.forbes.com/sites/davidaxe/2025/01/08/russia-may-have-lost-400-troops-in-one-battle/",
        "https://t.me/shot_shot/76065",
        "https://t.me/horizontal_russia/43097",
        "https://x.com/FDD",
        "https://media.defense.gov/2025/Jan/09/2003626080/-1/-1/1/UKRAINE-FACT-SHEET-JAN-9-2025.PDF",
        "https://t.me/astrapress/72026",
        "https://aei.org/wp-content/uploads/2025/01/Dollars-and-Sense.pdf?x85095",
        "https://www.t.me/astrapress/72026",
        "https://facebook.com/rustemumerov.ua/posts/pfbid02ywZtNoy8uXj48CuufmRB6qmFw7VbvKetY1hiWjJz6Y9zv72E9kc5oaCVbLu5GXiql",
        "https://www.focus.ua/voennye-novosti/565871-poyavilis-pervye-snimki-ukrainskogo-drona-kamikadze-bober-foto",
        "https://www.t.me/ivan_fedorov_zp/15037",
        "https://www.defense.gov/News/Transcripts/Transcript/Article/4024947/deputy-pentagon-press-secretary-sabrina-singh-holds-press-briefing",
        "https://gov.uk/government/news/30000-new-drones-for-ukraine-in-boost-to-european-security",
        "https://www.x.com/FDD",
        "https://forbes.com/sites/davidaxe/2025/01/08/russia-may-have-lost-400-troops-in-one-battle/",
        "https://www.media.defense.gov/2025/Jan/09/2003626080/-1/-1/1/UKRAINE-FACT-SHEET-JAN-9-2025.PDF",
        "https://defense.gov/News/Releases/Release/Article/4025039/biden-administration-announces-additional-security-assistance-for-ukraine/",
        "https://www.forbes.com/sites/davidaxe/2025/01/08/russia-may-have-lost-400-troops-in-one-battle",
        "https://www.aei.org/wp-content/uploads/2025/01/Dollars-and-Sense.pdf",
        "https://www.defense.gov/News/Releases/Release/Article/4025039/biden-administration-announces-additional-security-assistance-for-ukraine",
        "https://foxnews.com/video/6366827160112",
        "https://defense.gov/News/Transcripts/Transcript/Article/4024947/deputy-pentagon-press-secretary-sabrina-singh-holds-press-briefing/",
        "https://www.t.me/horizontal_russia/43097",
        "https://understandingwar.org/backgrounder/russian-offensive-campaign-assessment-january-8-2025",
        "https://www.theins.ru/en/politics/277723",
        "https://www.t.me/shot_shot/76065"
    ],
    "external_images": [],
    "entities": {
        "persons": [],
        "organizations": [],
        "locations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": null,
        "first_syndicated": false
    },
    "rating": null,
    "crawled": "2025-01-10T03:19:01.945+02:00",
    "updated": "2025-01-10T03:19:01.945+02:00"
}