{
    "thread": {
        "uuid": "e7817fdf5a39e4dccb1ab517e9a2f09b2b47cba9",
        "url": "https://theedgemalaysia.com/node/740299",
        "site_full": "theedgemalaysia.com",
        "site": "theedgemalaysia.com",
        "site_section": "https://theedgemalaysia.com/",
        "site_categories": [],
        "section_title": "The Edge Malaysia - Make Better Decisions",
        "title": "2025 outlook: The key sectors to watch",
        "title_full": "2025 outlook: The key sectors to watch",
        "published": "2025-01-10T02:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "MY",
        "main_image": "https://assets.theedgemarkets.com/aa5_0.jpg",
        "performance_score": 0,
        "domain_rank": 39893,
        "domain_rank_updated": "2025-01-06T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "e7817fdf5a39e4dccb1ab517e9a2f09b2b47cba9",
    "url": "https://theedgemalaysia.com/node/740299",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "Izzul Ikram, Justin Lim, Anis Hazim, Emir Zainul, Isabelle Francis, Izzul Ikram & Syafiqah Salim",
    "published": "2025-01-10T02:00:00.000+02:00",
    "title": "2025 outlook: The key sectors to watch",
    "text": "KUALA LUMPUR (Jan 10): Malaysia’s benchmark FBM KLCI registered a strong 12.58% gain in 2024 — marking its best performance in 14 years — as the country saw a sharp recovery in investor sentiment after a prolonged period of political uncertainties, lifted by strong investment activity and trade activities.\nHow will 2025 turn out to be? Here’s a snapshot of the key sectors that are poised for growth — or expected to face headwinds — this year. From property and automotive sales to healthcare and finance, this report highlights the opportunities and challenges to watch out for.\nO&G: Be selective amid volatile oil prices, capex swings, fleet renewals Oil price volatility and uncertainties surrounding domestic capital expenditure (capex) by the national oil company Petroliam Nasional Bhd (Petronas) and oil producers are likely to weigh on local oil and gas (O&G) stocks this year.\nBrent crude prices, which surged over US$90 (RM403) per barrel last year, are expected to experience a gradual decline in 2025, averaging around US$76 to US$80, according to analysts covering the commodity.\nPetronas, however, may allocate minimal capex for greenfield projects amid ongoing discussions with Petroleum Sarawak Bhd (Petros) over the distribution of natural gas in Borneo, Kenanga Research said in a note.\n“Petronas has expressed concerns over future earnings after the takeover of the sole gas aggregator role by Petros,” AmBank Research said separately. The outcome of discussions on the matter between Petronas and the Sarawak government has yet to be revealed.\nThe global upstream capex, meanwhile, is expected to continue focusing on the deepwater developments, where floating, production, storage, and offloading (FPSO) units are the preferred infrastructure.\n“We see multiple tenders up for grabs in Brazil, West Africa and Malaysia as [FPSO] conversion players return to the market after freeing up capacity after the delivery of prior projects,” AmInvestment Bank said.\nAmong companies with earnings exposure to FPSO assets are Yinson Holdings Bhd (KL: YINSON ), MISC Bhd (KL: MISC ) and Bumi Armada Bhd (KL: ARMADA ).\nAdditionally, offshore support vessel (OSV) charter rates, which have crept up to levels near the previous oil and gas upcycle in 2010s, are expected to remain stable this year due to the supply deficit.\nHowever, AmInvestment noted that many vessels in the market are approaching their operational age limits, and operators will be forced to choose between refurbishments or fleet renewals.\nBut players with younger fleets such as Keyfield International Bhd (KL: KEYFIELD ), with strong cash positions and access to financing, are well placed to expand their fleet sizes.\nKenanga, on the other hand, said it favours upstream service providers and midstream players due to a favourable macro-outlook.\n“We recommend a more selective approach within the upstream services space, focusing on maintenance-driven sectors,” said Kenanga, which picked Keyfield and Dayang Enterprise Holdings Bhd (KL: DAYANG ) for the OSV segment, as well as Dialog Group Bhd (KL: DIALOG ) on potential expansion under Phase 3 for its Pengerang storage tank facilities.\nConstruction: Record project awards, private sector demand to fuel 2025 Construction works for the Johor Bahru-Singapore Rapid Transit System (RTS) Link. Contract rollouts from both the private sector and the government were active in 2024. (Photo by Low Yen Yeing/The Edge) The construction industry, which was the biggest sectoral index gainers on Bursa last year, enters the year buoyed by global private sector demand, multi-year-high project value rolled out, and a clearer government infrastructure pipeline, with analysts largely positive for the sector in 2025.\nKey upcoming projects such as the West Ipoh Span Expressway, Penang Airport expansion and the Sarawak deep-sea port project, along with around 766.9MW of IT supply of data centres committed in Malaysia, may translate into RM29 billion to RM34 billion worth of construction jobs next year, according to RHB Investment Bank.\nContract rollouts from both the private sector and the government were active in 2024, RHB noted in its sector outlook report, with RM183.7 billion worth of construction projects awarded in the first 11 months of the year, 20% higher than full-year 2023 figures and on their way to be the highest annual value since 2016.\nAmInvestment, separately, raised its call on the construction sector to 'overweight' from 'neutral', highlighting that “the dust has settled” on policy uncertainties surrounding new developments.\nWhile data centre awards bolstered order book replenishment assumptions, overseas project wins will be a key driver this year, it said. “We think mean valuations will settle at a higher level in the medium term premised on a multi-year growth story,” it added.\nAmInvestment’s top picks include Gamuda Bhd (KL: GAMUDA ), whose order book reached a record high on its successful overseas pivot, Sunway Construction Group Bhd (KL: SUNCON ), which won data centre construction projects recently, and Vestland Bhd (KL: VLB ), citing its visible contract pipelines and digestible valuations.\nMeanwhile, CIMB Securities maintained its \"overweight\" stance, as it highlighted public-private partnership initiatives and government-backed megaprojects for “high-technology plants, highways, renewable energy, and climate change projects”, as well as the Penang LRT, Penang Airport expansion, and Pan Borneo Highway Sabah projects as key growth catalysts for the medium to long term.\n“We retain Gamuda and IJM Corp Bhd (KL: IJM ) as our top large-cap picks,” it said, while also flagging Malaysia Resources Corp Bhd (KL: MRCB ), whose earnings beat expectations in the third quarter of 2024 (3Q2024), and Muhibbah Engineering (M) Bhd (KL: MUHIBAH ) which, through 64%-owned Favelle Favco Bhd (KL: FAVCO ), has exposure to industrial automation services in O&G, solar and wind segments.\nPower and utilities: Another bright year ahead The power and utilities sector is poised for another bright year ahead, driven by sustained record electricity demand growth and continued energy transition initiatives. The sector has already been in the spotlight in recent weeks due to the base tariff adjustment announced for Regulatory Period 4 (RP4), as well as the shortlisting of winners for the fifth large-scale solar (LSS5) programme.\nElectricity demand is expected to continue climbing in 2025, driven by increasing demand from data centres. In the first nine months of 2024, electricity demand rose 7.3% from 2023.\nDespite the incentive-based regulation mechanism capping Tenaga Nasional Bhd's (KL: TENAGA ) regulated revenue, Kenanga Research believes that higher demand growth will further enhance TNB's plant efficiency, leading to better earnings for its non-regulated generation business. The rate of return on TNB's regulated asset base (RAB) under its transmission and distribution (T&D) businesses was maintained at 7.3% in RP4, with a base capex of RM26.5 billion — up 22.5% from RP3's RM20.55 billion.\n\"This increase in RAB value will lead to higher regulated earnings over the next three years,\" Kenanga said. On top of that, an additional RM16 billion has been approved under RP4 as contingent capex for TNB's energy transition-related T&D upgrades.\nAnalysts' top picks for the conventional power sector include TNB, which is seen as a long-term beneficiary of the influx of data centres in the country, and YTL Power International Bhd (YTLPOWR) on its data centre venture.\nThe impending rollout of the 2GW LSS5, coupled with the 800MW Corporate Green Power Programme (CGGP), is expected to drive record order books for renewable energy (RE) engineering, procurement, commissioning and construction (EPCC) players in 2025.\nAccording to MIDF Research, these programmes are expected to generate a potential RM8.4 billion to RM11.2 billion in EPCC jobs, keeping RE EPCC players busy until 2026.\n\"Margins are expected to be favourable, following the steep decline in solar module prices,\" MIDF Research added.\nAmong analysts' top RE EPCC picks are: Samaiden Group Bhd (KL: SAMAIDEN ), Pekat Group Bhd (KL: PEKAT ), Sunview Group Bhd (KL: SUNVIEW ), and Solarvest Holdings Bhd (KL: SLVEST ).\nOverall, analysts are positive on the power and utilities sector, with most carrying an 'overweight' call on the sector.\nPlantation: CPO price rally seen as short-lived, diversification in favour The surge in crude palm oil (CPO) prices, which was seen towards the end of 2024 due to tight supply and adverse weather conditions, is expected to lose momentum soon. Analysts predict that palm oil output will recover starting in March 2025.\nHowever, the decline may not be as pronounced, as the European Union is increasing its imports of palm oil ahead of the European Union Deforestation Regulation, which takes effect at the end of December this year.\nAnother key factor to watch is Indonesia's plan to introduce a higher export levy as part of its efforts to increase the biodiesel blend to 40% (B40), from 35% currently. However, the planned January 1, 2025 implementation has yet to be officially confirmed.\nMarket watchers have projected that the average CPO price for 2025 will range between RM4,200 and RM4,500 per tonne, down from RM4,450 at the end of 2024, according to data from the Malaysian Palm Oil Council (MPOC).\n\"Once production resumes growth, we will likely see CPO prices corrected,\" said David Ng, a senior proprietary trader at IcebergX Sdn Bhd. \"There is still potential price upside for the sector in the near term.\"\nIvy Ng Lee Fang, the head of Malaysia research and regional agribusiness research at CIMB Investment Bank, remained optimistic about the plantation sector, maintaining an 'overweight' call and favouring upstream players such as SD Guthrie Bhd (KL: SDG ), IOI Corp Bhd (KL:IOI) and Hap Seng Plantations Holdings Bhd (KL: HSPLANT ).\n\"We still like the sector, not purely for the CPO price outlook but also for plans to diversify earnings by expanding into industrial land development and potentially solar projects,\" Ng told The Edge .\nAmong top \"buy\" calls in the plantation sector highlighted by market watchers include TSH Resources Bhd (KL: TSH ) for its long-term upstream expansion plans, United Malacca Bhd (KL: UMCCA ) for anticipated profit growth from newly maturing estates, and Genting Plantations Bhd (KL: GENP ) for stronger property contributions expected in the near future.\nHealthcare: Price control prospect haunts hospital stocks, blesses generic drugmakers Malaysia’s healthcare sector is staring at prospects of price control over private hospital charges, and investors should watch the regulation closely in 2025, market observers said.\nKPJ Healthcare Bhd (KL: KPJ ), which operates exclusively within the country, could be particularly hurt by the government’s move through the implementation of the so-called diagnosis-related group (DRG) policy, said BIMB Securities analyst Shahira Abdul Rahim. \"However, we need further clarity on the DRG system from the government to gauge the extent of its significance,” she said.\nDRG is a healthcare payment system which specifies a fixed amount based on the complexity of the case, rather than the conventional fees-for-services.\nHospitals would receive a set amount for a particular treatment — which is negotiated between the payer and the hospital beforehand — and the hospitals will have to manage their resources within that budget.\nShares of KPJ and IHH have both fallen sharply after the government said it is looking to expedite the rollout of DRG amid skyrocketing private healthcare costs and impending spike in premiums for medical insurance that have prompted public outcry.\nApplying DRG on a \"blanket rate\" basis —without accounting for factors like hospital demographics, personnel costs and the complexity of each medical case — could harm the healthcare sector, said RHB Investment Bank analyst Oong Chun Sung.\nStill, both Shahira and Oong maintained their 'overweight' outlook for the sector, citing organic capacity expansion, growing demand for elective surgeries, rising revenue from health tourism and the ageing population’s expanding healthcare needs.\nBoth also have IHH Healthcare Bhd (KL: IHH ) as their top pick for the sector for its diversified asset base that would help navigate the regulatory uncertainties in Malaysia.\nBoth IHH and KPJ have rebounded from the sharp decline on Dec 11. The much larger IHH gained 22% in 2024, while KPJ added 71%.\nA regulation on pricing could prompt hospitals to shift their drug procurement towards generic products, which could benefit pharmaceutical companies like Duopharma Biotech Bhd (KL: DPHARMA ), said Oong.\nThe Bursa Malaysia Healthcare Index, which tracks 18 stocks, including pharmaceutical and medical products companies, climbed 26% in 2024 to its highest in three years. On Dec 10, the government said it would shift towards generic drugs in its procurement as part of efforts to address medical inflation. The Ministry of Health has also been instructed to source drugs from several countries to obtain cheaper options.\nConsumer: Boost in wages, tourism to spur spending but be wary of rising costs AmBank Research sees 'patchy' consumer spending recovery. (Photo by Shahrin Yahya/The Edge) The consumer sector sees two competing themes in 2025, where stable employment and higher wages are met with rising cost of living and operating expenditures (opex) among retailers and manufacturers alike.\nOn one hand, analysts see better spending power amid Budget 2025 initiatives to raise the minimum wage and wages for civil servants, as well as expanded withdrawal options under the Employees Provident Fund (EPF) Account 3.\nThis is coupled with further improvements expected in tourism arrivals and spending after an encouraging 2024.\nFor 2025, Malaysia aims to attract 31.4 million tourists, compared with 22.5 million recorded in the first 11 months of 2024 and 20.1 million in 2023, according to Malaysia Tourism Board data.\nMeanwhile, margin compressions from higher opex due to higher salaries and material costs could weigh on prospects, while higher cost of living is seen to keep consumption in check as seen in 3Q2024, when some discretionary consumer outfits’ earnings missed expectations.\nMIDF Research, which is positive on the consumer sector, highlighted a broad downward trend in key commodities, adding that strong brands could effectively pass costs to consumers without significantly impacting demand.\nHLIB Research is also 'overweight' on the sector, partly as it expects the 5.5% year-on-year growth in September retail sales, backed by F&B and non-specialised retail stores, to provide “sustained momentum in the coming quarters”.\nHowever, the Middle East conflict is expected to continue dragging earnings for Nestlé (Malaysia) Bhd (KL: NESTLE ) and Berjaya Corp Bhd (KL: BJCORP ), it said.\nAmong analysts’ sectoral top picks are: retail group AEON Co (M) Bhd (KL: AEON ), eyewear distributor Focus Point Holdings Bhd (KL: FOCUSP ), mini mart chain operator 99 Speed Mart Retail Holdings Bhd (KL: 99SMART ), brewer Heineken Malaysia Bhd (KL: HEIM ), dairy product producer Farm Fresh Bhd (KL: FFB ), bottled drinks manufacturer Spritzer Bhd (KL: SPRITZER ), as well as poultry and frozen foods producer QL Resources Bhd (KL: QL ).\nAffin Hwang Investment Bank, which is 'neutral' on the sector, opined that recent improvements in consumer confidence have yet to translate into meaningful top-line growth for companies under its coverage.\nThat said, it projected that consumer sector earnings will increase 9.6% year-on-year in 2025, from a low base, primarily driven by consumer staples companies. “We continue to favour staples producers over retailers due to their resilient earnings and pricing power,” Affin Hwang said.\nAmBank Research sees “patchy” consumer spending recovery. “With elevated raw material prices and higher labour cost, we expect companies to start to pass on the cost to protect margins in 2025,” said the research house, which is 'neutral' on the sector.\nTech: Eyeing more AI and data centre-driven growth The outlook for Malaysia’s semiconductor and technology sectors remains mixed this year, as opportunities abound in artificial intelligence (AI) and data infrastructure, but the industry still faces intensifying challenges from macroeconomic uncertainties and geopolitical risks.\nThe pace of recovery will be varied across the value chain, with companies well positioned in AI-related supply chains likely to perform better compared to peers, MIDF Research noted, while maintaining a 'neutral' stance on the sector.\nThe outsourced semiconductor assembly and testing (OSAT) segment could face another year of tepid growth due to a slowdown in assembly and packaging (A&P) equipment sales in 2025 before picking up in 2026, analysts' reports said.\nCertain technology sub-segments, including for electrical appliances, mobile devices and the automotive sector, will also be influenced by consumer spending trends on which analysts are divided upon as economic growth prospects, inflation conditions and monetary policies remain fluid.\nThe OSAT sub-sector may encounter rising operational costs and competitive pricing pressures, particularly from Chinese players, compounded by weaker global electronics demand and a subdued recovery in China, BIMB Securities noted while downgrading its call on the sector to 'neutral'.\nThe global semiconductor market is forecast to grow by 19% in 2024 to US$627 billion and by 11.2% in 2025 to US$697 billion, driven by robust performance in the memory and logic segments, Kenanga Research noted. While providing a promising backdrop, recovery in the KL Technology Index may lag, it said.\nOn a positive note, the rise of AI-powered technologies offers significant opportunities. Malaysia’s data centre capacity is projected to double by 2025, driven by growing AI infrastructure demand. Kenanga expects local players like NationGate Holdings Bhd (KL: NATGATE ), aiming to deliver 3,000 to 5,000 AI GPU servers in 2025, and PIE Industrial Bhd (KL: PIE ), ramping up production of server switches, to benefit substantially from this expansion.\nMeanwhile, Malaysia’s IT services segment stands resilient, bolstered by diversification and technological innovation. MyEG Services Bhd (KL: MYEG ) is leveraging blockchain technology for global expansion, particularly through its integration with China’s Xing Huo national blockchain platform, while Datasonic Group Bhd (KL: DSONIC ) has secured its first overseas e-passport project in West Africa, reducing reliance on local projects, BIMB highlighted.\nBanks: No surprises expected, loan growth to drive earnings Analysts foresee no surprises in the year ahead for the banking sector in 2025, and have forecasted steady earnings growth on the back of expected continued loan growth.\nAs the US has flagged slower-than-expected interest rate cuts next year, Malaysia’s benchmark overnight policy rate is seen staying pat at 3% in 2025, providing stability on monetary policy and banking sector interest margins.\nMIDF Research, which maintained its 'positive' call on the sector, has forecasted net earnings of banks under its coverage — comprising 10 banks, including Malayan Banking Bhd (KL: MAYBANK ), Public Bank Bhd (KL: PBBANK ) and Hong Leong Bank Bhd (KL: HLBANK ) — to expand 7% year-on-year in 2025.\n“In general, we expect that: i) net interest income (NII) growth will remain robust due to stable net interest margin (NIM) and sturdy loan growth; ii) normalisation of non-interest income (NOII) growth; iii) opex to come in at a more contained level; and iv) asset quality to continue improving with no stress expected,” the research house said in its 2025 outlook report.\nIt explained the “strong” loan demand forecast for 2025 is underpinned by the continuation or commencement of major infrastructure projects and robust industrial construction demand.\nMIDF’s top picks include Maybank ('buy', target price: RM12.12), Public Bank ('buy', TP: RM5.16), and Hong Leong Bank ('buy', TP: RM22.76).\nCIMB Securities also has the banking sector on 'overweight', forecasting earnings to rise 6.4% for 2025, likewise driven by stronger NII with loan growth of 5.4% and an increase in NIM.\nCIMB’s top picks for the sector are Maybank ('buy', TP: RM11.80), AMMB Holdings Bhd (KL: AMBANK ) ('buy', TP: RM6.80) and Hong Leong Bank ('buy', TP: RM25.30).\nTouching on downside risks, RHB Research noted that NIM and credit costs — key drags on the sector's earnings growth in the past — are well managed.\nWith forecasted net profit growth of 5%-6% for 2025, RHB maintained its 'overweight' call on the sector, with its top picks being AMMB ('buy', TP: RM6.50), Alliance Bank Malaysia Bhd (KL: ABMB ) ('buy', TP: RM5.50) and CIMB Group Holdings Bhd (KL: CIMB ) ('buy', TP: RM9.25).\nAviation: Recovery to take off in 2025 amid turbulent supply chain Malaysia's aviation sector may take off with full passenger traffic recovery, even as airlines fly into turbulence in 2025 buffeted by supply chain issues, analysts said.\nPassenger traffic may grow at least 4% compared to 2019's level before the pandemic, according to MIDF Amanah Investment Bank. JPMorgan, meanwhile, expects passenger traffic to rise by Visit Malaysia Year 2026, spurred by markets such as China, India, and Southeast Asia.\n“We notice that tourist arrivals to Malaysia begin to rise in the years preceding Visit Malaysia Years,” Maybank Investment Bank said. That could benefit AirAsia X Bhd (KL: AAX ) that mostly flies abroad, while about half of its passengers carried could be foreign visitors to Malaysia, the research house said.\nThe expected rebound comes at a time when global carriers, including Malaysian airlines, are grappling with supply chain disruptions that have delayed deliveries of new aircraft. Maintenance activities have also been affected by shortages of qualified parts and rising demand for repairs.\nMalaysia aims to welcome 31.4 million foreign tourists that could generate RM125.5 billion in revenue in 2025. Margins, meanwhile, are wafer-thin, though cheaper fuel, which accounts for more than 25% of operating costs, is expected to provide some relief for airlines.\nFurther, the strengthening ringgit is also expected to benefit AirAsia X and its sister company Capital A Bhd (KL: CAPITALA ), said Maybank Investment Bank. The research house also anticipates the fleet of both AirAsia and AirAsia X to fully resume service by end-1Q2025.\nShares of Capital A rose about 20% last year. Of the 11 analysts covering Capital A, six recommend buying, three suggest selling, and two advise holding. The average TP is RM1.05, with 2025 estimates ranging from 60 sen to RM1.68.\nAirAsia X’s gain, meanwhile, was less than 7% in 2024. Only Public Investment Bank and Maybank Investment Bank cover the company, and both have the stock on a 'buy' call.\n“Demand for air travel in Malaysia is expected to have returned to pre-pandemic levels by the end of 2024, and potentially surpass these levels in 2025,” Public Investment Bank said.\nThe research house has the airlines sector on 'overweight', adding that the appreciating ringgit, lower jet fuel prices and robust air travel demand support stronger prospects ahead.\nProperty: Sustained sales momentum expected, with more aggressive launches Malaysia's residential transactions reached a decade-high of 70,520 units in 3Q2024 — with 68,552 residential transactions recorded in 3Q2024 alone. Malaysia's property sector is expected to experience strong growth in 2025, driven by rising demand for housing, a decline in property overhang, and increasing interest in industrial and residential developments.\nAffin Hwang Investment Bank has kept an 'overweight' call on the sector, as it anticipates sustained strong sales momentum, driven by more aggressive launches from property developers, particularly in the industrial and landed residential sectors.\nDevelopers with expertise in industrial projects are well positioned to capitalise on the growing demand for data centres, it said. The bank favours developers with substantial land bank designated for industrial use and those with robust recurring income streams, which provide resilience during downturns and complement the growth potential of their land bank.\nLikewise, MIDF Research remained bullish on the sector's outlook, expecting higher buying interest in 2025 due to declining property overhang and catalysts such as the Johor-Singapore Special Economic Zone (JS-SEZ) and Johor Bahru-Singapore Rapid Transit System (RTS) Link.\nRHB Research, also 'overweight' on the sector, expects value crystallisation of non-development businesses and stronger contributions from industrial developments. It also expects trade tensions to persist under a new US presidency, leading to continued foreign direct investments (FDIs) from East Asia, Europe, and possibly the US.\nMalaysia's residential transactions reached a decade-high of 70,520 units in 3Q2024 — with 68,552 residential transactions recorded in 3Q2024 alone. This reduced the property overhang to its lowest level in seven years, with residential overhang dropping to 21,968 units from 22,642 units in 2Q2024.\nAffin Hwang’s top picks are Sime Darby Property Bhd (KL: SIMEPROP ), Eco World Development Group Bhd (KL: ECOWLD ) and IOI Properties Group Bhd (KL: IOIPG ). Sime Darby Property stands out for its diversified product mix and role as a data centre asset owner, while EcoWorld offers attractive valuations at 14.5 times price-earnings ratio (PER) for the financial year ending Oct 31, 2025. IOI Properties rounds out the recommendations with its expansive property investment portfolio, Affin Hwang said.\nFor MIDF Research, the top picks are Mah Sing Group Bhd (KL: MAHSING ) and Matrix Concepts Holdings Bhd (KL: MATRIX ).\n\"We are positive about the outlook for Mah Sing as new sales will be driven by its strategy of selling affordable residential projects. Meanwhile, its JV with Bridge Data Centres at Mah Sing DC Hub @ Southville City will provide an upside to earnings growth in the long term.\n\"On the other hand, long-term prospects for Matrix Concepts are positive with strong earnings visibility from Malaysia Vision Valley 2.0 (MVV 2.0) land. MVV2.0, with total acreage of 2,382 acres and GDV (gross development value) of RM12 billion, will propel property sales and earnings growth beyond FY2027 (the financial year ending March 31, 2027). Besides, the growing earnings contribution from the healthcare division will further support earnings growth,\" the research house added.\nAutomotive: Sales set to moderate after three record years Analysts are cautious on Malaysia's automotive sector, expecting growth to moderate in 2025 after an anticipated record sales performance in 2024. They believe the industry is set to achieve 800,000 units in vehicle sales in 2024, driven by backlog orders and year-end promotions — surpassing the previous record highs of 799,731 units in 2023, and 721,177 units in 2022.\nThe dip in 2025 will be driven by rising inflation that may impact sales in the middle- to higher-end segments, and the completion of backlog clearance. Additionally, broader market dynamics, including increased competition from China's electric vehicles (EVs) and policy uncertainties, are likely to impact growth.\nMIDF Research forecasts slight contraction of a 1% year-on-year drop in total industry volume (TIV) for 2025, to 792,000 units in sales, from 2024’s 800,000, as order backlogs get cleared, coupled with uncertainties in key policies, including the rationalisation of RON95 subsidies and the rollout of the high-value goods tax.\n\"While Perodua is expected to (continue to) fulfill its pending orders in 2025, we anticipate that the market will transition to a more normalised pace after the backlog is cleared,\" said TA Securities analyst Angeline Chin Swee Tyng, who also expects car sales to slow in 2025.\nAs Chinese automakers expand their global presence, which led to an influx of Chinese-made vehicles into the Malaysian automotive market, Chin flagged that the outlook for Bermaz Auto Bhd (KL: BAUTO ) and Tan Chong Motor Holdings Bhd (KL: TCHONG ) may remain challenging in 2025.\nStill, recent Budget 2025 measures, including the minimum wage hike, EPF Account 3 withdrawals, and anticipated civil servant salary increases, may offset some of the negative impacts of inflation on consumer spending power. The additional disposable income may soften the blow of higher living costs, potentially supporting automotive sales.\nThe government's shift towards targeted fuel subsidies could also incentivise the adoption of more fuel-efficient vehicles, such as hybrids and EVs.\nTA Securities recommends Sime Darby Bhd (KL: SIME ) as its preferred stock pick in the sector, citing the industrial division's strong order book and potential earnings growth. Meanwhile, MIDF Research’s sole 'buy' for the sector is Bermaz Auto, with a TP of RM3.03.",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "positive",
    "categories": [
        "Economy, Business and Finance",
        "Science and Technology",
        "Social Issue"
    ],
    "topics": [
        "Economy, Business and Finance->financial and economic news",
        "Economy, Business and Finance->business reporting and performance",
        "Science and Technology->social sciences",
        "Science and Technology->economics"
    ],
    "ai_allow": true,
    "has_canonical": false,
    "breaking": null,
    "webz_reporter": false,
    "external_links": [],
    "external_images": [],
    "entities": {
        "persons": [
            {
                "name": "Petr",
                "sentiment": "none"
            }
        ],
        "organizations": [
            {
                "name": "Petroliam Nasional Bhd",
                "sentiment": "none"
            },
            {
                "name": "Petronas",
                "sentiment": "none"
            }
        ],
        "locations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": "e7817fdf5a39e4dccb1ab517e9a2f09b2b47cba9",
        "first_syndicated": true
    },
    "rating": null,
    "crawled": "2025-01-10T02:48:08.950+02:00",
    "updated": "2025-01-10T02:48:08.950+02:00"
}