{
    "thread": {
        "uuid": "361d58372bc314cb013cf5a8126776afb5908a26",
        "url": "https://nathanbarry.com/how-i-used-instagram-to-build-a-7000000-airbnb-business-059",
        "site_full": "nathanbarry.com",
        "site": "nathanbarry.com",
        "site_section": "https://nathanbarry.com/feed",
        "site_categories": [
            "interior_decorating",
            "desktop_publishing",
            "business",
            "marketing",
            "home_and_garden",
            "tech",
            "web_design_html"
        ],
        "section_title": "Nathan Barry",
        "title": "How I Used Instagram to Build a $7,000,000 Airbnb Business | 059",
        "title_full": "How I Used Instagram to Build a $7,000,000 Airbnb Business | 059",
        "published": "2025-01-10T00:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "main_image": "https://nathanbarry.com/wp-content/uploads/2025/01/Issac-French-1.1.jpg",
        "performance_score": 0,
        "domain_rank": 126541,
        "domain_rank_updated": "2025-01-06T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "361d58372bc314cb013cf5a8126776afb5908a26",
    "url": "https://nathanbarry.com/how-i-used-instagram-to-build-a-7000000-airbnb-business-059",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "Nathan Barry",
    "published": "2025-01-10T00:00:00.000+02:00",
    "title": "How I Used Instagram to Build a $7,000,000 Airbnb Business | 059",
    "text": "In this episode, Isaac French shares how he grew from 5,000 Instagram followers to selling his Texas micro resort for $7 million, just 18 months after opening.\nIsaac reveals his strategy for leveraging online audiences to support hospitality projects – converting social media followers into guests, email subscribers into customers, and content into major media coverage. He details his journey from restoring a historic train car in Idaho to creating destination properties that attract visitors from 40 states.\nLearn his methods for crafting viral stories, building valuable email lists, and why combining online influence with physical experiences creates exponential results.\nTimestamps:\n00:00 – Introduction\n01:10 – Building Family Businesses\n10:58 – Airbnb Account Suspension\n12:20 – Growing from 5K to 150K Followers in 15 Months\n22:24 – How to Combine Online Marketing with Physical Business\n26:29 – Using Design to Stand Out in Business\n33:05 – Business Lessons from Steve Jobs and Apple\n40:50 – How One Twitter Thread Got 20M Views\n44:00 – The Art of Writing Viral Content\n48:14 – Best Practices for Reposting Content\n49:13 – How to Convert Social Media Followers to Email Subscribers\n51:31 – Creating Successful Short Form Video Content\n56:01 – Why Transparency Builds Trust\n01:00:17 – Using Content Creation to Fund Business Growth\n01:07:59 – Closing Thoughts\nIf you enjoyed this episode, please like and subscribe, share it with your friends, and leave us a review. We read every single one.\nLearn more about The Nathan Barry Show\nFollow Nathan:\nFollow Isaac:\nFeatured in this episode:\nHighlights:\n01:17 – The Motel Patel Cartel\n13:27 – Creators on a Journey\n29:46 – Power of Good Taste\n35:13 – Lord of the Rings Quality Anecdote\n46:10 – How Nick Huber Engineers Viral Tweets\n52:54 – Getting a Deal Done with a Non-Monetary Value\n01:00:16 – Digital/Physical World Flywheel\nTranscript\n[00:00:00] Isaac French: I woke up one day and all of our listings were suspended. I just spent 2. 3 million dollars on this. It was a really bad feeling. And then 18 months after opening, 7 million exit. That’s wild.\n[00:00:12] Nathan Barry: One of the most powerful combinations in the world is when you combine online and offline. My guest today is Isaac French.\n[00:00:18] Nathan Barry: Who has done exactly this.\n[00:00:20] Isaac French: We had 5, 000 followers on Instagram. We went all in with that and built an audience of around 150, 000 people driving 80 percent direct bookings. The buyers pretty much explicitly told me the big reason that they bought it. That audience is so valuable.\n[00:00:33] Nathan Barry: How have you brought Storytelling into all of this?\n[00:00:37] Isaac French: Twitter is basically the petri dish for stories. Like if it does well there, it’s probably worth the mainstream media picking it up. We had stories published in vice, the New York post business insider, and like four or five other podcasts. So it combined probably a hundred million views as a creator.\n[00:00:54] Isaac French: I’ve done like all the hard work that the big brands can’t figure out. If you really want to maximize shareability, maximize your chance for virality, then. That’s, that’s the secret sauce.\n[00:01:10] Nathan Barry: Isaac, have you ever heard about the Motel Patel cartel?\n[00:01:15] Isaac French: I have not. It sounds familiar, but tell me.\n[00:01:17] Nathan Barry: In like the fifties and sixties, these members of the Patel family in India would pool money together and some of them, and then they would move to the United States and they would use some of that money they’d pulled together to buy a motel.\n[00:01:31] Nathan Barry: So they’d like get this little business going and most families would be like, cool, we have this and we’ll save up and do something else. but they would pay it forward to like other family members and help them move over. And then you fast forward, you know, 30, 40, 50 years, and more than half of all the motels in the United States are owned by, you know, are owned by Patels, which is just absolutely wild.\n[00:01:52] Nathan Barry: So when I look at your story and what you’ve done, I see you and your brothers doing this, basically the same thing where you’re building these projects that are so much bigger together. then what would be possible alone. So I just want to start, maybe let’s dive into an example of you doing that with your family and then we can get into Live Oak Lake and all the other amazing stuff that you’ve done.\n[00:02:16] Isaac French: I’ve always been quite entrepreneurial as have several of my siblings and you know, was starting businesses like typewriter, everything from a typewriter repair shop, like as one sourcing 1900s typewriters on eBay. figuring out how to repair them and then reselling them. I don’t know where that infatuation came from.\n[00:02:36] Isaac French: To, of course the lemonade snack stand out on our road, to a family bank where I was taking deposits for my siblings. The, the authorities had to shut that down because it was getting a little, a little out of hand. It wasn’t FDIC insured. It was not FDIC insured up to 15, but exactly. But all of those being homeschooled, being in that setting, like having animals, saving up to buy animals was so valuable because like we were learning.\n[00:03:05] Isaac French: business skills, but also like interpersonal skills and just how to be well rounded humans from, from the time we were very young. And so that naturally transitioned into the family businesses. But all that was like, little did I know was setting a very strong business foundation for me to go on. Cause I definitely didn’t realize quickly.\n[00:03:25] Isaac French: I did not want to spend my entire career in an office crunching numbers. Right. But anyway, when I was, 17 or 18, graduated high school. I had already been working summers in the construction business for three or four years, learned a ton of trades. And then I ran my first project when I was 19. So I was project managing a commercial construction project.\n[00:03:45] Isaac French: And you can imagine like the kind of sneering and raised eyebrows from the other subcontractors that I was their boss and, you know, from the building inspector and that was, it was good for me. Yep. I’ve always kind of even looked a little younger than I, and kind of sounded like that too. So, it was good to overcome all of those insecurities, but simultaneous to that, we lived in this little town called Derry, which is like 550 people, two hours from an interstate, right on the border of like the rolling wheat fields of the Palouse region, which are just beautiful, like the most productive wheat country in the world.\n[00:04:21] Isaac French: and the most expansive forested mountainous area in the lower 48. Deary sits like right at the border. And so it’s beautiful. And this town was originally a logging town, but you know, the industry had sort of moved on. Young people had moved away and there were several old brick buildings and they were just, one of them was about to collapse.\n[00:04:44] Isaac French: It would have just been sitting vacant. cars for decades. And so it wasn’t just us. We had some friends, but together we just, you know, over a few years befriended, the owner of that property as well as the other locals. Of course, like We weren’t just doing it so like, yes, we wanted to buy it eventually, but we were just trying to be good neighbors.\n[00:05:04] Isaac French: One day he was like, okay, I’m ready to sell. And he had never considered selling to anyone in like 40 years of owning it. And so we bought this old buildings, like 10, 000 square feet, huge thing about to collapse. And then came in literally as a team, my older brothers, myself, a couple of our closest friends, first structurally reinforced the whole thing.\n[00:05:25] Isaac French: poured a new concrete slab throughout the whole thing, developed a commercial kitchen. We’d never run a restaurant or a bakery, but my sister had started a little pop up stand baking. And, we had a dream to open a restaurant. And we opened up this bakery called The Pie Safe. And this was really like the first breath of fresh air in this town.\n[00:05:45] Isaac French: And, you know, probably half of a century, we were always like tackling, you know, and biting off probably more than we could chew. But the locals loved it. And within a couple of years, we had, you know, people coming there from all over like several hours away, just driving there to eat lunch there. And so that was pretty fun.\n[00:06:03] Isaac French: And that incorporated our entire family. And then it kind of flowed from there and we bought other buildings. My mom is into like quilting and fiber crafts and so she opened like this amazing old fashioned quilting shop down the street, which we also, you know, we renovated that building. We did a butcher shop that just now opened, an old mercantile, and then the best of all of that, and I’ll just end with this, it was this train car.\n[00:06:28] Isaac French: So my dad is this, train aficionado. And one day we got a call from one of our neighbors and he’s like, Hey, can you come help me shovel my barn? It’s about to collapse. It was in the winter. So he gets over there. And the first thing he sees is like this old hunk of rotting wood. And honestly, Most people probably wouldn’t have even recognized this as a train car, but he knew exactly what it was he’d already studied all the history in that area and He was I mean his eyes lit up like what in the world how in the world did this thing get here?\n[00:06:58] Isaac French: There were 20 cats living inside of it That’s not good. And so he He was like, Hey, would you ever sell this to the farmer? Sure. 3, 000. We bought it. Took us two years to find someone who would move it because it’s 61 feet long. Yeah. Oh, wow. Do you have to crane it onto something or like they used it like a, just an 18 wheeler and like a bulldozer and we had to, you know, this is North Idaho windy roads.\n[00:07:24] Isaac French: And this was in January when we finally moved it. Like the worst time, the snow’s melting, it’s muddy, but they got it over. And then this was March, no, this was like February of 2020. Well, guess what happened a couple weeks later? Yeah. The entire world shut down and everybody was cooped up. Perfect opportunity for, again, us as a family to come together.\n[00:07:43] Isaac French: And literally, my brothers and I, we went out there for four or five months as a team And top to bottom completely restored this train car and we turned it into this one of a kind stay on this piece of property we had where we, where we moved it to. Anyway, so now the guests that came to Deary had a place to stay, which was just incredible because all of these businesses together started to complement each other.\n[00:08:06] Isaac French: You know, one another, and then as a family, we were running these. So my sister’s cleaning some of them. we’re helping design and host and learning to market then. And that ended up sowing the seeds for Live Oak Lake and the other stuff. But hopefully that was a really long answer of showing you how we worked together.\n[00:08:23] Isaac French: No, but that’s exactly\n[00:08:23] Nathan Barry: what I wanted to get into because people say you should never do business with the family and there’s all these cliches and there’s probably lots of cases where, where that’s true. But I believe so much that like, if you can pull people\n[00:08:36] Isaac French: together and like achieve that together.\n[00:08:37] Isaac French: It’s going to be huge. Surround yourself with other people, find ways to partner with them. And families are just such a great opportunity. If there’s any way you can make it work. I know that sound, that’s really like counterintuitive advice, but there’s a certain level of trust that’s just built in and understanding that’s unspoken.\n[00:08:52] Isaac French: That’s unbelievably rare and valuable. If you can tap into that.\n[00:08:59] Nathan Barry: Well, the thing that I really want to talk about is the blend of like online and offline, which we’ll get to so much of that. But what was the process of building Live Oak\n[00:09:08] Isaac French: Lake? I guess first, what is Live Oak Lake? So Live Oak Lake, I had no term for it at the time, but it’s essentially what I would call a micro resort.\n[00:09:16] Isaac French: So it’s seven cabins. They’re individual cabins. But, they’re very cohesively designed, they’re all like Nordic inspired. This is in Texas. So right after the train car project, I ended up moving to Texas, where I married my wife and we settled down there. And I had this dream, a lot of it was spawned from the train car, creating this one of a kind hospitality experience that I had never experienced.\n[00:09:40] Isaac French: But it was like, This it’s the building for the audience of one right kind of phenomenon I was like, this is what I would want to stay at if I was coming to travel creating an environment to that was just Magical and transportive so I found this five acre piece of land that was just overgrown but it had this little cow pond in the middle and had these beautiful live oak trees and When I first walked on I’d been looking for like three months when I first walked on that piece of property.\n[00:10:06] Isaac French: I literally got chills. Like, I just felt this is the place. And with the help of friends and subcontractors and a local bank and family, I was able to buy that, and, in nine and a half months, design and build this seven cabin resort with Commons area and trails and just like every detail I totally geeked out on like the front everything from like the first impressions in the front gate to the You know the way that the lights were positioned and reflected on the water the way every single window and every single cabin was framing a specific view It was just a blast and We opened in January of 2022, I had broken my pelvis during the project.\n[00:10:47] Isaac French: I had built a 750, 000 spec home at the same time as the project to help fund this project because it went way over budget. Right. And, sold that, had, had done well with that. So it was a whirlwind and we opened and then two weeks later, I, woke up one day and our entire account, all of our listings on Airbnb were suspended indefinitely, no warning, no explanation.\n[00:11:12] Isaac French: So you have seven listings, seven listings, the whole account’s gone. It’s 24 years old. I just spent, I $2.3 million on this of other people’s money, and it was a really bad feeling. They say, don’t build your house on someone else’s land. I love this Now with email, and we’ll get to that because this is the perfect example of owning your audience, but I didn’t know anything about that\n[00:11:32] Isaac French: and so, I mean, I was just totally scrambling and there was no. There was no word from Airbnb on what was going on or if it would ever even come back. So long story short, found a local travel influencer, ran a giveaway for under 1, 000 that brought in 40 grand of direct bookings in a week’s time and about 5, 000 followers on Instagram from scratch, which just kind of blew my mind in every way.\n[00:11:58] Isaac French: And then we went all in with that and built an audience of around 150, 000 people in like the first 12 to 15 months. That’s wild. Driving 80 percent direct bookings, which are amazing in their own right. You make a lot more money. You, you own the, you have the email so you can retarget the guest. And through that process, I just came to absolutely be convicted.\n[00:12:20] Isaac French: I mean, the power of building an audience as a brand, as a business, As a creator, and I hadn’t done any of this in the process. Thankfully, I had taken a few pictures. People ask me now, like, what’s your number one piece of advice? What’s the one thing you do different? And the number one thing I would have done different is like, document that in and build that in public.\n[00:12:39] Isaac French: Right. Because the storytelling, is absolute gold from a, you know, from a marketing standpoint. And what I realized is like this dream of creating this, whatever you want to call it, micro resort retreat. So many people actually have that dream. I think it’s hardwired in all of us to connect and even to host and to serve and to be served.\n[00:13:00] Isaac French: And so this new genre of hospitality with the micro resort landscape hotel model. if you’re building something like that or plenty of other things that, that are interesting, you need to share that publicly. And I, I’ve always been a perfectionist, so it bothered me like, well, I don’t want to show it until it’s perfect, until it’s done.\n[00:13:18] Isaac French: But I’ve since learned just through everything I’ve done,\n[00:13:21] Nathan Barry: yeah, you have to, that’s such a huge thing. Cause everyone wants to follow a journey. Like there’s an Instagram account that I follow right now, two different ones I’m thinking about. One is this couple who are. driving the Pan America highway from, so they like flew way, way up into Alaska, you know, drove as far as the highway would take them.\n[00:13:41] Nathan Barry: And then they’re going all the way down to the tip of South America. And like, it’s a super fun journey to follow. Another one is this guy who bought a little tiny island in Finland and he is building a cabin and like this winter get or a summer getaway. So it’s like him and his girlfriend and they, you know, each video is like, Hey, we built a platform that our tent sits on, you know, the next one, they’re like, okay, we built our outhouse and now we’re building our sauna cabin.\n[00:14:09] Nathan Barry: And like. all of this stuff. And it’s just a journey. Like the, the best way to be interesting as a creator, I think, is to do interesting things offline and then just tell that journey. So you’re absolutely right. That like, you know, you can learn it worked out fine, but that was a huge mistake to not document it along the way, but only what, you know, in hindsight,\n[00:14:29] Isaac French: well, and you learn like the principles of storytelling.\n[00:14:32] Isaac French: But I think you don’t want to approach your life or your business as how can I just learn to tell stories when I’ve actually never done anything. Correct. So it actually worked in my benefit because I probably would have been distracted like trying to create content when I should have been building something.\n[00:14:46] Isaac French: But since then, it’s been, I mean, so rewarding. And even once I figured that out, something that’s been, you know, Tricky to understand is like how much personally do I show up in this content? So with live oak lake my story my wife and I together like We’re very central to the entire guest experience So I handcrafted this guest book and our welcome note and the website and the marketing It’s very much like from us personally you want the guest to feel that direct connection and that’s what big brands can do That’s why you have such that’s our opportunity as hospitality entrepreneurs and hosts You At the same time, you know, you do have to scale you want to scale to a certain point where it’s like operationally not 24 seven for you and you’ve got a team and you’ve got Automation through smart home hardware and software and but how do you and then but on the like specifically on the marketing side, how do you thread that needle of showing up personally, but also Not being Not the brand not being completely dependent on you as the founder because if you ever want to sell that If you ever want to take a break from that, what do you do?\n[00:15:57] Isaac French: And so there is a way I think where they can work together And what I would say now is if I had to do it all over again You want to have a personal brand and like, this is probably pretty basic advice, but like learning this myself, you want to have a totally separate account personally and especially on Instagram.\n[00:16:13] Isaac French: You can collab on posts now and so there’s actually zero downside of separating the account out one for your business or your product or your property, whatever it is, right? One for your personal, and people trust people, they don’t trust companies. They’ll come to trust brands and sometimes even love them, but that takes a long time before you become a Nike or an Apple or a Tesla.\n[00:16:36] Isaac French: And so your biggest asset is your unique personality, your unique story, your experience, the mistakes you make, the vulnerability that you’re willing to share. And so you’re leveraging that to build in public your property. So I would like, for instance, have posted a ton of content of the entire journey from I’ll first ideas to concept, to planning, to acquiring the property, to building it, to hosting the entire thing, from my personal account, but collaborating and tagging with and running giveaways to my brand account and build that up.\n[00:17:07] Isaac French: So you’re leveraging the one audience. And then you have two very valuable, but very distant, very separate assets. Right. And so to close the loop on Live Oak Lake, we ended up exiting to private equity. There’s a eager and hungry to buy up properties like this that especially have a brand because that’s very powerful.\n[00:17:31] Isaac French: and we, so we sold it with the brand and the email, and we’d also been building an email list and all of that. And the buyers pretty much explicitly told me, I mean, the big reason that they bought it. Yeah. The property is amazing. Cool. It’s, it’s all set up. Guests love it, but that audience is so valuable because now they’re going to take that and leverage that.\n[00:17:50] Isaac French: properties.\n[00:17:51] Nathan Barry: Right.\n[00:17:51] Isaac French: And so as a creator, I’ve done like all the hard work that the big brands can’t figure out most of them. Like how do you build this? And you know, I’ve been able to build a personal brand on the side now, but sort of like in spite of it, which has been awesome. So, so talking about Live Oak Lake.\n[00:18:09] Isaac French: Can you share some of the numbers of what you put in, what you exited for, and\n[00:18:12] Nathan Barry: all that?\n[00:18:12] Isaac French: So, 2. 3 million all in. To build it. Yep. Most of that was a construction loan from a local bank. Yep. And then some equity and some short term loans from friends and family. and then, basically 18 months after opening 7 million exit, so a million dollars per key.\n[00:18:30] Isaac French: and then what was revenue? So revenue was, you don’t\n[00:18:35] Nathan Barry: need to have\n[00:18:35] Isaac French: that\n[00:18:35] Nathan Barry: much\n[00:18:36] Isaac French: longer trailer. We have like barely 12, what’s\n[00:18:38] Nathan Barry: the three years trailer you’ve been done. You’re like,\n[00:18:41] Isaac French: 18 months. So So It was 1. 1 top line, and then about 560, 000 EBITDA before our debt. One thing that’s cool is we were able to refinance that whole property four months after finishing it and pull every drop of equity out plus 400, 000 because the appraisal was so much higher than when we built it.\n[00:19:04] Isaac French: So what did it appraise for? So it appraised for 3. 1, and we sold it for 7 only a year later, but at that 3. 1, you know, we got an 80 percent LTV loan on that, so we pulled out all of the initial 2. 3, paid off the bank, and had 400, 000 to reinvest, and had, because of cost segregation, a million dollars of, of, of lost appreciation that we could write off.\n[00:19:25] Isaac French: So it’s like, crazy how you can structure that financially. So yeah, 1. 1560 net. and the audience, I can give specific numbers, but like the audience alone was a substantial portion. So is that, you know, that’s an 8 percent cap rate. you would traditionally be buying or selling an asset like that at like a 12 percent cap rate.\n[00:19:50] Isaac French: If you use the multiple way, you know, that’s what, like a 12 X multiple 13 X multiple. And you know, traditionally it would be. Most properties, apples to apples, if you could even recreate that, would be, you know, you’d be selling that without the audience for probably like an 8x multiple, maybe 10. Okay. So that, that audience added probably millions, into the overall enterprise value.\n[00:20:13] Nathan Barry: And how many subs, like what was the Instagram audience versus email? Like, where was the audience broken down? Yeah.\n[00:20:18] Isaac French: So the Instagram was around 145 hundred and 440, a hundred and 45, 000 email was around 35, 000, which actually wasn’t that valuable because I had learned, I had just been radically experimenting with all the marketing including email.\n[00:20:33] Isaac French: I didn’t know anything about email and we acquired. Probably about half of those were organic from a pop up on our website, which was extremely high converting. We ran a giveaway basically. So it was like a rolling quarterly giver giveaway and we would get probably 50 emails a day from that. Wow. And then I had like traffic was coming from social to your website.\n[00:20:49] Isaac French: Social. And I mean, I just handled the payment with a PR campaign self generated. So I mean, went on local TV shows, found actually a, like a, a big TV show that did a little segment on it, a national like cabin show. So, and, but. Then we built out like automations for the email, so we had like a welcome sequence, a nurture to booking sequence.\n[00:21:10] Isaac French: that was entirely automated. So 10 emails would go out over, you know, two months time when someone first signed up because most people, especially if like you’re trying to acquire leads through Facebook, which we then experimented with, most people are not just going to see you cold and then just book a stay immediately.\n[00:21:27] Isaac French: Yeah. Much like they’re not going to see you through an influencer collaboration, which we did a lot of those to grow our Instagram following and just book immediately. But it’s gonna go\n[00:21:35] Nathan Barry: on their, their\n[00:21:36] Isaac French: dream\n[00:21:37] Nathan Barry: list and\n[00:21:37] Isaac French: they get on their radar, ideally with the email, but first as just a follower on social, and then you just post really great content or in the email case, we have these great, you know, sequences that introduced us as hosts introduced the property.\n[00:21:52] Isaac French: And then like a personal newsletter for the property that was sent out and then you just become top of mind and, you know, over six months when that person, then wants to take a getaway and they’re in your target area. And that’s the other thing, like with this kind of property, you want to target geographically like that two, three hour radius for the most part, right?\n[00:22:11] Isaac French: Which you have, is it like 20 million people, 22 million people within two and a half hours. And Waco is like smack dab in the middle. So right market wise, that’s a, That’s a great strategy. and, but yeah, then you just nurture them over time. And the cool thing is once they come and stay the, so getting to your like interesting question on like online versus offline, it’s all about setting expectations.\n[00:22:35] Isaac French: So from first impressions, first impressions are going to be a real on social media, maybe an email, maybe that came through an ad that we ran on Facebook to acquire leads. and so. To get their attention in the day, you know, everybody has short attention spans, you need a really great hook, you need beautiful visuals, assuming you have a beautiful property, that should be pretty easy, assuming you understand some, some storytelling elements.\n[00:22:58] Isaac French: But then, you know, you need to nurture them, but not oversell the property, because when they come, the whole point is like, this is the way I’m thinking about it. They need to arrive to the front gate and be like, wow, this is, I feel something like this is, this is cool, but not even at the front gate, be like blown away.\n[00:23:13] Isaac French: They need to like progressively drive through, pull up to their cabin. I mean everything from the messaging to the signage to everything, and walk in the door and then have that moment. And like literally this is how I was trying to think of it where it’s like takes your breath away. And countless people said this over and over.\n[00:23:33] Isaac French: Like, timing is everything here. this feels like I’m in a different world. And again, this is like a little five acre, you know, carve out in, in Texas, which isn’t that beautiful. So I think that online you can sort of first like hook people like through beautiful wild imagery. That’s just awesome. We could talk all about content, but, and then it’s like, okay, now they’re hooked.\n[00:23:55] Isaac French: Now we just need to like, Set expectations, but keep them low enough and then build, especially like once they book and they get messaging and whatnot. And ultimately, when they come on site, when they experience the handwritten note, and the guest book, and the fresh baked cookies, and the views, and the architecture, Collectively, all these things are going to add up to this unbelievable, like, wow factor, you know, magical experience.\n[00:24:21] Isaac French: And, they’re going to feel hospitality, even if it’s very low touch, which is like ultimately about the art of being cared for, caring for other people. They’re going to feel that. and when they do, they become addicted for life. So a lot of our guests, they came back three or four times a year, not at least some of them did and bringing friends and family with them.\n[00:24:41] Isaac French: Because we had been so thoughtful about how do we build this as a relationship and that ties in perfectly to owning the audience with the email because then we can retarget them and so it’s easy for them to come back the way that you’ve blended offline\n[00:24:52] Nathan Barry: online like It’s so, so powerful. Like if you were to do this entirely as an offline business, one, it would absolutely work.\n[00:25:00] Nathan Barry: Like you, you could build plenty of people have done it over time. Or if you were to build an entirely digital business, that’s quite possible as well, right? Obviously this podcast is all about people have done that, but I’m just fascinated by the blend. Like it’s a compounding effect when you, when you combine those two, you know, you’re getting exponential results, compared to like linear.\n[00:25:23] Nathan Barry: Yeah. So I’m curious, what, what lessons would you take from that, like the experiential hospitality, if you were building an entirely digital experience for, you know, let’s say that, you know, a course or, Instagram content or whatever, you know, maybe we’re talking about business or quilting or anything else, but we’re building an audience online.\n[00:25:43] Nathan Barry: How would you apply similar concepts?\n[00:25:47] Isaac French: I think that. Ultimately, there’s a great saying, do you know Hans Lori, by the way? I do. Yeah. Okay. So he’s a kick\n[00:25:53] Nathan Barry: customer.\n[00:25:54] Isaac French: Oh yeah. Yeah. That’s right. Amazing newsletter. shout out Hans. He’s incredible. He actually killed it on Instagram. followers. Yeah. In less than a year, just by being consistent with these real team.\n[00:26:06] Nathan Barry: We hosted a mastermind in Nashville.\n[00:26:08] Isaac French: Actually, he told me that you inspired him because he had just actually been let go, but from a startup that he’d been working for. And he was at this critical juncture. And he said that Nathan inspired him to go all in on his newsletter and content. And he’s become like this icon in interior design.\n[00:26:24] Isaac French: Oh, it’s amazing what\n[00:26:24] Nathan Barry: he’s\n[00:26:24] Isaac French: done. So he had this great phrase. He said, design, this is my spin on it. Design is the biggest lever that you can pull in the way other people feel in the way that you make people feel. So, this certainly applies to the, you know, the built environment, like the physical environment, brick and mortar realm, and of course it applies to the branding, to the design, to the online, to the content, to the storytelling medium.\n[00:26:50] Isaac French: So, taste is in major short supply, and taste is a broad term, but I guess if I had to define taste, I would say it’s the ability to discern, like, beauty, that’s Whether this is in, you know, music, whether this is in art, whether this is in Writing whether this is in the way that you treat people or the way people treat you You need to have like be an intentional observer see other people that you admire in the way they do things Maybe it’s fashion the way they dress and then start just like trying to follow and copy.\n[00:27:26] Isaac French: It’s almost like You know, Sam Parr talks about, he has a copy of that, which is an amazing copywriting course. And the whole concept there is like, the way that we learn things is by mimicking. And so you literally handwrite this amazing copywriting and over time that develops the skill inside of you.\n[00:27:42] Isaac French: You internalize it. You internalize it. And so taste and design are the same way. I think anyone, whether you’re creative or not, can be, can get better taste and can become a better designer. And design ultimately, like at the end of the day, is the deciding factor. Especially when you can marry and taste sort of straddles both of them in my mind, but when you can marry like the beautiful, Elements of proportion and design and this is very broad obviously I mean depends on how we’re applying it, but proportion design with a sense of hospitality, which like I said is serving other people and Everybody wants to feel that way.\n[00:28:23] Isaac French: So almost every brand have you read unreasonable hospitality? I have yeah such a great book It’s like one of my favorite books, but I think the reason that book became so popular One of the reasons he’s a great writer, but is because so many industries, so many businesses, so many people realized, okay, this concept, this core concept of being unreasonably hospitable, going out of your way, you know, he was the, he took one of, he took a great restaurant, but he made it the number one restaurant in the world.\n[00:28:53] Isaac French: For several years and went to the most crazy links, you know, yeah, we don’t even have to get into the examples, read the book, but it’s incredible to delight each and every single one of his guests and ultimately create these raving fans. And so all of these industries realized, look, we can apply the exact same principles here in acquiring, in, building relationships with and ultimately becoming better companies, better people.\n[00:29:19] Isaac French: Thank you. And the same applies to, you know, again, experiential hospitality and everything I’ve done, of course, it’s, it’s hospitality, but it’s really that marriage of like great design and fantastic hospitality, even if it’s very low touch, but where people genuinely feel cared for, where they feel empathized with.\n[00:29:39] Isaac French: And, so we’re, we’re being theoretical here, but I think those two lessons when they come together, it’s so powerful and taste encapsulates both.\n[00:29:46] Nathan Barry: Yeah, so when you’re talking about taste, it really starts with the notice and like observing things. like Clay Abra was on the show a few episodes ago and he was talking about Seth Godin.\n[00:29:57] Nathan Barry: And Seth describes what he does, you know, he says, I noticed things, right. He’s a very observant person. And so I think everyone’s like, well, how do you develop tastes? It’s like, well, start noticing things, start copying it down and be like, Hey, I read something that works. Why does it work? And like study it.\n[00:30:12] Nathan Barry: And then as you apply it to different creators, when people value design and production quality, you notice a huge, huge difference. Like, we had a customer who came out here to kit studios and his name is Mike. He’s an amazing guy. he flew out across the country to record his course here. He had an email, email list of, I think about 5, 000 people and he’d launched some things in the past to the list.\n[00:30:38] Nathan Barry: And based on those expectations, he thought I’m going to do about 15, 000 on this course launch. And. But he recorded it, you know, the, this new course and all his marketing materials here in like super high production quality, everything. He launches it and you know, he could have stayed home, bought some equipment, but like he came to the, you know, world class studios and he ended up selling 50, 000 worth of course, not 15.\n[00:31:05] Nathan Barry: And I think that that taste really matters. Another example is I came across this Instagram account the other day, they had like 600, 000 followers. They’re called the sensory sisters. So these two women who talk about, like, kids with sensory processing issues and how you teach them to speak and, you know, all of these like early childhood development type stuff.\n[00:31:27] Nathan Barry: And lots of people talk about that. The barrier to entry is very, very low, right? But everything they do looks so good. You like pull it up and you know, their video production is fantastic. What’s happening behind the scenes, like all of this, you’re just like, you know, They have taste and there’s quality in it.\n[00:31:45] Nathan Barry: And I think that even in this world where content is becoming crowded, you can still stand out when you’re like, look, I’m going to bring this level of quality to everything.\n[00:31:53] Isaac French: You know, as AI is rapidly dominating so many art forms, whether that’s writing or now video, audio, people are so worried. Content creators are worried.\n[00:32:05] Isaac French: I’ve, I’ve seen this online and yet. I think that one thing AI is not going to be able to do for a very long time, this is my prediction. I may be completely wrong, but is ultimately have that sense of taste. Like they can recreate the Mona Lisa. They can recreate, you know, Steve Jobs. They can recreate so many things, but it’s, I don’t know, it’s really hard to articulate, but it’s that.\n[00:32:29] Isaac French: sense of beauty and proportion that, and ultimately in like a generative capacity that, you know, whether it’s writing, you can get the best trained model in the world and you can say, Hey, right, such and such a thing. And I, at least I haven’t seen this and I don’t think we’re going to see this. We’re not going to see a finished product that is anywhere close in my opinion, in terms of the soul, in terms of the overarching beauty.\n[00:32:53] Isaac French: Right. And the ability to move someone else as what, you know, an incredible author could do. So taste is something that cannot be outsourced to AI. I think you should use AI as a tool in some of these ways. But I think it goes back to as well just, we’re talking so much about beauty and design and really a pursuit of excellence, I would say, in everything that you do.\n[00:33:15] Isaac French: And this is for me like become a guiding principle for me. Like I, everything that I touch, I want to, I want to do well. I may not be. Like, an expert at, you know, more than three or four things, but whatever I do, I want it, I want it to be really, really well. And there’s this quote, I read it in James Clear’s newsletter the other day, and I love this.\n[00:33:34] Isaac French: So, is it Jim Simmons, Jim Simons, he was like a mathematician investor. I think he actually just passed away recently, but he actually, James is quoting Jim. He says, be guided by beauty. I really mean that. I think pretty much everything I’ve done has had an aesthetic component, at least to me. This guy’s a mathematician.\n[00:33:54] Isaac French: Now you might think building a company that’s trading, that’s trading bonds. What’s so aesthetic about that? What’s aesthetic about it is doing it right, getting the right kind of people, approaching the problem, and doing it right. And if you feel that you’re the first one to do it right, that’s a terrific feeling.\n[00:34:10] Isaac French: It’s a beautiful thing to do something right. I know it’s sort of tangentially related, but I think having that really sense of care at the end of the day in everything that you’re doing, I think Steve Jobs actually is the one who talked about when he was designing one of the original, Macs that like the way that they built the, the motherboard or whatever it was, like basically the back end of the computer had to be perfect.\n[00:34:34] Isaac French: Like he was a maniacal about these little details. But what it did is I think that translated, it infused the entire product, it infused the team, the entire culture around that, and ultimately the brand with this incredible sense of pride, of excellence, and a sense of taste. Like Steve Jobs had pretty great taste.\n[00:34:53] Isaac French: And so, anyway, I think there’s a lot there that can be used and applied, whether it’s content creation, whether you’re a real estate developer, whether you’re an author, an artist, a filmmaker, so many different ways we can apply that. Those\n[00:35:07] Nathan Barry: standards. are noticed. Even if people don’t understand why something is so great, they notice that it’s great.\n[00:35:13] Nathan Barry: Did you ever watch the behind the scenes for the Lord of the Rings? Like the extended, I was the kid who at 12 years old had read Lord of the Rings cover to cover like three times and all of that. So I loved it. But have you ever watched the behind the scenes footage so that each movie is three hours long and then they have an extended edition and they have like another six hours of content that they released of how they made the movies and all of this.\n[00:35:38] Nathan Barry: And there’s this moment where, Bernard Hill, who’s the actor who plays one of the Kings, King Theoden, he’s talking about the armor. that he went to put on. And what a workshop is this, you know, movie production events, thing that was basically founded to create the Lord of the Rings movies. And they were such craftsmen, you know, they made like thousands of pieces of chain mail and all this armor and all this crazy, crazy stuff.\n[00:36:05] Nathan Barry: But Bernard Hill talks about the armor they made for him and how impressive it was. And it was not a movie prop. Like it was real in every way. He goes to put it on in the inside of the breastplate. Is engraved with like the things that a actual king in this mythology, mythological world would have. And he’s like looking at this and going, no one is ever, there’s no shot of like, no one is ever going to see it.\n[00:36:31] Nathan Barry: And the guys at what a workshop were like, look, you’re giving everything you have as an actor to like bring this character to life in a, in a huge way. And like, we need to do our part. I had, you know, Steve Jobs has this thing where he talked about like finishing the back of a dresser. Nobody ever sees it.\n[00:36:51] Nathan Barry: Yeah. And actually I had a dresser custom made. it was for my wife, Hillary for her birthday, I don’t know, 10 years ago or something. It’s this beautiful piece, like African mahogany. Like they absolutely nailed it. And I was really disappointed Because they didn’t finish the book. And I remember saying like, Oh, you didn’t, you know, I like, I’m not a confrontational person in any way.\n[00:37:13] Nathan Barry: So I was like, Oh, you didn’t finish the back. And they’re like, no, why would you, why would you ever do that? And I had it so locked into my head from the Steve jobs quote and this like Bernard Hill talking about, you know, this breastplate that I was like, Will you always finish to the back? And I think that’s what you’ve been your approach.\n[00:37:30] Nathan Barry: That’s\n[00:37:31] Isaac French: a fantastic story. Yeah.\n[00:37:33] Nathan Barry: And so just that level of detail and that’s the\n[00:37:35] Isaac French: opportunity for people. If you’re a woodworker, it doesn’t matter what you’re doing. 95 percent of people just It’s that 80 20 rule. They don’t want to spend the extra 20 percent effort or time or money, but they don’t realize that that extra 20 percent yields 80 percent or 800 percent more value, impression, and ultimately, like, sense of pride for the person creating.\n[00:37:58] Isaac French: That, that to me has been revolutionary because if people just did like a little less but spent a little more, like one of my favorite sayings when people ask about like, again, going back to the micro resort thing, how do you build it? Like what’s the secret? There’s so many elements to try to tell them.\n[00:38:12] Isaac French: But like one thing, one way that I like to boil this down and I think it makes this point well is here’s my advice in six words to build a wildly successful micro resort. Okay. You ready? Yep. Build less units, spend more money. That’s way oversimplified, but. If people would just like, that sounds counterintuitive, it’s like, oh, no, no, no, I want to get more.\n[00:38:33] Isaac French: I want to do. Right. If we had 20 doors or 50 doors. It’d be. It’s like an American thing. It’s a Texan thing. Yeah. Bigger is better. Bigger is better. It’s like, no, no, no. Just like shave down a little bit of what you’re focusing on here, but do it excellently. And the results are. You know so many times better and that’s our opportunity as creators as business owners because customers like you said will notice They may not be able to articulate it They may not be able to pinpoint what it is, but they will sense that care and that passion that you have for it\n[00:39:04] Nathan Barry: I love that something that you’ve done so well is the storytelling And one thing that I, I actually thought that when you first started dropping these threads on X, I thought that you were almost doing it in real time, like project finished.\n[00:39:16] Nathan Barry: I didn’t realize, you know, until a few threads in there, I was like, Oh no, this happened, you know, you know, a few years ago. And you’re, you’re like telling the stories, how have you brought storytelling into all of this? And then what, like, what has come from that?\n[00:39:31] Isaac French: Yeah. Yeah. I think I took a lot of it for granted because for, you know, I was on Twitter X for two years without sharing any of these stories that we talked about earlier as far as the town of Deary and some of our projects.\n[00:39:42] Isaac French: And I shared a lot about Live Oak Lake, which was great. But then I was like, okay, I’m kind of, you know, becoming a clinging symbol. It’s talking about the same thing. Oh, like you’ve, you’ve now. You\n[00:39:52] Nathan Barry: built Live Oak\n[00:39:53] Isaac French: Lake, you talked, told the whole story, you’ve sold it, sold it, and then it was like, okay, now where do I go from here?\n[00:39:59] Isaac French: I have a lot going on. I mean, I, it’s not that I, I think as a creator, you always wonder like, what are the fences as far as what I talk about too? Cause we’re all, at least I’m, you know, again, very curious and very interested and involved in a lot of different things. And so I just thought, well, Okay, this experiential hospitality tagline I keep going going on.\n[00:40:19] Isaac French: Oh, I guess that sort of is Kind of what was going on in Deary and maybe that was actually kind of what shaped me And so maybe I should re examine some of that. So it’s sometimes like the most obvious things in retrospect You know in the moment, they don’t seem obvious. So it’s helpful just to take a step back I actually think that like selling Live Oak Lake and having actually took like an eight month break from Twitter and social media and And That was actually very helpful as a creator just to recharge, you know, sometimes you just need some, some white space there, cut the noise.\n[00:40:50] Isaac French: But I got back on and made this thread about the train car, which kind of was the first one and 20 million people saw that in like two days. and like Brian Chesky, the CEO of Airbnb was interacting and Paul Graham and all these crazy people. There were so many people.\n[00:41:05] Nathan Barry: It was so funny because like you came to Crafted Commerce a few years ago, like, you know, you know, I, I’ve known you for a few years and so like you would put out great content and I, so I saw it and it was like, oh yeah, oh, that’s a cool story.\n[00:41:17] Nathan Barry: I read, read the whole thing to the end and then it was like 24 hours later I saw the thread again and maybe it was like Brian Chesky or Paul Graham or someone on that level sharing it. And it was just like. Oh, whoa. This is, this has spread to a ridiculous level. So the\n[00:41:33] Isaac French: story behind that was awesome though, because kind of to illustrate the earlier point, you know, you get lucky with social media, obviously, so no one can predict fight reality, but you can perfect your skills.\n[00:41:44] Isaac French: Right. So I realized like a couple months before this, I need to learn storytelling because I’m not a great storyteller. I mean, I wouldn’t consider myself maybe average. And so I just started like voraciously consuming books and podcasts. there’s a great podcast that Sean Perry does with David Perel on storytelling.\n[00:42:03] Isaac French: And really the, my favorite resource here was this interview that, Aaron Sorkin did at the Aspen Institute, you know, so one of like the greatest screenwriters and he talked about storytelling and. It really just like pumped me up and this, this idea that you can like move people so much just with the power of words and, and really less is more, but learning like, again, like having a sense of taste, learning what to say and how to say it.\n[00:42:28] Isaac French: And so I was like, okay, I’m going to really try this. And so I, the, the threat on the train car was one of the first things that I did, but it took me eight hours to write that. And I stayed up like almost all night. So again, like having a sense of like, I am going to get this right because I, every character mattered, every word mattered.\n[00:42:44] Isaac French: And the way that like, I was trying to tie, you know, little threads at the beginning and was into the ending. And there’s just all these little elements that go into a great story to where, first of all, you need to hook them. So they got to read it. And then once they get to the end, they have that payoff, that sense of, wow, that was amazing.\n[00:43:02] Isaac French: I’m going to share that. That’s, that’s the secret sauce, you know, very, very boiled down. but what’s funny is It’s a great story. I used visuals, which is, you know, always helpful as well. Well, on that, something that you said to me earlier,\n[00:43:15] Nathan Barry: when we were hanging out assembling furniture earlier today is about the importance of visuals on a platform like X that is not, you know, it’s by default text based.\n[00:43:25] Nathan Barry: They’ve made it much more like picture and video focused recently. But when you come out with, I think two things that make a huge difference. One is a real life story. That’s you. Right? Can’t be written by AI. It’s not copy and pasted from Wikipedia. It’s like, here is something that I did, or I had firsthand.\n[00:43:44] Nathan Barry: knowledge or experience of and the second thing is and here’s the visual journey that you can follow Here’s these beautiful photos And so it’s not just the text or the headline Like you get to hook them with so much more\n[00:43:54] Isaac French: the idea is you’re storytelling through two mediums at the same time And there’s a compounding effect.\n[00:44:00] Isaac French: So you’ve got like the text which needs to be bulletproof So like I always write the script without even really thinking. Sometimes I’ll think about like the first image, but I know all along that my visual hook needs to be absolutely as powerful as my text hook. Okay. And so in this case, it was two photos that I chose side by side.\n[00:44:18] Isaac French: And I literally, like, had to tweak one in, like, Photoshop to get it lined up just right so that the train car appears the exact same position. It’s like the, it’s kind of like the thumbnail thing with YouTube. And one of them, it’s like this decrepit, old, barely recognizable hunk of wood. And the other one, it’s like magical hour at night, completely restored.\n[00:44:37] Isaac French: I mean, like, wow, what, what exactly happened? So people love transformation stories. So you\n[00:44:42] Nathan Barry: told a transformation story in one second.\n[00:44:44] Isaac French: Yeah, right there. And then you’re like, click to see more. What was crazy about that particular one? I didn’t realize at the time how, how provocative this would be, but I said, my dad bought this, you know, hundred year old train car for 2, 000.\n[00:45:01] Isaac French: It was a cat infested wreck. And you know, then we, my brothers and I restored it for X amount of money. this is what it looks like today. Here’s what we did, you know, something like that. But that line, it was a cat infested wreck. I’m on the record saying, I actually love cats. I am not a cat hater, despite what tens of thousands of people on the internet think about that word, especially infested.\n[00:45:22] Isaac French: Like the way I got lucky choosing that because you would not, I got hundreds of comments. What in the world does cat infested mean? You know, the cats were the landlords here and they should have kicked you out. I have never seen, you know, the vast majority of people were like, the takeaway was not the cats.\n[00:45:37] Isaac French: It was, this is an amazing story, but there were just enough people, especially in that early two or three hours of the, of the history of the lifetime of that tweet on the algorithm that they just poured jet fuel on the fire there. And I mean, cause comments are so important for the X algorithm. And there were literally hundreds of comments about the cats.\n[00:45:55] Isaac French: What happened to the cats? What happened? And it also made them read the entire thing, which was like, you know, Right. 700 words. Because they’re determined to find out what you did with the cats. They’re like, yeah, yeah, exactly. And so that ended up being like a, a\n[00:46:06] Nathan Barry: nice little, cherry on top. That’s an interesting thing of having these two audiences.\n[00:46:10] Nathan Barry: Like Nick Huber is someone who’s a master at this. Because what he’ll do is he’ll write some perfectly engineered post about how he hired, you know, 20 people in the Philippines at 6 an hour to run his business. And he’ll have just a little bit of a hook that’s going to piss off one demographic. Like, I can’t believe you’re outsourcing jobs overseas or whatever else.\n[00:46:38] Nathan Barry: But it has the, the meat of it is all about, Like, an entrepreneur is going to be like, actually I’m having a terrible time hiring right now. Like, and it’s a win win for those. Oh yeah. It’s fantastic. Right. and so they’re going to be like, Oh, what’s happening? So he gets this little bit of, of rage that he’s not like, Oh, actually he’s stirring the pot.\n[00:46:58] Nathan Barry: You, you’re like, he stirs the pot a little more than I do. You\n[00:47:02] Isaac French: have two\n[00:47:02] Nathan Barry: words. He’s a\n[00:47:02] Isaac French: master of it. Like\n[00:47:04] Nathan Barry: what? And so they’ll amplify all of this and then people like one group will be like, that’s horrible. And then people will never apply a whole bunch. And another group will be like, Honestly, I could really use some help to run my business, you know, and so they’ll click through and they’ll, you know, use his business somewhere to hire those people.\n[00:47:18] Nathan Barry: And, you know, and so he’s just making hundreds of thousands of dollars off of this, but it’s finding something that upsets just that certain, yeah, it polarizes.\n[00:47:27] Isaac French: Yeah. Yeah. And, and the first group doesn’t matter. Like, you know, people take this too far. I think sometimes they’ll say things that are factually incorrect or, or worse on purpose just because they want people to chime in, in the comments.\n[00:47:43] Isaac French: I don’t know. I’m not here to judge other people. Everybody has a different standard. I did an engineer that way that tweet on purpose because most of my threads are actually not as polarized. All of your stuff is just like stories kind of thing. But I have reposted a few of like my, so in the last like three or four months, it’s been crazy.\n[00:48:01] Isaac French: I mean, I’ve doubled my following and pretty much every thread has popped off and I haven’t reposted any of those because those were all in the last three or four months. But then before that I had probably like four or five threads that did really well. And. I think in all those cases, I reposted them within about 10 to 12 months once, but I’ve seen other people doing this like three times, four times, and every time they do it and both times that I did it, they did exactly what you said.\n[00:48:27] Isaac French: They popped up. You just don’t want to do it too much. Do you have any thoughts on like the frequency? Yeah.\n[00:48:31] Nathan Barry: Some people do it as often as 90 days. I think that’s too often. so the correct answer is somewhere between once a year and 90 days. So like, if you’re waiting more than a year, like you have this amazing asset, like put it out in the world, and then anything more often than 90 days.\n[00:48:49] Nathan Barry: And it’s like, dude, we just saw this. So, I do six to 12 months is, you know, right where I’m at. cause the other thing is you can build up a library of all of this. And if you got to the point that you had 50 great threads that you built up over four years or something, you could recycle them. And you could never write a new original word and still\n[00:49:10] Isaac French: grow your audience like crazy.\n[00:49:11] Isaac French: So here’s the, here’s the fun part for me. This is where it really gets fun. I start on Twitter. which I absolutely recommend and love because it teaches you to write so concisely, which is something I didn’t know how to do previously and teaches you storytelling. If, if you want to learn it, then I transitioned to email, which is by far my most valuable channel.\n[00:49:29] Isaac French: And I, we could talk all about like, suffice it to say, like, there’s such an art to figuring out how to convert those eyeballs that you’re getting for free to a newsletter and give it, you know, whether it’s some kind of work. Ideally, you want some kind of seamlessly integrating lead magnet. Like you’re telling a story and it’s like, Hey, I’m going to break down exactly how much they spent X, Y, and Z, or exactly how such and such happened particular to this story in Monday’s newsletter.\n[00:49:55] Isaac French: And then that’s like, you know, it’s not just sign up for my free this or sign up for my newsletter where I talk about X. They’ve invested their energy and their time, their attention into a story. And then you’re promising in another benefit, another layer of benefits of results. Like\n[00:50:10] Nathan Barry: a version of this is you could say, Hey, we restored this, this whole train car and everything like that.\n[00:50:16] Nathan Barry: Here’s the story that I can tell it, you know, tell a great story about it on, on X. And then you could say, if you want to see the financials\n[00:50:22] Isaac French: behind it,\n[00:50:23] Nathan Barry: everything that costs, including the mistake that. It costs an extra 100, 000, I’m going to send that out in Tuesday’s email, Tuesday’s newsletter sign up here.\n[00:50:31] Nathan Barry: Right? Like that. Totally love it. You know, the, the, the bridge between one piece of content and the email sign up is like perfect.\n[00:50:38] Isaac French: The disparity between the results that would drive versus just a generic, right. You know, CDA, you know, sign up for my weekly newsletter is. Huge and especially when you’re thinking about the value when you come to understand like I have now that I’m selling Other products and like building a membership when you understand the true value of an engaged you know email subscriber like exponentially more valuable than a follower on any platform you want to obviously optimize that bottleneck right there more than anything else, right?\n[00:51:08] Isaac French: Of course, you need eyeballs at the top of the funnel Which is what we’ve been talking about, but this is like where the rubber really hits the road. So what I was saying earlier about, starting on Twitter, one of the benefits there, you learn to write, you learn to storytell. I invested so much time into these threads.\n[00:51:24] Isaac French: And now the way I look at it, that’s the heavy lifting that’s been done. I can easily convert that into so many other mediums. So short form video is A frontier I’m now tackling my first short form video just got 160, 000 views the first one I’ve ever made and it all I did was take a thread that I’d already spent so much time working the kinks out of including the visuals and then did like a green screen style and I had to boil down the script because of course you got to be even more concise than a thread and then literally just recorded it.\n[00:51:55] Isaac French: using the same visuals and that story was entirely, you know, was reaching an entirely new and much bigger platform and audience and Instagram. And, and I’m just figuring that part out, but that really excites me because when you’re talking about like a content operating system, in my mind, you want to be writing at the very top of that.\n[00:52:11] Isaac French: Cause that clarifies your thinking. Actually, I got this from you and I’ve quoted it several times. This, There’s two main buckets of writing. There’s writing that clarifies your thinking and there’s writing that amplifies your thinking. Yep. And I remember when you said it and it’s like stuck with me. And so I’m definitely like through this Twitter process been in the clarifying for the most part and as a side benefit, it’s been amplifying recently, right?\n[00:52:32] Isaac French: But I’ve been learning to tell these stories and really boil down what matters. And so that’s the heavy lifting because the story is really what’s valuable. And then it’s easy just to, you know, to do video editing, whether that’s you or you’re outsourcing that. So that’s pretty exciting.\n[00:52:45] Nathan Barry: I love examples of Getting a deal done.\n[00:52:50] Nathan Barry: This is like a total aside, but getting a deal done with like a non monetary value. So I’ll, I’ll tee it up. I have a friend of mine who, very well known creator has done, done quite well. And he bought a big piece of land and he is trying to buy up the neighboring land. So over time he wants to buy all of them.\n[00:53:10] Nathan Barry: And there’s this one that he’s been trying to buy for a long time. And, the lady is in her, I think, seventies. She’s just not interested. And then sometime, you know, he follows up every six to 12 months. And one time she mentioned that, her grandson was turning either 16 or 18 and he goes, if you’re ready to sell me the property, I’ll buy your grandson a 50, 000 truck.\n[00:53:35] Nathan Barry: And she’s like done. And like, this is a 700, 000 property. Like he would have halfway gone to 750, 000. Like it was totally. But he found something that she cared about more than like an extra 50, 000 in the purchase price. And so you have a story of, I think trying to buy one of these buildings and it was filled with cars.\n[00:53:56] Nathan Barry: Yeah. Yeah. Tell that.\n[00:53:57] Isaac French: Yeah. So I was hinting at it earlier, but this gentleman owned this, kind of keystone brick building in the town of Deary for like 40 or 50 years and countless people had tried to buy this building from him because it’s pretty valuable. It’s like at the main intersection and one of the only original ones and he would never sell it.\n[00:54:14] Isaac French: And he was like, you know, everybody has their thing. His thing was collecting old cars, but these weren’t like nice collectible cars. These were rusted out, worthless cars. There were 20 of them at least in this in this building. And so we befriended him over a process of a couple years, just trying to be a good neighbor genuinely.\n[00:54:33] Isaac French: And then that one day he called us up and he said, well, you know, I’m thinking about selling. And so as part of the negotiation, we realized that money was less of an issue to him as caring for these cars. So we preemptively offered to build him, of course, we already had the skills we were in construction to build him a shop, a covered structure, very easy for us, out at his property outside of town as part of the, you know, as part of the purchase price.\n[00:55:03] Isaac French: And that like, you know, lit his eyes up and he was so thrilled. And so that made like that we ended up, we bought the building for a very good deal. But, Again, that had such a massive value to him and I think also the fact that we cared about it enough to even suggest it But you figured out what\n[00:55:22] Nathan Barry: the actual bottleneck to the deal was and said, oh, we’ll build you A much better place\n[00:55:28] Isaac French: to store your cars and he’s eighty five plus years old He doesn’t really want to go out and coordinate a project even if he was to do that So the fact again that we took the initiative there will manage this for you will come out there and we did and then we Moved the cars for him.\n[00:55:41] Isaac French: I mean it was like a white glove service, but we got the building for a steal right, especially compared to what it’s now worth and yeah, I think that comes down to like empathizing and being willing to like being able to really again, observe and notice like, but that’s what matters. It’s like, Hey,\n[00:55:59] Nathan Barry: what is what actually matters here?\n[00:56:01] Isaac French: Yeah. The paradox of hospitality is, is that in giving You actually receive so much more in like actually turning out and doing it for the right reasons. You always get back, in my experience, like 10x everything. And I would compare that even just to this whole storytelling and sharing. I have peeled back the curtains on the finances, on the mistakes, on everything, on the lessons learned.\n[00:56:27] Isaac French: Now I do have a course, but I shared so much for free without ever selling anything. And it was a little bit scary to just open myself up on social media. But, The rewards that came from that and the connections I made, you were one of the very first have been so exponentially greater than the cost of, for me of sharing that information.\n[00:56:44] Isaac French: I tell people that all the time, like be more transparent, be vulnerable. Everybody has a different line and whatnot, but again, it’s about serving other people and you can even do it in the content that you, that you share. Oh\n[00:56:55] Nathan Barry: yeah.\n[00:56:55] Isaac French: There’s so much\n[00:56:56] Nathan Barry: of that. Okay. So. As you write these threads, like stories are incredible and you’ve gotten, what’s the combined number of views across these threads now at\n[00:57:03] Isaac French: this point?\n[00:57:04] Isaac French: about 40 million in the last four months or so.\n[00:57:07] Nathan Barry: That is absolutely wild. And then, you’re out here in Idaho, you know, where we’re recording right now in Boise because you were back in Derry to, to do an episode with, with CNBC. So here’s the\n[00:57:17] Isaac French: craziest part. I, I love this so much. Twitter, is full of journalists and producers that are lurking that don’t have a following.\n[00:57:26] Isaac French: You have no other\n[00:57:27] Nathan Barry: accounts\n[00:57:27] Isaac French: and they have like\n[00:57:28] Nathan Barry: 112\n[00:57:29] Isaac French: and they don’t even have it in their bio, most likely. And they’re simply searching for stories. So Twitter is basically the petri dish for stories. Like if it does well there, it’s probably worth the mainstream media picking it up. So when I did that train car thread in one week’s time after that, which, you 20 million views.\n[00:57:47] Isaac French: we had, well it was two weeks to publishing, within two weeks time, we had stories published in Vice, the New York Post, Daily Mail, Business Insider, McClatchy News, which is like thirty main newspapers, and like four or five other podcasts and smaller stuff. So it combined literally probably a hundred million views.\n[00:58:07] Isaac French: That story like absolutely blew up. And it all came from that, that thread. And then it still is paying dividends. A couple weeks ago I get an email from a producer at CNBC who’s like, Hey, he hadn’t seen the thread. He had seen one of those stories in Business Insider. So it’s, you know, it’s derivative.\n[00:58:23] Isaac French: It gets traded further. It’s traded. He’s like, Oh, this would make a perfect, mini documentary for CNBC. Make it, which is huge. It’s a massive YouTube channel. And it airs on cable too. So sure enough, yeah, that’s what I, that’s why I’m in Idaho. I flew up for one day. We recorded a ton of footage. He’s going to edit it down into a, like a 10 minute documentary on the town of Deary centered around the train car.\n[00:58:45] Isaac French: But all of those stories, they’re driving tours and people are coming more than ever to Deary. They’re booking stays. That makes me so happy because we made such an investment financially, effort wise, time wise, love. Yeah. into that, into that local area. But because we cared about it and now, you know, there’s the phrase, build it and they’ll come.\n[00:59:05] Isaac French: I want to modify that slightly build it share it and they’ll come right you have to have that step you’ve got to have that share it stat and now people are literally coming out of the woodwork from all over the world and like 15 different foreign countries have now booked stays there and 40 out of 50 states have are coming to the train car booked out Like 90 percent of the year.\n[00:59:24] Isaac French: So he you have is it three short term rentals in So then the other tiny part on that is while we were building the train car, the local train depot in the town of Deere that that car would have parked at like countless times came up for sale. We bought that for a song and a dance, totally renovated it.\n[00:59:42] Isaac French: And then one day, this sounds crazy, but like a month after that, my dad’s driving along in like, Bonner’s Ferry, like way North Idaho, three hours away, and sees a caboose in the trees like a few hundred yards off the side of the road, calls some people up, figures out who owns it, buys that for 8, 000. We moved that to Deerey, set that up, completely converted it to, so now we have four train stays, and then this old farmhouse in the barn that you mentioned, also nearby.\n[01:00:09] Isaac French: So five accommodations, and we’re filling them up. People are coming, I mean, Deerey is way off the beaten path. People are coming out there. So there’s a\n[01:00:17] Nathan Barry: flywheel here that’s really fascinating of the blend between digital and, the physical world. You know, you build these amazing experiences and then you tell a story of building it, which then gets people interested in it, which, you know, makes this money.\n[01:00:32] Nathan Barry: And there’s a story in that it gets more people there so that you can, you know, buy and build more. And now when someone’s coming to Deary there, the amount of money flowing into that, you know, local economy, you know, a lot of which is owned by your family is, is huge and that just compounds and you roll it into the next thing.\n[01:00:48] Nathan Barry: It’s like the, you know, the Patels with their, with their motels where they’re like, they’re taking that money and putting it into the very next thing. There’s two examples of this flywheel that I’ve seen play out on a big scale. one is, do you know Al Doan? Oh yeah. So Al and his family have the Disneyland for quilting, Hamilton, Missouri, and they’ve taken, you know what, I think it’s a 500, channel and they’ve built it.\n[01:01:14] Nathan Barry: Like, it’s just insane what they built that, you know, they have hundreds of thousands of people every year coming to Hamilton to like experience this amazing quilting. And then, and so they like, as they talk about, you know, the, the quilting and they’re buying up more restaurants and they’re building more things and they’ve turned around this in a huge way and it compounds.\n[01:01:33] Nathan Barry: But then the other one is Cerro Gordo, which is the ghost town that, I own 10 percent of. And that project would not work without content. You’re talking about what spend 1. 3 million to buy a hundred acres or 300 acres on top of a mountain in the middle of nowhere in California, it has no running water.\n[01:01:57] Nathan Barry: You have to drive seven miles up a dirt road to get there. Like it is a disaster of a project. Oh, and the main historical piece, like the hotel, you know, from the 1870s burns down, you know, it’s, you’re just like, what are you doing? But from a content perspective. As a set. It’s insane. Like Brent has built that YouTube channel to 1.\n[01:02:15] Nathan Barry: 7 million subscribers. Anytime he does something, you know, like we need to, like, we’re rebuilding this hotel and it’s just, as you can imagine, every, you know, like try to pour concrete for the foundation, 200 grand, you know, like just this, even if you could get people up, that’s, it’s ridiculous, but content pays for the entire thing.\n[01:02:33] Nathan Barry: That town is 20, 30, 000 a month in merchandise sales because people love Cerro Gordo. And so you get this, like. Reclaim history, like build this cool thing, share that story, which gives you the money to further fuel it. It’s just a virtuous cycle.\n[01:02:52] Isaac French: Yeah, I love that. There’s one other story and several of these other threads I’ve posted in the last couple months have been highlighting other of these like experiential hospitality, entrepreneurs and hosts that have created unique stays and, and landscape hotels.\n[01:03:08] Isaac French: But one of my favorites is this couple that he was a pastor of a small churches, rural Ohio. I don’t know if you saw this one. I don’t think so. They, his wife got cancer, they’re in their thirties, they go to, she has like a year’s worth of treatment. They’ve got three little kids and she finally overcomes her battle and they go to Bali for two months, to like, just, I mean, like rest and rejuvenate.\n[01:03:33] Isaac French: And they are so inspired by the hospitality speaking of in Bali. They come back to the U. S. and also just like feeling like they have a new lease on life that they want to dedicate themselves. He’s already serving in a church setting, but they want to be hosts. They want to, they want to give, themselves to hospitality.\n[01:03:49] Isaac French: So they, but they have no money. And, he’s making 40, 000 a year and literally like, I think he had like 10, 000 saved up, but almost nothing when it comes to like buying a piece of property. Right. But he starts searching. He finds a guy on Craigslist. He looks at a piece of property, it’s not the right one.\n[01:04:07] Isaac French: They drive around all day and finally the guy’s like, I got one on the property but you wouldn’t be interested in it. Classic story. They go and look. It’s this old Boy Scout lodge that had been totally abandoned. There’s so many stories like this in the middle of nowhere. And, He’s like, again, he gets like this feeling when he goes there, like this is the place, but it’s 500, 000.\n[01:04:27] Isaac French: He gets a friend to agree to like finance most of the money the day before closing the whole thing falls through. So he had to deal with a ton of adversity. Finally was able to like creatively engineer a seller note on the back end, a construction loan through a local bank, some friends and family maxed out every credit card they had and bought this place there.\n[01:04:49] Isaac French: They have great taste. They’re redoing the design. And one day. He’s, they literally decided, let’s build a little stairway down this hill behind the lodge. And it was, you know, it’s rural Ohio. There’s a lot of like hills. They’d never been down there. It was so hilly and they’re building the stairway down.\n[01:05:06] Isaac French: And all of a sudden he’s eye catches this little cliff. Like there’s just this little mini rock cliff and this light bulb just went off in his head. that should be a waterfall. So over the process of two months, they hand dig out the stone, it’s like sandstone. They add a pond liner, a heater, and a, a pump.\n[01:05:27] Isaac French: And You got to check this place out. It’s called the Cliffs at Hocking Hills. They build their own private heated swimming hole waterfall It’s unlike anything I’ve seen it cost them about 25, 000. Yeah, so it doesn’t always cost a lot money, but the content they created during that especially when it was done They list the place for 2, 100 a night and book out an entire year like 100 100 night This is a seasonal market.\n[01:05:51] Isaac French: This is like rural Ohio. And they did so well with that, that they, you know, the first year they generated so much in profit. And guess, I mean, it wasn’t like, guess where Hemming and Hine, they were, I mean, in the opening we, you have, we want to book it, I mean, immediately, they built up 600, 000 Instagram followers, 80, 000 email followers, year two, built three more bungalows on the property.\n[01:06:16] Isaac French: Same thing crazy while they’re out excavating for these these cabins. They realize oh, here’s another sandstone formation They hand dig that one out pour some concrete walls. Of course. There’s a lot of work here. I’m glossing over Put in another waterfall feature. That’s Incredible and have this other beautiful pool with a waterfall These are like key, landscape and architectural features that sell this place.\n[01:06:41] Isaac French: And they’re booking out almost a hundred percent occupancy. They plan to pass it on to their kids. They have way more demand than they can ever meet. And it’s like this cycle on steroids. It’s like They’re fulfilled as hosts because they found their calling. They’re serving other people. People feel like they’re, you know, in the coolest place on earth because it truly is amazing.\n[01:07:02] Isaac French: So I guess the, the takeaway there is like the adversity and, the sometimes even just like the, you know, relatability and, certainly the hardships. of any one of our stories can become part of the asset. If you’re creative, if you’re curious, if you’re willing to put in some good old fashioned hard work as well.\n[01:07:23] Nathan Barry: When that’s the thing, so many people on the internet are like, how do I build an audience from my living room from like without doing anything? And it’s like, if you go on a journey, if you go take on a hard problem where people are like, I don’t know if that’s going to work or that’s going to take That’s so much effort.\n[01:07:41] Nathan Barry: That’s a ridiculous thing. Rebuilding a hotel on top of a mountain in the middle of nowhere in California. Like no. Yeah. But people will talk about it. And so it’s like, if you want to build an audience, do something worth talking about. And I cannot preach that enough. Completely agree. Oh man. There’s so many things in there.\n[01:07:59] Nathan Barry: we’re gonna have to do a second episode to dive into all of the digital side of things that you’ve done, because not only are you driving a huge amount of revenue for. These in person destinations, but you’ve built your own personal brand, an email list, give like the, the 32nd teaser of some numbers and all of that from, the course launch, any of those things.\n[01:08:21] Nathan Barry: And then we’ll dive into it in a part two.\n[01:08:23] Isaac French: With an email list last year of about 1800 people, I had a 330, 000 launch. on my, masterclass that I built. And, since then, it’s continued to sell very well, and now we’ve actually built a membership, which is awesome because it’s like an elite peer group for all of these hosts.\n[01:08:41] Isaac French: So once they graduate from the masterclass program, or if they’re already operating at a high enough level, it’s pretty cool. we’ll let them in application only. But yeah, we’ve got hundreds of thousands in recurring revenue now and the high ticket masterclass. So selling online is a powerful thing.\n[01:08:55] Isaac French: That’s amazing.\n[01:08:56] Nathan Barry: So I think as we wrap up this episode, the thing that stands out to me the most is doing really interesting things, having like really emphasizing taste and design, telling the story along the way, especially the struggles and the hard parts about it. And then putting that time into find the things.\n[01:09:15] Nathan Barry: It could be things you’re doing right now today. Or it could be something you did 10 years ago, where it’s like, Oh, what are the, what are the things that I’ve experienced that maybe no one else has experienced? Right. And like, how do I tell that story? And then putting the time into craft it like you’re talking about sitting eight hours to write a thread, but then it compounds into, you know, a TV show.\n[01:09:35] Nathan Barry: Like, yeah. Yeah. All of these different things, and then really rolling it all forward, you know, both the skills, the money, the relationships into the next project that you can tell stories about.\n[01:09:47] Isaac French: Is there anything\n[01:09:47] Nathan Barry: that I missed in there?\n[01:09:48] Isaac French: No. And I guess the final thing is like, find other people, find friends, family that you can do this with.\n[01:09:54] Isaac French: It’s so much more fun, so much more fulfilling, so much easier if you’re doing this with a group of people that you love and trust. Yeah. Do life in community. Absolutely. Absolutely.\n[01:10:04] Nathan Barry: I love it. Okay. Where should people go? If they want to check out the things you’re working on, read some of these threads or subscribe to your newsletter.\n[01:10:10] Isaac French: I’m on Twitter, Instagram at Isaac French underscore, but the number one place I hope that people will go is my newsletter on kit, which I write every single week and you can sign up at Isaac J French. com. Awesome. Thanks for coming on. Thanks Nathan.\n[01:10:23] Nathan Barry: If you enjoyed this episode, go to YouTube and search the Nathan Berry show.\n[01:10:28] Nathan Barry: Then hit subscribe, and make sure to like the video and drop a comment. I’d love to hear what some of your favorite parts of the video were, and also just who else you think we should have on the show. Thank you so much for listening.",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "positive",
    "categories": [
        "Economy, Business and Finance",
        "Lifestyle and Leisure"
    ],
    "topics": [
        "Economy, Business and Finance->business strategy and marketing",
        "Economy, Business and Finance->financial and economic news",
        "Economy, Business and Finance->consumer goods",
        "Lifestyle and Leisure->lifestyle",
        "Lifestyle and Leisure->travel and tourism"
    ],
    "ai_allow": true,
    "has_canonical": false,
    "breaking": null,
    "webz_reporter": false,
    "external_links": [],
    "external_images": [],
    "entities": {
        "persons": [
            {
                "name": "Isaac",
                "sentiment": "none"
            }
        ],
        "organizations": [],
        "locations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": null,
        "first_syndicated": false
    },
    "rating": null,
    "crawled": "2025-01-10T00:19:18.814+02:00",
    "updated": "2025-01-10T00:19:18.814+02:00"
}