{
    "thread": {
        "uuid": "abf37856d122ca180f70c7703d5cb3b2128c7b40",
        "url": "https://www.livewiremarkets.com:443/wires/10-industries-and-17-stocks-poised-to-break-out-in-2025",
        "site_full": "www.livewiremarkets.com",
        "site": "livewiremarkets.com",
        "site_section": "https://www.livewiremarkets.com:443/home",
        "site_categories": [
            "financial_news",
            "finance"
        ],
        "section_title": "ASX News Daily, Investment Insights, Market Analysis | Livewire",
        "title": "10 industries and 17 stocks poised to break out in 2025",
        "title_full": "10 industries and 17 stocks poised to break out in 2025",
        "published": "2025-01-09T21:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "AU",
        "main_image": "https://www.livewiremarkets.com/rails/active_storage/representations/proxy/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMENXREE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--89ca936bb966649c81611b4d76436364ac9e3493/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdCem9MWm05eWJXRjBTU0lJY0c1bkJqb0dSVlE2RTNKbGMybDZaVjkwYjE5bWFXeHNXd2RwQW1VQ2FRSlpBUT09IiwiZXhwIjpudWxsLCJwdXIiOiJ2YXJpYXRpb24ifX0=--6b55f86a1d040769359f08b5c0d2acc07a7e1929/OS25_industries-stocks-break_Primary.jpg?t=1736467826",
        "performance_score": 0,
        "domain_rank": 149743,
        "domain_rank_updated": "2025-01-06T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "abf37856d122ca180f70c7703d5cb3b2128c7b40",
    "url": "https://www.livewiremarkets.com:443/wires/10-industries-and-17-stocks-poised-to-break-out-in-2025",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "Buy Hold Sell",
    "published": "2025-01-09T21:00:00.000+02:00",
    "title": "10 industries and 17 stocks poised to break out in 2025",
    "text": "10 industries and 17 stocks poised to break out in 2025\nMove over big tech, there are more opportunities in town.\nAfter starting 2024 with earnings downgrades for a range of sectors and a slowdown in consumer spending, it was a bumper year for a number of sectors. Consumer discretionary was one surprise winner, with well-positioned brands like JB Hi-Fi and Nick Scali taking charge. Australian banks facing into a tougher environment continued to outperform, as did the financial sector on the whole, with insurers taking advantage of higher premiums. Biotech also started to surge, as falling rates outside of Australia and a number of successful clinical trials bolstered the sector.\nOf course, the big tech companies continued to dominate and push markets to record highs - it's hard to ignore the extraordinary growth in the likes of Nvidia for example, but it's worth noting the pace of the growth seems to be moderating somewhat. With valuations at a premium in the tech sector, there are a range of other areas where fund managers are hunting for big growth. Now could be a great time to be looking at these industries and economies.\n2025 has started on a promising footing. Inflation seems to be moderating, global rates are finally falling, and there are signs of strength and improvement in a range of economies. The scene has been set for a big year in markets. Is it any wonder the experts seem decidedly bullish?\n2025 could be the year for healthcare companies to continue to really fly, the energy transition to push certain commodities to new heights and the return of manufacturing.\nAs part of Livewire’s annual Outlook Series, we recently asked 10 of Australia’s top fund managers to answer which industries, sectors or areas of the market they see the biggest growth potential in for 2025. We also asked them to name at least one stock they are using for exposure.\nOur featured fund managers include (in order of appearance):\n-\n[Sam Ruiz](/contributors/sam-ruiz), T.Rowe Price -\n[Jessica Farr-Jones](/contributors/jess-farr-jones), Regal Funds Management [Nick Guidera](/contributors/nick-guidera), Eley Griffiths Group- Elise Kennedy, Schroders\n[Lucas Goode](/contributors/lucas-goode-iml), IML[Zoe Middleton](/contributors/zoe-middleton), Platinum Asset Management[Todd Warren](/contributors/todd-warren-tribeca), Tribeca Investment Partners- Rachel Folder, Pendal Group\n- Brittany Isakka, Spheria Asset Management\n- James Barker, Ellerston Capital\nNote: The information provided is not intended to be a recommendation and is offered in the spirit of the Outlook Series. None of the fund managers invest in a single industry or theme; they incorporate these within a broader diversified portfolio where they adjust exposures over time based on their analysis of activity and stocks. Please do your own research and seek advice from a professional before making any investment decisions. Past performance is not a reliable indicator of future returns.\nYou can watch the video by clicking the player, listen to the podcast, or read an edited transcript below. These interviews were filmed on Tuesday, 10 December 2024.\nEdited transcript\nSector: Industrials\nStock: Old Dominion Freight ([NASDAQ: ODFL](/stock_codes/nasdaq-odfl))\nChris Conway: Sam, we've seen a few industries break out in 2024. What's an industry that you think is set for a breakout in 2025 and is there a stock that captures that trend?\nSam Ruiz: An industry that we really like is actually Industrials, particularly in the US. The US economy, we all hear about this soft landing, but we've actually had a recession in manufacturing in the US for around two years.\nSo the PMI has actually been negative 24 out of the last 25 months, so below 50. We think we're on the cusp now, particularly with the Republican administration, of that reaccelerating next year.\nA company we really like is actually not very sexy. It's a company called Old Dominion Freight. They actually fill up semi-trailers with everyone's orders and ship them around the US. But this is a company that is one of the leaders in what they do. They've actually been buying capacity as the industry has been shrinking, so very little competition. They've invested more in tech and their service generally is better so they can charge customers more. And we just think for freight and general activity in the US reaccelerating next year, this is a company that's going to reaccelerate back to a very durable growth rate after a pretty challenged couple of years.\nSector: Biotechnology\nStock: Opthea ([ASX: OPT](https://www.marketindex.com.au/asx/opt))\nJessica Farr-Jones: Obviously one of the big winners of the 2020-2021 bull run was the biotech sector.\nThis is your classic long duration risk on sector because its constituents are often investing a lot of money into trials long dated trials in the hope that if they are successful, they will result in long dated future cash flows.\nSo they're obviously very sensitive to interest rates and risk sentiment. We think if this current bull market can continue and broaden and interest rates will come down more next year, we think that this sector can perform well.\nThe way Regal tends to tilt is that we prefer somewhat later stage biotechs with proven efficacy signals already and near term catalysts. We think a stock that really fits the bill here is one called Opthea.\nOpthea is targeting approval for a drug which addresses eye disease called wet age-related macular degeneration or wet AMD. This has a very large addressable market. There's a million people afflicted with this disease in the US for current standard of care, but they're all very similar. So there's little differentiation between the existing standard of care and together there's about US$5 billion of sales at the moment.\nOpthea has the potential, if successful, to be co-formulated with these existing standards of care and create a blockbuster drug that improves efficacy versus the current standard of care. They had successful phase two trials in 2019. This saw the stock query rate from 50 cents to above $3, but since 2019 they've spent an enormous amount of time and money funding two phase three trials. These are due to readout in second quarter next year and mid next year.\nThis is a stock that's fully funded to one of the biggest readouts for an ASX biotech in recent years.\nSector: Non-bank financials\nStock: Australian Financial Group ([ASX: AFG](https://www.marketindex.com.au/asx/afg))\nNick Guidera: I think it's non-bank financials and the reason why I think that's really interesting is because interest rate cuts are on the horizon.\nTypically in a rate cut environment, you will see the bank's funding mix change and the funding disparity that you've seen where the banks have had a bit of an advantage in a higher interest rate environment. Plus you've had facilities in place from the Reserve Bank that have allowed cheaper credit that has now come to an end. A lot of these non-bank financials have been competing with one hand behind their back.\nWe particularly like those exposed to the mortgage market because in a lower interest rate environment you should see improved housing affordability. You should see improved housing turnover. And the stock we like in that space is AFG.\nAFG is a mortgage aggregator, that is its DNA. It provides services to a bunch of mortgage brokers. And those are part of their network. There's 3,800 mortgage brokers within their network as part of that. They don't own direct shares in these mortgage brokers, but what they do, is they provide access to technology to compliance. They provide things like BrokerEngine, which allows you to fill out your information when you're submitting your mortgage to the broker. It provides connectivity to all the banks and access to all those products. And as the banks are shutting down branches and more people looking for advice when it comes to their mortgage, they're turning to a broker to do that. Brokers are taking share and we expect that to continue in the years ahead.\nBut probably the most interesting thing about AFG, they've also got a securities business. So, not only are they going to benefit from an increase in turnover of mortgages and household formation, they'll also benefit by their products ultimately being in the consideration set. They've got a $4 billion loan book. They haven't had a whole bunch of losses. I think they've had none in the last 12 to 18 months, but I think they're pretty well positioned.\nSector: Pathology\nStocks: Sonic Healthcare ([ASX: SHL](https://www.marketindex.com.au/asx/shl)), Australian Clinical Labs ([ASX: ACL](https://www.marketindex.com.au/asx/acl)) and Healius ([ASX: HLS](https://www.marketindex.com.au/asx/hls))\nElise Kennedy: I believe that it's pathology names and key standouts. There is both Sonic Healthcare and potentially ACL as well.\nNow why I say that is, predominantly the industry has returned to normal and realised growth levels of 4-6%. You're also now starting to see some rationalisation when it comes to the labour base post covid.\nThat's 50% of the base there. Then you've also seen as well some of the rents that they were growing just by clinics that's starting to also be rationalised. And then, you've always got the potential M&A component if that does come through.\nSo some of the players there, Healius is now in a net cash position whether or not they do buybacks but ex- the business on that side; you've got a new competitor 4Cyte. So a combination of things that might come to fruition in the next year.\nSector: Defence\nStock: Austal ([ASX: ASB](https://www.marketindex.com.au/asx/asb))\nLucas Goode: One that we really like heading into 2025 is Defence.\nClearly the world is becoming a more dangerous and unstable place. Geopolitical tensions may not be great for humanity, certainly not great for government budgets, but all that increased military spending is great for defence contractors. And the best example out in the ASX is Austal. It's a naval ship builder operations in the US and Australia.\nI think what often gets missed with Austal is this is a crucial part of both companies, military, industrial bases. And we saw that earlier this year when the US Department of Defence gave Austal US$450 million - that's more than half the company's market cap - to build a new facility in Alabama to construct modules for nuclear subs. That's how important this shipyard is to the US government.\nMeanwhile, in Australia, the Australian government effectively appointed Austal as their sole source shipbuilder for smaller and medium sized naval boats.\nWe think they're going to have an order book approaching $30 billion by the end of next year, and yet the company trades at a material discount to its net asset backing. I mean it's just a clear mispricing to us. We think it's one of the best opportunities on the ASX.\nTheme: Health and wellbeing\nStocks: Haleon (LON: HLN), Galderma (SW: GALD), Puma (ETR: PUM), Amer Sports (NYSE: AS)\nZoe Middleton: This is more of a theme that is a breakout theme. It's been going on for a while. I think it will continue in 2025. And it has implications for a number of industries within the consumer space and that's the growing consumer interest in health and wellbeing.\nThis is something I think that's been spun out of covid and stressed healthcare systems that is making consumers want to take a more proactive approach with their health and also embrace a more active lifestyle.\nWe're also seeing a bit of a blur between beauty and health, and that's showing up in more consumers seeking medical advice or treatments for cosmetic issues.\nWe have a number of stocks that we think are well placed to benefit from this trend. We have Haleon, which is a consumer healthcare company that owns household names like Dyne and Centrum; Galderma, which is a dermatology company and that develops therapeutics, injectable aesthetic products and over the counter skincare brands like Cetaphil. And then in the sportswear space we own Puma, which is getting a bit of traction with their speed cat sneaker and some recent collaborations and Amer Sports which owns a portfolio of outdoor and sportswear brands, including some fast growing challenger brands like Arc'teryx and Solomon.\nSector: Commodities: Uranium, Copper and Aluminium\nStocks: Boss Energy ([ASX: BOE](https://www.marketindex.com.au/asx/boe)), Cameco Corp ([NYSE: CCJ](/stock_codes/nyse-ccj)) and Capstone Copper ([ASX: CSC](https://www.marketindex.com.au/asx/csc))\nJames Marlay: Uranium. It had a little bit of a breakout this year. What's the view on the underlying commodity there?\nTodd Warren: Look, we are huge bulls on uranium. Obviously the nuclear energy thematic is really starting to get a bit of a tailwind albeit, not necessarily in Australia just yet.\nBut the reality is that governments and companies around the world are realising that, in terms of a carbon friendly, carbon free power generation source, nuclear is such a great base load source of that power.\nThe other side of it, of course, is you need uranium to generate the nuclear power and we've got a situation where we've got a dramatic deficit in terms of the supply and demand balance.\nSo you want to be exposed to those pounds which are coming from, in the case of Boss Energy, Australia and the US, or in the case of Cameco, it's in Canada.\nAside from uranium, we do like copper and aluminium. Both of those commodities are very much at the forefront of the energy transition. We do need a huge amount more copper and aluminium to fuel or power the transition at a time when the supply just isn't coming.\nIn the copper space, we think a real sleep at night stock is Capstone Copper. It was primarily listed in Canada, but it's actually listed in Australia as well. Now they are growing their production through some assets in the Americas, primarily in Chile. And that will see them essentially double their production but also rapidly dele their balance sheet. They've geared up to build the new mines and we think it's one of the more attractive growth stories in the copper spectrum globally.\nTheme: Energy transition\nStock: Gentrack Group ([ASX: GTK](https://www.marketindex.com.au/asx/gtk))\nRachel Folder: I'm going with the energy transition thematic. This is a huge thematic that spans not just one industry, but it goes right through resources to construction and even software.\nWithin that software space, I think Gentrack is a really good way to play this. They offer billing software for utilities companies So they have got software which positions them really well in the market. The stock has doubled over the last 12 months, so it's performed extremely well. But I still think there's way more to go with this story, just looking at the markets that they're currently just starting in. So for example, in Asian markets, they're just starting out there and really this thematic is global. And as energy retailers transition and markets transition through smart meters over time, I think that's a big area that they can jump on the back of.\nRegion: New Zealand\nStock: Turners Automotive (NZE: TRA)\nBrittany Isakka: I think there's a lot of opportunity in the New Zealand market, which I think has been heavily unloved over the last couple of years.\nIf you look at the New Zealand economy, they've technically been in a recession for about two years. They've had rates get hiked aggressively and only in the last couple of months have they seen rates fall. The RBNZ has announced full rate cuts in July to try and stimulate the economy. And as we know when rates get cut, hopefully we should see some improvement in the economy and consumer sentiment.\nWe recently entered a name in New Zealand, Turners Automotive. They are the leading used car dealership in New Zealand and they've done a really great job.\nManagement has done a really great job growing market share in that market. We think they can grow significantly over the next couple of years supported by further store rollout.\nThey're rolling out a retail channel and trying to drive sales through that retail channel versus wholesale, which is high margin. And they're also driving ancillary services. So you think when you buy a car you need insurance and you also need finance usually. And so that's added sales and opportunity through that retail that they're driving.\nSector: Technology (small-caps)\nStock: Dropsuite ([ASX: DSE](https://www.marketindex.com.au/asx/dse))\nJames Barker: A sector that we still like into 2025 is the smaller end of the technology sector. It has had a good year this year, but we think there's further to run.\nWhat we've seen is markets have recovered off the low so investors are increasingly willing to buy into more liquid positions at the smaller end of the market. And we think the technology sector is really well placed for this into 2025 as well.\nWe're looking for companies that have been able to consistently grow revenues and actually have robust unit economics at the same time. A company that we think fits in this category is Dropsuite with the ticket DSE. Dropsuite does cloud and recovery backup services at software provider.\nWhat we really like about this business is it's the scalability of it. So they currently have a reseller channel and it's all sold through the channel. There's about 750 partners that they've got, which means it's really low sales intensity. The business has about $45 mil of IRR at the moment. And what's been interesting is they've been able to grow consecutively quarter on quarter for the last five years. Instead of banking that profitability, management have been reinvesting that into the business and really trying to enhance the product offering and develop new products as well.\nWhat we see over time is that it goes from just a cloud and recovery backup solution to really a more holistic play around compliance, security, and also recovery and backup.\nWhat's your industry set for a breakout and stock pick for 2025?\nLet us know in the comments section below.\n[following me](/sign_up?pid=8919)below and you’ll be notified every time I post a wire\n5 topics\n12 stocks mentioned\n6 contributors mentioned\n[\n](/contributors/buy-hold-sell)\nBuy Hold Sell is a weekly video series exclusive to Livewire. In each episode two fund managers give their views 'Buy, Hold or Sell' on five ASX listed companies. Not recommendations, please read the disclaimer and seek advice where appropriate.\nExpertise\n[\n](/contributors/buy-hold-sell)\nBuy Hold Sell is a weekly video series exclusive to Livewire. In each episode two fund managers give their views 'Buy, Hold or Sell' on five ASX listed companies. Not recommendations, please read the disclaimer and seek advice where appropriate.\nExpertise\nmost popular\n[Funds](/categories/funds)\n[\nYour 10 most-tipped ETFs for 2025\n](/wires/your-10-most-tipped-etfs-for-2025)\n[Equities](/categories/equities)\n[\nDogs of the ASX: did they bark or bite in 2024?\n](/wires/dogs-of-the-asx-did-they-bark-or-bite-in-2024)",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "positive",
    "categories": [
        "Economy, Business and Finance",
        "Social Issue",
        "Politics"
    ],
    "topics": [
        "Economy, Business and Finance->business strategy and marketing",
        "Economy, Business and Finance->financial and economic news",
        "Economy, Business and Finance->investment and opinion pieces",
        "Politics->political development",
        "Politics->economic policy",
        "Politics->government"
    ],
    "ai_allow": true,
    "has_canonical": false,
    "breaking": null,
    "webz_reporter": false,
    "external_links": [
        "https://www.marketindex.com.au/asx/csc",
        "https://www.marketindex.com.au/asx/opt",
        "https://www.marketindex.com.au/asx/afg",
        "https://www.marketindex.com.au/asx/gtk",
        "https://www.marketindex.com.au/asx/asb",
        "https://www.marketindex.com.au/asx/acl",
        "https://www.marketindex.com.au/asx/hls",
        "https://www.marketindex.com.au/asx/boe",
        "https://www.marketindex.com.au/asx/shl",
        "https://www.marketindex.com.au/asx/dse",
        "https://marketindex.com.au/asx/afg",
        "https://marketindex.com.au/asx/gtk",
        "https://marketindex.com.au/asx/asb",
        "https://marketindex.com.au/asx/csc",
        "https://marketindex.com.au/asx/boe",
        "https://marketindex.com.au/asx/shl",
        "https://marketindex.com.au/asx/acl",
        "https://marketindex.com.au/asx/opt",
        "https://marketindex.com.au/asx/dse",
        "https://marketindex.com.au/asx/hls"
    ],
    "external_images": [],
    "entities": {
        "persons": [
            {
                "name": "Nick Scali",
                "sentiment": "none"
            }
        ],
        "organizations": [],
        "locations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": null,
        "first_syndicated": false
    },
    "rating": null,
    "crawled": "2025-01-10T03:41:37.916+02:00",
    "updated": "2025-01-10T03:41:37.916+02:00"
}