{
    "thread": {
        "uuid": "fceff1a1dd766a02a8dcc9df8360fb630edb78f4",
        "url": "https://www.nwitimes.com/news/state-regional/business/powerball-lottery-winning-ticket-gary/article_97882bdc-cecc-11ef-b239-fbad5fa2f502.html",
        "site_full": "www.nwitimes.com",
        "site": "nwitimes.com",
        "site_section": "https://africanamericans.einnews.com:443/rss",
        "site_categories": [
            "media"
        ],
        "section_title": "African Americans News",
        "title": "$2 million winning Powerball ticket sold at Gary retailer",
        "title_full": "$2 million winning Powerball ticket sold at Gary retailer",
        "published": "2025-01-09T23:00:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "US",
        "main_image": "https://bloximages.chicago2.vip.townnews.com/nwitimes.com/content/tncms/assets/v3/editorial/9/78/97882bdc-cecc-11ef-b239-fbad5fa2f502/67803cbab461b.preview.png?crop=1088%2C571%2C12%2C0&amp;resize=1088%2C571&amp;order=crop%2Cresize",
        "performance_score": 0,
        "domain_rank": 8069,
        "domain_rank_updated": "2025-01-06T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 15,
                "comments": 0,
                "shares": 6
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "fceff1a1dd766a02a8dcc9df8360fb630edb78f4",
    "url": "https://www.nwitimes.com/news/state-regional/business/powerball-lottery-winning-ticket-gary/article_97882bdc-cecc-11ef-b239-fbad5fa2f502.html",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "Dan Carden dan.carden@nwi.com, 219-933-3357",
    "published": "2025-01-09T23:00:00.000+02:00",
    "title": "$2 million winning Powerball ticket sold at Gary retailer",
    "text": "Dan Carden Jan 9, 2025 8 hrs ago 0 One Powerball ticket sold in Gary for Wednesday's drawing matched all five white balls, missing only the red Powerball, to win $1 million — the game's second-highest prize. But because the purchaser paid $1 extra for the Powerball Power Play option, he or she actually will receive $2 million in winnings thanks to the 2X Power Play multiplier.\nProvided Facebook Twitter WhatsApp SMS Email Print Copy article link Save Dan Carden GARY — Someone who buys their Powerball lottery tickets at a family-owned discount store in Gary is set to have a spectacular new year after nearly winning the jackpot of the popular multi-state game.\nAccording to the Hoosier Lottery , one ticket sold in the Steel City for Wednesday's drawing matched all five white balls, missing only the red Powerball, to win $1 million — the game's second-highest prize.\nHowever, because the purchaser paid $1 extra for the Powerball Power Play option, he or she actually will receive $2 million in winnings thanks to the 2x Power Play multiplier.\nThe lucky ticket was sold at Brady’s This Is It, 5306 W. 25th Ave., in Gary.\nListen now and subscribe: Apple Podcasts | Google Podcasts | Spotify | Stitcher | RSS Feed | SoundStack | All Of Our Podcasts\nWednesday’s winning numbers were 1-20-36-38-43 and Powerball 24.\nPeople are also reading… Retailer to build world's largest Family Express at high-profile Von Tobel site on U.S. 30 in Schererville NWI Business Ins and Outs: Bronko’s, L Squared and Say It with a Cookie open $200 to $300 million development would bring grocery store and apartments to downtown Michigan City No one injured after structure collapse at Burns Harbor Works steel mill Lawsuit alleges Winfield, Lake County police profiled Black resident before aggressively detaining him, his family Former county official, pastor sought by feds in child molest case Northwest Indiana congressman to help direct trillions in federal spending School bus driver allegedly on heroin when arrested for OWI and neglect Cops nab hallucinogenic mushrooms, gummies in Portage Davich: Before your next surgery or hospital admission, ask these crucial questions More Region hospitals add visitor restrictions because of contagious diseases Dispensary worker busted with 11 ounces of pot in Portage New late night pop-up kitchen, The Traveler, is here to stay Next Indiana lieutenant governor says 'don't comply' with hospital mask directives Charges filed in April double homicide of local rape victim advocate and his wife The lottery recommends the ticket-holder sign and complete the information on the back, keep the ticket in a secure place, and contact Hoosier Lottery customer service at 800-955-6886 for specific claim instructions.\nThe odds of matching the five white balls without the red Powerball to win $1 million, or a Power Play multiple of it, are 1 in 11,688,054.\nThe chances of winning the Powerball jackpot — currently $263 million for Saturday's drawing — are 1 in 292 million.\nGallery: Take a virtual tour of Indiana's state parks Brown County State Park Location: Nashville\nSize: 15,776 acres (largest state park)\nOpened: 1929\nActivities: 12 hiking trails spanning 18 miles; 25 mi. of mountain biking trails; 20 horseback riding trails; hiking; birdwatching; fishing; leafing; cross-county skiing; sledding; ice fishing\nAmenities: Abe Martin Lodge and annex, 84 rooms with water park; 86 cabins; modern and primitive campgrounds\nDNR description: Nicknamed the \"Little Smokies\" because of the area's resemblance to the Great Smoky Mountains, Brown County encompasses nearly 16,000 acres of rugged hills, ridges and fog-shrouded ravines. Glaciers from the most recent ice ages stopped short of the \"hills o' Brown,\" but their meltwaters helped create the narrow ridges, steep slopes and deep gullies of Brown County State Park. Indiana's largest park is a traditional fall color hot spot, with nearly 20 miles of tree-lined roads and many scenic vistas overlooking miles of uninterrupted forestland.\nDan Carden Chain O' Lakes State Park Location: Albion\nSize: 2,718 acres\nOpened: 1960\nActivities: 13 lakes for boating, canoeing, fishing, swimming; hiking\nAmenities: Stanley Schoolhouse Nature Center; boat rental; furnished cabins; primitive campsites\nDNR description: This is lake country and a small boater's paradise. Nine connecting lakes will be the center of your adventures at Chain O'Lakes. Paddle through the chain of serene kettle lakes, hike the 10 miles of forested trails, fish the electric-motors-only lakes, stay overnight in a forested hillside family cabin, or visit the park's old one-room schoolhouse nature center. Other facilities available for visitors to enjoy include a campground, beach and picnic shelters.\nDan Carden Charlestown State Park Location: Charlestown\nSize: 5,100 acres\nOpened: 1996\nActivities: Hiking; Fishing; Picnicking; Camping; Birdwatching\nAmenities: 182 modern and primitive campsites\nDNR description: Once a largely undeveloped portion of the Indiana Army Ammunition plant, Charlestown State Park is located in southern Indiana. With scenic vistas of the Fourteenmile Creek valley and the Ohio River and elevation changes of over 200 feet, Charlestown has much to offer the visitor with its rugged hills and deep ravines. While hiking the rugged terrain you will see Devonian fossil outcrops and areas of karst sinkhole topography. Bird watchers will enjoy the 72 species of birds, including bluebirds, black vultures and an occasional bald eagle.\nDan Carden Clifty Falls State Park Location: Madison\nSize: 1,416 acres\nOpened: 1920\nActivities: Four waterfalls; hiking; swimming; picnicking; tennis\nAmenities: Clifty Inn and Restaurant; nature center\nDNR description: The park's waterfalls change moods with the weather and the seasons and can range from roaring plunges to delicate bridal-veil mists to gleaming frozen titans. Winter and spring visits reveal them at their best. The rugged splendor of Clifty Canyon offers exciting year-round hiking and scenery.\nDan Carden Falls of the Ohio State Park Location: Clarksville\nSize: 165 acres\nOpened: 1990\nActivities: Hiking; fishing; picnicking; boat launch\nAmenities: Interpretative Center\nDNR description: Meriwether Lewis and William Clark met at the Falls prior to launching the 1804 Lewis and Clark Expedition to the Pacific Ocean. The park's 386-million-year-old fossil beds are among the largest exposed Devonian fossil beds in the world. The park features a spectacular interpretive center overlooking the fossil beds that reopened in 2016 with completely new exhibits.\nDan Carden Fort Harrison State Park Location: Indianapolis\nSize: 1,700 acres\nOpened: 1996\nActivities: Hiking; bicycle trails; golf; fishing; canoeing; dog park; sledding; ice fishing; cross country skiing; recreation buildings; horseback riding\nAmenities: 18-hole golf course; inn; restaurant; saddle barn; nature shop; Museum of 20th Century Warfare\nDNR description: Landscape and history blend together at this unique setting on the northeast side of Indianapolis. The 1,700-acre park — comprising a portion of the former Fort Benjamin Harrison military base — features walking and jogging trails, picnic sites, fishing access to Fall Creek and two national historic districts. An oasis of green in an urban landscape, Fort Harrison is one of the hidden gems to be found in the state, just minutes from home for many visitors needing contact with nature.\nDan Carden Harmonie State Park Location: New Harmony\nSize: 3,465 acres\nOpened: 1996\nActivities: Hiking; bicycle trails; horseback riding; boat launch; fishing; picnicking; swimming\nAmenities: 200 modern campsites; youth tent campsites\nDNR description: Harmonie State Park is located \"on the banks of the Wabash\" and a beautiful swimming pool, shady picnic areas, ravines and pristine landscape await you here. Trails for walking, biking and nature hikes will lure you for a visit. Nearby Historic New Harmony honors two unique communities from the early 1800s. The Rappites located here in 1814. They were fleeing from religious persecution and awaiting the impending millennium. In 1824, the Owenites brought many great scientists and philosophers into the area when they purchased the Rappites' holdings.\nDan Carden Lincoln State Park Location: Lincoln City\nSize: 1,747 acres\nOpened: 1932\nActivities: Historic sites; hiking; boat launch; picnicking; swimming; fishing\nAmenities: Nature center; general store; boat rental; cabins; campsites\nDNR description: Discover the boyhood home of the 16th president of the United States, Abraham Lincoln. Among the rolling hills and thick forest, young Lincoln learned many life lessons. Lincoln State Park offers 10 miles of hiking trails, two scenic lakes, and an interpretive center to help you experience early life of settlers in southern Indiana. Tour the Colonel Jones Home, the historic home of the merchant and Civil War officer who employed young Lincoln. The Little Pigeon Creek Baptist Church and Cemetery, located on the property, is where Lincoln’s sister Sarah is buried. Sarah Lincoln Woods Nature Preserve is located in the southernmost portion of the park. A visit to Lincoln State Park is like taking a step back in time to when the land was wild and Lincoln was a boy.\nDan Carden McCormick's Creek State Park Location: Spencer\nSize: 1,924 acres\nOpened: 1916 (oldest state park)\nActivities: Hiking; horseback riding; swimming; recreation center; tennis; picnicking; caving\nAmenities: Canyon Inn; nature center; saddle barn; cabins; 221 modern and primitive campsites; youth tent camping; camp store\nDNR description: Explore the spectacular limestone canyon, flowing creek, and scenic waterfalls that highlight Indiana’s first state park. Hike trails featuring diverse forest trees, spicebush, and native wildflowers, including a trail through Wolf Cave Nature Preserve and an accessible trail at the recently renovated nature center. Experience history as you climb the fire tower, use shelter houses or cross the stone arch bridge created by the Civilian Conservation Corps, or examine the historic Statehouse Quarry near White River, which furnished limestone used for the Indianapolis Statehouse. Relax in the lobby of Canyon Inn, open to all park visitors, or watch birds from the dining room porch. Catch cultural events such as concerts in the park amphitheater or attend the several special events hosted annually at the park. McCormick’s Creek State Park offers active enjoyment through all seasons of the year.\nDan Carden Mounds State Park Location: Anderson\nSize: 252 acres\nOpened: 1930\nActivities: Historic sites; hiking; fishing; swimming; picnicking\nAmenities: Nature center; gift shop; 75 modern campsites; youth tent camping; camp store\nDNR description: Mounds State Park features 10 unique earthworks built by prehistoric Indians known as the Adena-Hopewell people. The largest earthwork, the Great Mound, is believed to have been constructed around 160 B.C. Archaeological surveys indicate the mounds were used as gathering places for religious ceremonies, from where astronomical alignments could be viewed. Naturalist-led hikes and interpretive programs are offered every weekend throughout the year.\nDan Carden O'Bannon Woods State Park Location: Corydon\nSize: 2,000 acres\nOpened: 2004\nActivities: Swimming; water slides; hiking; horseback riding; picnicking; fishing; boating;\nAmenities: Aquatic center; nature center; cabins; 353 modern and primitive campsites\nDNR description: O'Bannon Woods State Park (formerly Wyandotte Woods State Recreation Area) lies in the central and extreme southern part of the state, bordering the Ohio River. It was the location of one of the few African-American Civilian Conservation Corps units. The property also has a uniquely restored, working haypress barn, complete with oxen for power and a pioneer farmstead. Indiana’s first natural and scenic river, Blue River, flows through the state park and forest. The Corydon Capitol State Historic Site is located near the park. Visitors can learn about early Indiana history as they tour the beautiful first state capitol building, built entirely of limestone, and old town square.\nDan Carden Ouabache State Park Location: Bluffton\nSize: 1,104 acres\nOpened: 1962\nActivities: Hiking; swimming; fishing; boating; volleyball; paved bicycle trail; tennis; basketball courts; picnicking\nAmenities: Nature center; recreation center; campsites\nDNR description: Ouabache is difficult to spell, but easy to pronounce. Simply say \"Wabash\"...just like the river that forms the southwest boundary for the park. This is the French spelling of an Indian word, so don't be surprised to hear some folks call it o-ba-chee. Kunkel Lake offers excellent fishing. During the summer months, a naturalist provides information about the natural wonders of the park. A lodge recreation building is available all year.\nDan Carden Pokagon State Park Location: Angola\nSize: 1,260 acres\nOpened: 1925\nActivities: Hiking; swimming; cross country skiing; tobogganing; horseback riding; picnicking; playground; sand volleyball\nAmenities: Potawatomi Inn; nature center; toboggan run; boat rental; saddle barn; 273 modern and primitive campsites; youth tent camping; camp store\nDNR description: Being one of the state’s original parks, Pokagon features the unique work of the Civilian Conservation Corps, whose members lived and worked at Pokagon from 1934 to 1942. The “boys of the CCC” built the beautiful stone and log structures that dot the park landscape and provide accent to the rolling wooded hills, wetlands and open meadows. Natural lakes created by glaciers that melted 10,000 to 15,000 years ago, highlight Steuben County, which has more lakes than any other Indiana county. The park is framed by Lake James and Snow Lake, which offer abundant opportunities for boating, swimming, fishing and scenic sunsets. Pokagon is also Indiana State Parks’ winter wonderland, with cross-country ski rental, sledding, ice fishing and a twin-track toboggan run.\nDan Carden Potato Creek State Park Location: North Liberty\nSize: 3,840 acres\nOpened: 1977\nActivities: Biking; hiking; swimming; boating; fishing; ice fishing; cross-country skiing; wildlife observation; horseback riding; snow tubing\nAmenities: Nature center; 3.2 mile paved bike trail; 6.6 mi. mountain bike trail; recreation building; boat/bike rental; 17 cabins; 347 campsites; youth tent camping; camp store\nDNR description: Potato Creek is in north-central Indiana about 12 miles southwest of South Bend. The park features a wide array of activities and facilities for year-round enjoyment. A variety of natural habitats await, including the 327-acre Worster Lake, old fields, mature woodlands, restored prairies and diverse wetlands. Each offers unique opportunities for plant and wildlife observation. Native peoples used the area for hunting and fishing. The area’s first people of European descent settled here in the 1830s.\nDan Carden Prophetstown State Park Location: Battle Ground\nSize: 2,000 acres\nOpened: 2004 (newest state park)\nActivities: Hiking; bicycling; camping; swimming\nAmenities: 2.75 mile hiking trail; 2.4 mile bike trail; aquatic center; 110 campsites\nDNR description : Indiana’s newest state park, Prophetstown is located where the Tippecanoe River meets the Wabash near the town of Battle Ground northeast of Lafayette. The park's landscape has been shaped by ice from glaciers, moving water, fire and human hands that helped maintain the vast tall prairie grass. Native American people hunted and lived along the two rivers for thousands of years. The Aquatic Center features a 30-foot tube slide, body flume, lazy river float area, adventure channel, zero-entry pool with play features, and an aquatic activity area with basketball.\nDan Carden Shades State Park Location: Waveland\nSize: 3,082 acres\nOpened: 1947\nActivities: Hiking; fishing; picnicking; canoeing\nAmenities: Nature preserve; 123 campsites (Apr.-Oct.); youth tent camping\nDNR description: Shades State Park is that peaceful place you've sought; a favorite for hikers and canoeists. The beautiful sandstone cliffs overlooking Sugar Creek and numerous shady ravines provide the backdrop for your journey through this nature lover's paradise. Also on the property is Pine Hills Nature Preserve, which affords spectacular topography for those willing to take a fairly long hike.\nDan Carden Shakamak State Park Location: Jasonville\nSize: 1,766 acres\nOpened: 1929\nActivities: Swimming; water sliding; boating; fishing; ice fishing; hiking; picnicking; basketball; tennis\nAmenities: Nature center; aquatic center; boat launch; cabins; recreation building; boat rental; 174 campsites; youth tent camping; camp store\nDNR description: Ready to relax? Head for Shakamak. Three man-made lakes offer 400 acres of water for fishing and boating while a family aquatic center provides swimming fun. About two-thirds of the campsites are in a wooded area, offering cool shade in the summer and beautiful fall colors in autumn. Nearby is a play field area for family fun. A popular feature of the park is the group camp.\nDan Carden Spring Mill State Park Location: Mitchell\nSize: 1,358 acres\nOpened: 1927\nActivities: Historic sites; cave tours; hiking; biking; picnicking; swimming; hayrides\nAmenities: Spring Mill Inn; pioneer village; Gus Grissom memorial; boat tour; bike rental; 221 modern and primitive campsites; youth tent camping; camp store\nDNR description: Spring Mill State Park offers a powerful illustration of the link between the natural and cultural worlds. The water flowing from several cave springs led to the founding of an industrial village in the early 1800s. Pioneer entrepreneurs took advantage of a constant water source that never froze, using it to power several gristmills, a wool mill, a saw mill and a distillery. In turn, pioneer settlers shaped the landscape around the village, clearing land for agriculture and timber.\nThe park today continues to illustrate how nature shapes us and how we shape our environment. A parcel of virgin timber sits in contrast to regenerated forest, a man-made lake struggles to survive against the in-flow of silt from cave-fed systems and the native flora and fauna face challenges from man’s introduction of new species.\nVisitors can explore this story in the park’s four interpretive facilities—the Pioneer Village, Nature Center, Grissom Memorial and Twin Caves Boat Tour—and see it reflected on the landscape as they hike the trails.\nDan Carden Summit Lake State Park Location: New Castle\nSize: 2,680 acres\nOpened: 1988\nActivities: Fishing; birdwatching; swimming; ice fishing; boating; hiking; cross-country skiing; picnicking\nAmenities: Boat launch; picnic shelters; boat rental; 73 campsites; youth tent camping\nDNR description: An expansive view and good fishing beckon you to Summit Lake State Park, near New Castle. Summit Lake has an excellent bird watching and wildlife observation area. The property has always been an important area for waterfowl because of the many low-lying wet meadows and prairies. Migratory species have included rare species like the black tern, bald eagle, sandhill crane, American bittern, least bittern, king rail and osprey. Zeigler Woods, in the southwest corner of the park, is Henry County’s first nature preserve. Zeigler Woods has rich flora and fauna with little evidence of human disturbance.\nDan Carden Tippecanoe River State Park Location: Winamac\nSize: 2,761 acres\nOpened: 1943\nActivities: Canoeing; horseback riding; hiking; boating; fishing; picnicking; cross-country skiing\nAmenities: Recreation building; cabins; 178 modern and primitive campsites; youth tent camping\nDNR description: Attention canoers! Get ready for a relaxing journey as you float down the beautiful Tippecanoe River. You must bring your own canoe or make arrangements with the local canoe livery. When you return, you can enjoy the beautiful campground facilities with your group, family or friends.\nDan Carden Turkey Run State Park Location:\nMarshall\nSize:\n2,382 acres\nOpened:\n1916\nActivities:\nHiking, fishing, horseback riding, swimming, tennis, playgrounds, cultural programs\nAmenities:\nTurkey Run Inn, nature center, planetarium, saddle barn, cabins, 213 campsites, youth tent camping, camp store\nDNR description:\nYou’ll marvel at the natural geologic wonders of this beautiful park as you hike along its famous trails. Nestled along State Road 47 southwest of Crawfordsville, the park offers the chance to explore deep, sandstone ravines, walk along stands of aged forests and enjoy the scenic views along Sugar Creek. Make sure to visit the Colonel Richard Lieber Cabin, which commemorates the contributions of the father of Indiana’s state park system.\nDan Carden Versailles State Park Location: Versailles\nSize: 5,988 acres\nOpened: 1943\nActivities: Hiking; fishing; horseback riding; mountain biking; boating; swimming; picnicking; kayaking\nAmenities: Covered bridge; boat launch; boat rental; 226 modern campsites; youth tent camping; camp store\nDNR description: Take a drive through the beautiful rolling hills of southeastern Indiana with Versailles State Park, Indiana’s second-largest state park, as your destination. Numerous fossils tell the story of an ancient sea that covered the region. During the Civil War, Morgan’s Raiders made their way through the area that is now the park. The town of Versailles was briefly under Confederate control. Relax while fishing on the 230-acre lake where you can rent a rowboat, kayak or canoe. Get a workout and see the beauty of the park by taking a walk on the hiking trails or a ride on the mountain bike trails. Bring your horses for the day to enjoy the more than 20 miles of horse trails. Steps to a scenic overlook at the dam are a prime spot to see herons and other aquatic wildlife.\nDan Carden White River State Park Location: Indianapolis\nSize: 250 acres\nOpened: 1979\nActivities: Museums; sports; concerts; theaters; zoo; hiking; Segway rides; historic canal; gardening; maze; picnicking; art\nAmenities: Eiteljorg Museum of American Indians & Western Art; IMAX Theater; Indiana State Museum; Indianapolis Indians baseball at Victory Field; Indianapolis Zoo; White River Gardens; NCAA Hall of Champions; Congressional Medal of Honor Memorial; Indiana History Center; Central Canal; Military Park\nDescription: White River State Park boasts world-class attractions and destinations that offer distinctive experiences for every interest and visitor! Yes, you will find green spaces, trails, trees and waterways that you expect at any state park. In addition to nature’s wonderland, you will find cultural, educational, and recreational attractions and events in our urban getaway’s 250-acres. Located in the heart of downtown Indianapolis, White River State Park is the place you can enjoy the outdoors without ever leaving the city.\nDan Carden Whitewater Memorial State Park Location: Liberty\nSize: 1,710 acres\nOpened: 1949\nActivities: Hiking; fishing; horseback riding; boating; swimming; canoeing; picnicking; ice fishing; archery; hayrides; birdwatching\nAmenities: Marina; saddle barn; boat launches; boat rental; cabins; 318 modern and primitive campsites; youth tent camping; camp store\nDNR description: Whitewater Memorial State Park is a great family getaway because of its 200-acre Whitewater Lake, access to Brookville Reservoir and other recreational facilities. Shoreline hiking, flat-water boating, swimming, fishing and camping opportunities are abundant around the man-made lake. The access to Brookville Reservoir provides many opportunities for seeing migrating flocks of birds. Whitewater Memorial State Park boasts 9 miles of horseback riding trails with access both for day users and from the horsemen’s campground. The land for the park was originally purchased by the surrounding counties of Union, Fayette, Franklin and Wayne as a memorial to the men and women who served in World War II.\nDan Carden 0 Comments Love 0 Funny 0 Wow 0 Sad 0 Angry 0\nThe business news you need Get the latest local business news delivered FREE to your inbox weekly.\nSign up! * I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy . Dan Carden Chief Political Reporter\nAuthor email Follow Dan Carden Close Get email notifications on {{subject}} daily! Your notification has been saved. There was a problem saving your notification. {{description}}\nEmail notifications are only sent once a day, and only if there are new matching items.\nSave Manage followed notifications Close Followed notifications Please log in to use this feature Log In Don't have an account? Sign Up Today",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "positive",
    "categories": [
        "Economy, Business and Finance"
    ],
    "topics": [
        "Economy, Business and Finance->financial and economic news",
        "Economy, Business and Finance->media and entertainment industry"
    ],
    "ai_allow": false,
    "has_canonical": false,
    "breaking": null,
    "webz_reporter": false,
    "external_links": [
        "https://trinitymedia.ai/player/trinity/${id}/?pageURL=https://www.nwitimes.com/news/state-regional/business/powerball-lottery-winning-ticket-gary/article_97882bdc-cecc-11ef-b239-fbad5fa2f502.htmlpoweredBy&partner=Flex&textSelector=${text}&FAB=1`;",
        "https://open-api.spot.im/v1/messages-count?spot_id=sp_zESgsuYF&posts_ids=97882bdc-cecc-11ef-b239-fbad5fa2f502",
        "https://leeaws.com/cio/subscribe/",
        "https://open.spotify.com/show/6jx2UjMhFiQJbnoQ8z84VJ",
        "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.nwitimes.com%2Fnews%2Fstate-regional%2Fbusiness%2Fpowerball-lottery-winning-ticket-gary%2Farticle_97882bdc-cecc-11ef-b239-fbad5fa2f502.html%3Futm_medium%3Dsocial%26utm_source%3Dfacebook%26utm_campaign%3Duser-share",
        "https://www.stitcher.com/show/pennywise",
        "https://shows.audiocdn.com/s/leeenterprises/pennywise-personal-finan-857111",
        "https://linktr.ee/leepodcasts",
        "https://feed.cdnstream1.com/zjb/feed/download/13/a4/a6/13a4a67a-1da0-4149-a08f-0349d2063c56.xml",
        "https://www.google.com/podcasts?feed=aHR0cHM6Ly93d3cub21ueWNvbnRlbnQuY29tL2QvcGxheWxpc3QvMDJlM2JiYjAtOWU4Ny00ODMyLWIyOTctYWFiOTAxMTY4ZjkzLzcxZDNlMzY3LWRmYWMtNDM5NS1hYTdiLWFjYWEwMTIzMjBjMC9iOGI3ZjA2MC0wNzM2LTRlNjYtOWFiZC1hY2FhMDEyM2ZkYjcvcG9kY2FzdC5yc3M%3d",
        "https://embed.audiocdn.com/?feed=aHR0cHM6Ly9mZWVkLmNkbnN0cmVhbTEuY29tL3pqYi9mZWVkL2Rvd25sb2FkLzEzL2E0L2E2LzEzYTRhNjdhLTFkYTAtNDE0OS1hMDhmLTAzNDlkMjA2M2M1Ni54bWw=&pbg=EFEFEF&lbg=F9F9F9&pt=353D58&st=676E85&bbg=FFFFFF&bi=353D58&limit=10",
        "https://wa.me/?text=https://www.nwitimes.com/news/state-regional/business/powerball-lottery-winning-ticket-gary/article_97882bdc-cecc-11ef-b239-fbad5fa2f502.html",
        "https://apple.co/3t1MgYk",
        "https://twitter.com/intent/tweet?&text=%242%20million%20winning%20Powerball%20ticket%20sold%20in%20Gary%20for%20Wednesday%27s%20drawing&via=nwi&url=https%3A%2F%2Fwww.nwitimes.com%2Fnews%2Fstate-regional%2Fbusiness%2Fpowerball-lottery-winning-ticket-gary%2Farticle_97882bdc-cecc-11ef-b239-fbad5fa2f502.html%3Futm_medium%3Dsocial%26utm_source%3Dtwitter%26utm_campaign%3Duser-share",
        "https://hoosierlottery.com/games/draw/powerball/",
        "https://launcher.spot.im/spot/sp_zESgsuYF",
        "https://stitcher.com/show/pennywise",
        "https://trinitymedia.ai/player/trinity/${id}/",
        "https://google.com/podcasts?feed=aHR0cHM6Ly93d3cub21ueWNvbnRlbnQuY29tL2QvcGxheWxpc3QvMDJlM2JiYjAtOWU4Ny00ODMyLWIyOTctYWFiOTAxMTY4ZjkzLzcxZDNlMzY3LWRmYWMtNDM5NS1hYTdiLWFjYWEwMTIzMjBjMC9iOGI3ZjA2MC0wNzM2LTRlNjYtOWFiZC1hY2FhMDEyM2ZkYjcvcG9kY2FzdC5yc3M%3d",
        "https://www.apple.co/3t1MgYk",
        "https://wa.me/",
        "https://www.open-api.spot.im/v1/messages-count?spot_id=sp_zESgsuYF&posts_ids=97882bdc-cecc-11ef-b239-fbad5fa2f502",
        "https://open-api.spot.im/v1/messages-count",
        "https://www.hoosierlottery.com/games/draw/powerball/",
        "https://trinitymedia.ai/player/trinity/${id}/?pageURL=https://nwitimes.com/news/state-regional/business/powerball-lottery-winning-ticket-gary/article_97882bdc-cecc-11ef-b239-fbad5fa2f502.htmlpoweredBy&partner=Flex&textSelector=${text}&FAB=1`;",
        "https://www.open.spotify.com/show/6jx2UjMhFiQJbnoQ8z84VJ",
        "https://www.google.com/podcasts",
        "https://www.launcher.spot.im/spot/sp_zESgsuYF",
        "https://leeaws.com/cio/subscribe",
        "https://www.linktr.ee/leepodcasts",
        "https://www.leeaws.com/cio/subscribe/",
        "https://www.feed.cdnstream1.com/zjb/feed/download/13/a4/a6/13a4a67a-1da0-4149-a08f-0349d2063c56.xml",
        "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.nwitimes.com%2Fnews%2Fstate-regional%2Fbusiness%2Fpowerball-lottery-winning-ticket-gary%2Farticle_97882bdc-cecc-11ef-b239-fbad5fa2f502.html%3Futm_medium%3Dsocial%26utm_source%3Dfacebook%26utm_campaign%3Duser-share",
        "https://twitter.com/intent/tweet",
        "https://www.embed.audiocdn.com/?feed=aHR0cHM6Ly9mZWVkLmNkbnN0cmVhbTEuY29tL3pqYi9mZWVkL2Rvd25sb2FkLzEzL2E0L2E2LzEzYTRhNjdhLTFkYTAtNDE0OS1hMDhmLTAzNDlkMjA2M2M1Ni54bWw=&pbg=EFEFEF&lbg=F9F9F9&pt=353D58&st=676E85&bbg=FFFFFF&bi=353D58&limit=10",
        "https://www.shows.audiocdn.com/s/leeenterprises/pennywise-personal-finan-857111",
        "https://hoosierlottery.com/games/draw/powerball",
        "https://www.facebook.com/sharer/sharer.php",
        "https://wa.me/?text=https://nwitimes.com/news/state-regional/business/powerball-lottery-winning-ticket-gary/article_97882bdc-cecc-11ef-b239-fbad5fa2f502.html",
        "https://embed.audiocdn.com/",
        "https://www.twitter.com/intent/tweet?&text=%242%20million%20winning%20Powerball%20ticket%20sold%20in%20Gary%20for%20Wednesday%27s%20drawing&via=nwi&url=https%3A%2F%2Fwww.nwitimes.com%2Fnews%2Fstate-regional%2Fbusiness%2Fpowerball-lottery-winning-ticket-gary%2Farticle_97882bdc-cecc-11ef-b239-fbad5fa2f502.html%3Futm_medium%3Dsocial%26utm_source%3Dtwitter%26utm_campaign%3Duser-share"
    ],
    "external_images": [],
    "entities": {
        "persons": [
            {
                "name": "Dan Carden",
                "sentiment": "positive"
            }
        ],
        "organizations": [],
        "locations": [
            {
                "name": "Steel City",
                "sentiment": "none"
            }
        ]
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": null,
        "first_syndicated": false
    },
    "rating": null,
    "crawled": "2025-01-10T00:23:04.935+02:00",
    "updated": "2025-01-10T08:44:23.838+02:00"
}