{
    "thread": {
        "uuid": "5fd507dc3068e8d094d8a9ce4b53e66a8727ff0b",
        "url": "https://news.futunn.com/en/post/52013468/evergrande-services-stocks-surged-over-37-at-one-point-with",
        "site_full": "news.futunn.com",
        "site": "futunn.com",
        "site_section": "https://news.futunn.com",
        "site_categories": [],
        "section_title": "Global financial news - Futubull",
        "title": "Evergrande Services stocks surged over 37% at one point, with significant news coming from the three major Real Estate giants.",
        "title_full": "Evergrande Services stocks surged over 37% at one point, with significant news coming from the three major Real Estate giants.",
        "published": "2025-01-10T08:56:00.000+02:00",
        "replies_count": 0,
        "participants_count": 1,
        "site_type": "news",
        "country": "CN",
        "main_image": "https://newsfile.futunn.com/news-thumbnail/20250110/public/17364920006829794640511-17364920006814003416324.jpeg",
        "performance_score": 0,
        "domain_rank": 108204,
        "domain_rank_updated": "2025-01-06T23:00:00.000+02:00",
        "social": {
            "facebook": {
                "likes": 0,
                "comments": 0,
                "shares": 0
            },
            "vk": {
                "shares": 0
            }
        }
    },
    "uuid": "5fd507dc3068e8d094d8a9ce4b53e66a8727ff0b",
    "url": "https://news.futunn.com/en/post/52013468/evergrande-services-stocks-surged-over-37-at-one-point-with",
    "ord_in_thread": 0,
    "parent_url": null,
    "author": "Brokerage China",
    "published": "2025-01-10T08:56:00.000+02:00",
    "title": "Evergrande Services stocks surged over 37% at one point, with significant news coming from the three major Real Estate giants.",
    "text": "Investing Stocks HK Stocks US Stocks JP Stocks A-Shares Margin Trading IPO Derivatives & Cryptos ETF Options Futures Crypto Futu Money Plus Cash Plus Funds US Treasuries Structured Products Futu PWM Privare Wealth Management Go FUTU Securities check more > Markets Quotes Stocks Options Futures Fores ETF Trading Tools Paper Trade Stock Screener Heat Map Earnings Calendar Institutional Tracker Investment Themes App Store Download > Google Play Download > Mac Download > Windows Download > News & Community News Headlines 24/7 News Economic Calendar Topics Live Learn Library Courses Lectures Community Feeds Hot Topics Pricing Promotions Check more promotion > Welcome Rewards Enjoy 5%+5% Returns on Cash Plus Join Futubull Membership Program Referral Program Transfer Bonus Learn Premium Blog About About us > About Futu Milestones Newsroom Corporate Social Responsibility Contact us Join Us Futu I&E Futu Store Futu Experience Stores FUTU Store (Tsim Sha Tsui) G/F, 96 Nathan Road, Tsim Sha Tsui, Kowloon FUTU Store (Causeway Bay) G/F, Lai Yuen Apartments , 29-33 Lee Garden Road, Causeway Bay, Hong Kong FUTU Store（Mong Kok) G/F, 67-69 Argyle Street, Mongkok, Kowloon FUTU Head Office (Admiralty) 34/F, United Centre, 95 Queensway, Admiralty, HK FUTU Store（Tsuen Wan) G/F, No. 280 Sha Tsui Road, Tsuen Wan, New Territories Check more > Support More About About us Support English 繁體中文 简体中文 Sign up/Log in Download English Back Investing Stocks HK Stocks US Stocks JP Stocks A-Shares Margin Trading IPO Derivatives & Cryptos ETF Options Futures Crypto Futu Money Plus Cash Plus Funds US Treasuries Structured Products Futu PWM Privare Wealth Management Markets Quotes Stocks Options Futures Fores ETF Trading Tools Paper Trade Stock Screener Heat Map Earnings Calendar Institutional Tracker Investment Themes News & Community News Headlines 24/7 News Economic Calendar Topics Live Learn Library Courses Lectures Community Feeds Hot Topics Pricing Promotions Welcome Rewards Enjoy 5%+5% Returns on Cash Plus Join Futubull Membership Program Referral Program Transfer Bonus Learn Premium Blog About About us> About Futu Milestones Newsroom Corporate Social Responsibility Contact us Join Us Futu I&E Futu Store Support English 繁體中文 简体中文 Dark Light Open Account Headlines Evergrande Services stocks surged over 37% at one point, with significant news coming from the three major Real Estate giants. 港股恒大物业一度狂拉逾37%，房地产三大巨头集体传出重大消息 Evergrande Services stocks surged over 37% at one point, with significant news coming from the three major Real Estate giants. Brokerage China · 42 mins ago EVERG SERVICES +14.93% COUNTRY GARDEN 0.00% CHINA VANKE -5.07% EVERGRANDE 0.00% 来源：券商中国\n作者：时谦\n关于房地产巨头的重大消息传来！\n首先是 $中国恒大 (03333.HK)$ 。 市场传出，中国恒大全资附属CEG Holdings遭香港法院下令清盘，CEG Holdings持有 $恒大物业 (06666.HK)$ 近一半的股权，这意味着恒大清盘人将可进一步取得恒大的资产。港股恒大物业一度狂拉逾37%。\n其次是 $碧桂园 (02007.HK)$ 。 碧桂园控股发布公告披露了境外债务重组及业务发展的最新情况。根据公告，碧桂园宣布了重组提案的关键条款，并且其已与由七家知名银行（均为集团长期业务伙伴）组成的协调委员会达成共识，此提案构成进一步谈判和具体文件的框架，旨在落实集团的境外债务重组。倘若落实，重组提案将使碧桂园实现大幅去杠杆化，目标是减少债务最多116亿美元，\n第三是 $万科企业 (02202.HK)$ 。 万科公告称，子公司深圳市泊澜租赁服务有限公司向上海浦东发展银行申请10.8亿元为期30年的银行贷款并完成提款，由公司控股的深圳市泊帆住房租赁管理有限公司为贷款提供担保。万科昨天在回应媒体时称，针对2025年将要到期的公开债务，公司会全力以赴，继续从经营端和融资端等多方面筹集资金。\n万科还公告称，控股子公司武汉誉天兴业置地有限公司以保险资金不动产债权投资计划形式，成功融资20.4亿元，并将该笔融资的到期日调整至2026年底。\n清盘令 1月10日，中国恒大集团清盘案又有新进展。香港司法机构网站显示，香港高等法院聆案官林泽铭将于2025年1月10日下午2时30分就有关无力偿还的杂项申请进行内庭聆讯。\n据阿斯达克财经，中国恒大全资附属CEG Holdings遭香港法院下令清盘，CEG Holdings持有恒大物业 近一半的股权，这意味着恒大清盘人将可进一步取得恒大的资产。\n目前清盘人正在试图向包括创办人许家印在内的七名人士追回约60亿美元的股息及薪酬，同时还开始对恒大的核数师及房地产服务公司提出诉讼。\n受此提振，恒大物业今天午后一度大涨超37%。\n值得注意的是，天眼查法律诉讼信息显示，1月6日，恒大地产集团有限公司新增15条被执行人和恢复执行信息，执行标的合计10.5亿余元，涉及票据纠纷、金融借款合同纠纷等案件，部分案件被执行人还包括邯郸市大业房地产开发有限公司、贵阳恒大云景房地产开发有限公司等，执行法院包括河北省邯郸市中级人民法院、贵州省贵阳市中级人民法院等。\n深度风险信息显示，恒大地产集团有限公司现存460余条被执行人信息，被执行总金额超540亿元。此外，该公司还存在多条限制消费令、失信被执行人（老赖）及终本案件信息。\n碧桂园迎利好 碧桂园方面则有利好传来。据该公司最新公告，境外债务重组及业务发展有最新进展。\n根据公告，碧桂园宣布了重组提案的关键条款，并且其已与由七家知名银行（均为集团长期业务伙伴）组成的协调委员会达成共识，此提案构成进一步谈判和具体文件的框架，旨在落实集团的境外债务重组。倘若落实，重组提案将使碧桂园实现大幅去杠杆化，目标是减少债务最多116亿美元，这也包括将到期时间延长至最多11.5年以及降低融资成本，目标是将加权平均借贷成本从重组前的每年约6%降低至重组后的每年约2%。\n同时，碧桂园控股股东正在考虑将集团未偿还本金总额11亿美元的现有股东贷款转换为公司或附属公司的股份，具体条款有待协定。\n公告称，协调委员会由共同持有或控制碧桂园三笔银团贷款（未偿还本金总额为36亿美元）未偿还本金额约48%的贷款人组成，其支持碧桂园持续努力落实重组。重组提案拟给予范围内债务的持有人/贷款人（统称债权人）五个经济选项，以将其范围内债务转换为现金（通过要约回购）、强制性可转换债券、不同票据及/或贷款融资。\n碧桂园向债权人提供以下架构：一是在交易的生效日将债权人所持相关范围内债务通过要约回购出售予公司，以换取现金，价格较债务面值存在折让；二是纯粹股权化；三是年期延长及部份股权化；四是年期延长并设有本金削减；五是仅延长到期日，不设本金削减，以配合债权人的不同偏好及需要。\n万科最新消息 最近，万科热度亦在上升。据万科最新公告，子公司深圳市泊澜租赁服务有限公司向上海浦东发展银行申请10.8亿元为期30年的银行贷款并完成提款，由公司控股的深圳市泊帆住房租赁管理有限公司为贷款提供担保。\n另外，万科的控股子公司武汉誉天兴业置地有限公司通过保险资金不动产债权投资计划形式向新华资产融资，截至目前，本次融资余额20.4亿元，经协商本次融资到期日调整至2026年12月31日。万科继续为该融资提供连带责任保证担保。\n昨天，多只万科境内债走低，“22万科02”一度跌超15%，“22万科06”跌超6%，“20万科08”跌近6%，“23万科01”跌近5%，“21万科02”跌超2%。今天，多只万科内债依然走势较弱。\n万科在回应媒体时称，针对2025年将要到期的公开债务，公司会全力以赴，继续从经营端和融资端等多方面筹集资金。万科表示，将通过积极销售回款、持续推进大宗交易、加快非主营业务退出和持续争取融资资源等方式，应对相关债务兑付。\n编辑/rice\nSource: Brokerage China Author: Qu Hongyan Recently, China Yangtze Power hit a historical high and once again showed the slow bull stock trend of \"tripling in ten years\". The slow bull market has left behind many passers-by and brought good returns to the steadfast investors. It is \"rare for those who triple in one year to be like carp jumping over the dragon gate, while those who double in three years are few and far between.\" On the other end of the investment world, however, violent collapses are also deafening, with many financial products suspected of \"Ponzi schemes\" ceasing payments, leaving investors with no hope of recovering their investments. Both positive and negative cases illustrate the importance of forming a suitable mentality towards money in one's lifetime; otherwise, sooner or later, you will divorce yourself from your money. \"I call this the money mind, a person's IQ can reach 120, 140, or even higher levels, and perhaps some people's minds are good at doing one thing, while others are good at doing another. They can do things that most ordinary people can't do. But I know some very smart people who make very foolish decisions because they lack the money mind.\" Buffett once said so. The so-called money mind refers to believing in common sense, believing in compound interest, being cautious and rational, thinking independently, prioritizing security over return, not dealing with people with questionable character, not easily guaranteeing for others, not believing in windfall profits, and not trying to cross legal norms for extra benefits. In today's world of ubiquitous information, everyone's wealth may become the \"prey\" of those with ulterior motives. Only with the money mind, can one form good behavior habits and shield oneself from separating from one's wealth. Do not entrust your wealth easily. Wealth is easy to lose but hard to accumulate, and trust is a vital reason leading to the rapid loss of wealth. \"Do not allow anyone else to manage your business unless you can watch their every move closely and understand their behavior; or you have strong reasons to believe in their character and ability. For investors, this criterion determines when you can let someone else make investment decisions for you.\" Graham's criterion written eighty years ago is so clear. Almost all the investors who lost their wealth in the financial products have violated the above two criteria. They did not have the ability to closely supervise the whereabouts of their funds, nor did they have sufficient reasons to believe in the character of the product issuers. They easily invested their own wealth solely based on others' glib tongue and a piece of commitment paper. They did not act as gatekeepers of their own wealth and ended up with nothing left even if the government punished the wrongdoers. \"An ounce of prevention is worth a pound of cure.\" This is a phrase Munger often says. Destiny must be in one's own hands, and investors with a suitable money mind will try their best to find suspicious points in their investments to protect the safety of their principal. For example, whether the manager is trustworthy, whether the underlying assets are profitable, whether oneself can timely monitor the risks in the investment process, and whether the sales staff is obtaining large commissions. As long as any unreliable signs are found, these investors firmly will not invest their money. Do not desire to get rich quick. As in the capital market and anywhere else, making money is not easy, and desiring to get rich quick will lead to quick loss of wealth. In the capital market, the desire to get rich quickly often leads to investors over-allocating specific stocks, industries, or assets at the worst time. For example, buying high-risk stocks that can gain huge returns once an adventure succeeds, but the chance of success is very small, also known as \"whispering stocks\" by legendary fund manager Peter Lynch. \"They often tell investors a story with explosive effects. These 'whispering stocks' have a hypnotic effect on people, and it is easy for you to believe that the story the company tells has an emotional appeal that can easily confuse you.\" This is like hearing a very tempting \"sizzling\" sound, making you salivate, but you did not notice that there is no steak on the grill. In the eyes of investors who lack the money mind, stable yield provided by blue chips such as China Yangtze Power cannot meet their demands. However, historical experience clearly shows that buying stocks lacking in safety solely based on imagined high yields is unwise. The long-term average investment return of general stocks is 9%-10%, which is also the average investment return of stock indexes in history, a benchmark to measure one's investment performance and the benchmark to measure fund investment performance.\nAuthor: Shi Qian\nMajor news has come regarding the Real Estate giants!\nFirst, there is $EVERGRANDE (03333.HK)$ . There are market rumors that EVERGRANDE's wholly-owned subsidiary CEG Holdings has been ordered to be liquidated by the Hong Kong court, and CEG Holdings holds $EVERG SERVICES (06666.HK)$ nearly half of the equity, which means that the liquidator of EVERGRANDE will be able to further acquire EVERGRANDE's assets. EVERG SERVICES on the Hong Kong stock market once surged over 37%.\nSecondly, $COUNTRY GARDEN (02007.HK)$ . COUNTRY GARDEN Holdings released an announcement disclosing the latest situation regarding its overseas debt restructuring and business development. According to the announcement, COUNTRY GARDEN announced the key terms of the restructuring proposal, and it has reached a consensus with a coordination committee consisting of seven well-known Banks (all long-term business partners of the group). This proposal constitutes a framework for further negotiations and specific documentation, aimed at implementing the group's overseas debt restructuring. If implemented, the restructuring proposal will allow COUNTRY GARDEN to achieve significant deleveraging, with a target of reducing debt by up to 11.6 billion dollars,\nThirdly, $CHINA VANKE (02202.HK)$ . CHINA VANKE announced that its subsidiary Shenzhen Bolan Rental & Leasing Services Co., Ltd. has applied for a 1.08 billion yuan, 30-year bank loan from Shanghai Pudong Development Bank and completed the withdrawal. The loan is guaranteed by Shenzhen Bofan Housing Rental Management Co., Ltd., which is held by the company. CHINA VANKE stated yesterday in response to the media that it will make every effort to raise funds for public debts due in 2025 from various aspects including operation and financing.\nCHINA VANKE also announced that its holding subsidiary Wuhan Yutian Industrial Real Estate Co., Ltd. has successfully financed 2.04 billion yuan through a real estate bond investment plan using insurance funds, and it has adjusted the maturity date of this financing to the end of 2026.\nLiquidation order On January 10, there was another new development in the EVERGRANDE Group's liquidation case. The Hong Kong judiciary's website shows that the Hong Kong High Court hearing officer, Lam Chak-ming, will hold an internal hearing on January 10, 2025, at 2:30 PM regarding the miscellaneous applications for inability to repay.\nAccording to Asdaq Finance, the wholly-owned subsidiary of EVERGRANDE, CEG Holdings, has been ordered to be liquidated by a Hong Kong court. CEG Holdings holds nearly half of the shares of EVERG SERVICES, which means the liquidator will further obtain EVERGRANDE's Assets.\nCurrently, the liquidator is trying to recover about 6 billion dollars in dividends and salaries from seven individuals, including founder Xu Jiayin, and has also initiated lawsuits against EVERGRANDE's auditors and Real Estate Services companies.\nDriven by this boost, EVERG SERVICES surged more than 37% this afternoon.\nNotably, Tianyancha legal litigation information shows that on January 6, EVERGRANDE REAL ESTATE GROUP CO., LTD added 15 new enforcement and recovery information items, with a total enforcement symbol of over 1.05 billion yuan, involving cases such as bills disputes and financial loan contract disputes. Some of the defendants in these cases also include Handan Daye Real Estate Development Co., Ltd. and Guiyang EVERGRANDE Yunjing Real Estate Development Co., Ltd., with the enforcing courts including the Intermediate People's Court of Handan City, Hebei Province and the Intermediate People's Court of Guiyang City, Guizhou Province.\nDeep risk information shows that EVERGRANDE REAL ESTATE GROUP CO., LTD currently has over 460 pieces of defendant information, with a total enforcement amount exceeding 54 billion yuan. In addition, the company also has multiple consumption restrictions, dishonest executors, and cases of final rulings.\nCOUNTRY GARDEN welcomes Bullish news. Positive news has emerged from COUNTRY GARDEN. According to the company's latest announcement, there has been new developments in Overseas debt restructuring and business development.\nAccording to the announcement, COUNTRY GARDEN has announced key terms of the restructuring proposal and has reached a consensus with a coordination committee composed of seven well-known Banks (all long-term business partners of the Group). This proposal constitutes a framework for further negotiations and specific documents aimed at implementing the Group's Overseas debt restructuring. If implemented, the restructuring proposal will allow COUNTRY GARDEN to significantly deleverage, targeting a debt reduction of up to 11.6 billion USD, which also includes extending the maturity to a maximum of 11.5 years and lowering financing costs, aiming to reduce the weighted average borrowing cost from approximately 6% per year before restructuring to about 2% per year after restructuring.\nAt the same time, the controlling Shareholder of COUNTRY GARDEN is considering converting the total outstanding principal of 1.1 billion USD in existing shareholder loans to the Group into shares of the company or its subsidiaries, with specific terms pending agreement.\nThe announcement stated that the coordination committee is composed of lenders who collectively hold or control approximately 48% of the outstanding principal amount of three syndicated loans from COUNTRY GARDEN (total outstanding principal of 3.6 billion USD), and they support COUNTRY GARDEN's ongoing efforts to implement the restructuring. The restructuring proposal intends to offer five economic options to holders/lenders of the debt within scope (collectively referred to as creditors) to convert their debt into Cash (via tender offer), mandatory convertible bonds, different notes and/or loan financing.\nCOUNTRY GARDEN offers creditors the following scheme: First, on the effective date of the transaction, the related debt held by creditors within scope will be sold back to the company via a tender offer in exchange for Cash, at a price at a discount to the debt's face value; Second, pure equity conversion; Third, term extension with partial equity conversion; Fourth, term extension with principal reduction; Fifth, only extending the maturity date without principal reduction, to accommodate the different preferences and needs of creditors.\nLatest news from CHINA VANKE. Recently, CHINA VANKE's popularity has also been rising. According to CHINA VANKE's latest announcement, subsidiary Shenzhen Bolan Rental & Leasing Services Co., Ltd. has applied for a 1.08 billion yuan, 30-year bank loan from Shanghai Pudong Development Bank and has completed the drawdown, with Shenzhen Bofan Housing Rental Management Co., Ltd., controlled by the company, providing guarantee for the loan.\nIn addition, CHINA VANKE's holding subsidiary Wuhan Yutian Industrial Real Estate Co., Ltd. is financing through an Insurance Funds real estate debt investment plan with Xinhua Assets, and as of now, the balance of this financing is 2.04 billion yuan, and the maturity date of this financing has been negotiated to be adjusted to December 31, 2026. CHINA VANKE continues to provide joint liability guarantee for this financing.\nYesterday, several domestic bonds of CHINA VANKE declined, with \"0.22 million Vanke 02\" once dropping over 15%, \"0.22 million Vanke 06\" dropping over 6%, \"0.2 million Vanke 08\" falling nearly 6%, \"0.23 million Vanke 01\" dropping nearly 5%, and \"0.21 million Vanke 02\" dropping over 2%. Today, several domestic bonds of CHINA VANKE still remain weak.\nIn response to the media, CHINA VANKE stated that it will do its utmost to address the public debt maturing in 2025 by raising funds from various aspects, including Operations and financing. CHINA VANKE emphasized that it will deal with related debt repayments through proactive sales and collections, continuous promotion of bulk transactions, accelerating the exit from non-core businesses, and persistently seeking financing resources.\nEditor/rice\nThe translation is provided by third-party software.\nThe above content is for informational or educational purposes only and does not constitute any investment advice related to Futu. Although we strive to ensure the truthfulness, accuracy, and originality of all such content, we cannot guarantee it. Risk Disclaimer The above content is for informational or educational purposes only and does not constitute any investment advice related to Futu. Although we strive to ensure the truthfulness, accuracy, and originality of all such content, we cannot guarantee it. Got it Risk Disclaimer The above content is for informational or educational purposes only and does not constitute any investment advice related to Futu. Although we strive to ensure the truthfulness, accuracy, and originality of all such content, we cannot guarantee it. Got it Write a comment 0 0 0 Like Love Laughing Cry Respect Emm Sad Angry Tap to Select a Mood 分享到weixin 分享到qq 分享到facebook 分享到twitter 分享到微博 粘贴板 Use the share button in your browser to share the page with your friends\nTap here to share No comments yet. Write one. Related Stocks Related Stocks Symbol Mini Chart Price EVERG SERVICES 06666 -- 0.750 KINGFARPROPERTY 01354 -- 29.000 JIAYUAN SER 01153 -- 0.445 FINELAND LIVING 09978 -- 0.060 CG SERVICES 06098 -- 5.130 Unlock the Full List\nLatest 15:37 How to view the recent fluctuations in the RMB Exchange Rates? Institutions: The RMB Exchange Rates Index is expected to remain stable. 15:36 JPMorgan: Expects Alibaba to show positive development trends for the last quarter, reiterating its 'Shareholding' rating. BABA -0.94% 15:36 Shanghai: Promote the clinical trials of Brain-computer Interface, develop ethical standard operating procedures and related management systems for Brain-computer Interface clinical trials. Statement This page is machine-translated. Futubull tries to improve but does not guarantee the accuracy and reliability of the translation, and will not be liable for any loss or damage caused by any inaccuracy or omission of the translation. OK",
    "highlightText": "",
    "highlightTitle": "",
    "highlightThreadTitle": "",
    "language": "english",
    "sentiment": "positive",
    "categories": [
        "Economy, Business and Finance"
    ],
    "topics": [
        "Economy, Business and Finance->financial and economic news"
    ],
    "ai_allow": true,
    "has_canonical": false,
    "breaking": null,
    "webz_reporter": false,
    "external_links": [
        "https://www.futuhk.com/en/about-us/futu-store",
        "https://www.futuhk.com/en/products/exchange-traded-funds",
        "https://invest.futuhk.com/lectures_website",
        "https://www.futuhk.com/en/products/futures",
        "https://mp.weixin.qq.com/s/-cfkMK2ITERS1mIEsr_pHg",
        "https://invest.futuhk.com/hkstocktransfer-event?lang=zh-hk",
        "https://www.futuhk.com/en/about-us#ContactUs",
        "https://www.futuhk.com/en/about-us/csr",
        "https://www.futuhk.com/identity?lang=en-us",
        "https://invest.futuhk.com/welcome-2409?lang=en-us",
        "https://www.futuhk.com/en/products/learn-premium",
        "https://www.futuhk.com/en/products/us-stocks",
        "https://www.futuhk.com/en/stockalpha",
        "https://www.futuhk.com/en/products/crypto",
        "https://www.futuhk.com/commissionnew",
        "https://fund-upgrowth.futuhk.com/fego/cashplus-newusers-2401",
        "https://funds.futuhk.com/deposit?lang=en-us",
        "https://www.futuhk.com/en/about-us",
        "https://www.futuhk.com/en/products/structured-products",
        "https://invest.futuhk.com/vipofficial",
        "https://www.futuhk.com/en/private-wealth",
        "https://hk-upgrowth.futuhk.com/act/invitation",
        "https://www.futuhk.com/en/about-us#Milestone",
        "https://www.futuhk.com/en/products/jp-stock",
        "https://www.futuhk.com/en/products/funds",
        "https://www.futuhk.com/products/cash-plus",
        "https://www.futuhk.com/en/about-us#JoinUs",
        "https://www.futuhk.com/blog",
        "https://setup2.futuhk.com/?lang=en-us",
        "https://www.futuhk.com/en/products/us-bonds",
        "https://www.futuhk.com/en",
        "https://www.futuhk.com/en/about-us/promotions",
        "https://www.futuhk.com/en/products/ipo",
        "https://www.futuhk.com/en/products/hk-stock",
        "https://www.futuie.com/en/",
        "https://www.futuhk.com/en/about-us/newsroom",
        "https://www.futuhk.com/en/products/options",
        "https://www.futuhk.com/en/products/margin",
        "https://futuhk.com/en/products/futures",
        "https://setup2.futuhk.com/",
        "https://www.setup2.futuhk.com/?lang=en-us",
        "https://futuhk.com/identity?lang=en-us",
        "https://www.invest.futuhk.com/hkstocktransfer-event?lang=zh-hk",
        "https://www.invest.futuhk.com/lectures_website",
        "https://www.futuie.com/en",
        "https://futuhk.com/en/products/funds",
        "https://www.funds.futuhk.com/deposit?lang=en-us",
        "https://futuhk.com/en/about-us#Milestone",
        "https://futuhk.com/en/about-us#ContactUs",
        "https://futuhk.com/en/about-us/promotions",
        "https://futuhk.com/en/products/options",
        "https://www.hk-upgrowth.futuhk.com/act/invitation",
        "https://www.fund-upgrowth.futuhk.com/fego/cashplus-newusers-2401",
        "https://www.futuhk.com/identity",
        "https://futuhk.com/en/products/learn-premium",
        "https://funds.futuhk.com/deposit",
        "https://futuhk.com/commissionnew",
        "https://futuhk.com/blog",
        "https://futuhk.com/en/about-us#JoinUs",
        "https://futuie.com/en/",
        "https://futuhk.com/en/about-us/newsroom",
        "https://futuhk.com/en/products/ipo",
        "https://futuhk.com/en/about-us/csr",
        "https://futuhk.com/en/about-us/futu-store",
        "https://futuhk.com/products/cash-plus",
        "https://futuhk.com/en/about-us",
        "https://futuhk.com/en/products/us-stocks",
        "https://invest.futuhk.com/hkstocktransfer-event",
        "https://www.mp.weixin.qq.com/s/-cfkMK2ITERS1mIEsr_pHg",
        "https://futuhk.com/en/products/crypto",
        "https://futuhk.com/en/products/hk-stock",
        "https://futuhk.com/en/products/jp-stock",
        "https://www.invest.futuhk.com/vipofficial",
        "https://futuhk.com/en/products/structured-products",
        "https://futuhk.com/en",
        "https://futuhk.com/en/products/exchange-traded-funds",
        "https://futuhk.com/en/private-wealth",
        "https://futuhk.com/en/products/us-bonds",
        "https://invest.futuhk.com/welcome-2409",
        "https://futuhk.com/en/stockalpha",
        "https://www.invest.futuhk.com/welcome-2409?lang=en-us",
        "https://futuhk.com/en/products/margin"
    ],
    "external_images": [],
    "entities": {
        "persons": [],
        "organizations": [],
        "locations": []
    },
    "syndication": {
        "syndicated": false,
        "syndicate_id": null,
        "first_syndicated": false
    },
    "rating": null,
    "crawled": "2025-01-10T09:35:00.885+02:00",
    "updated": "2025-01-10T09:38:47.836+02:00"
}